{
 "cells": [
  {
   "cell_type": "code",
   "id": "537085a2",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T16:00:57.697849500Z",
     "start_time": "2025-11-05T16:00:57.625640900Z"
    }
   },
   "source": [
    "from pathlib import Path\n",
    "\n",
    "import pandas as pd\n",
    "from promg.modules.db_management import DBManagement\n",
    "from promg import Configuration, DatabaseConnection, Performance, SemanticHeader, DatasetDescriptions, OcedPg, Query\n",
    "\n",
    "import yaml\n",
    "\n",
    "import plotly.express as px\n",
    "import plotly.subplots as sp\n",
    "import plotly.graph_objects as go"
   ],
   "outputs": [],
   "execution_count": 85
  },
  {
   "cell_type": "code",
   "id": "60b6e72b",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T14:56:11.646287900Z",
     "start_time": "2025-11-05T14:56:11.628396400Z"
    }
   },
   "source": [
    "case_study = 'bpic14'\n",
    "\n",
    "conf_path = Path(case_study, 'config.yaml')\n",
    "config = yaml.safe_load(open(conf_path))\n",
    "\n",
    "print(f\"These are the credentials that I expect to be set for the database.\")\n",
    "print(f\"db_name: {config['db_name']}\")\n",
    "print(f\"uri: {config['uri']}\")\n",
    "print(f\"password: {config['password']}\")\n",
    "print(\"----------------------\")\n",
    "print(f\"If you have other credentials, please change them at: {conf_path}\")\n",
    "\n",
    "config = Configuration.init_conf_with_config_file(conf_path)\n",
    "db_connection = DatabaseConnection.set_up_connection(config=config)"
   ],
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "These are the credentials that I expect to be set for the database.\n",
      "db_name: neo4j\n",
      "uri: bolt://localhost:7687\n",
      "password: bpic2014\n",
      "----------------------\n",
      "If you have other credentials, please change them at: bpic14\\config.yaml\n"
     ]
    }
   ],
   "execution_count": 2
  },
  {
   "cell_type": "code",
   "id": "ca768b4f",
   "metadata": {},
   "source": [
    "# clear previously created nodes and relations\n",
    "# start/end relations\n",
    "qClearStart = f'''MATCH (n)<-[r:START]-(e:Event) DELETE r'''\n",
    "db_connection.exec_query(qClearStart)\n",
    "qClearEnd = f'''MATCH (n)<-[r:END]-(e:Event) DELETE r'''\n",
    "db_connection.exec_query(qClearEnd)\n",
    "# high-level events\n",
    "qClearStartHLE = f'''MATCH (n)<-[r:START]-(e:HighLevelEvent) DELETE r'''\n",
    "db_connection.exec_query(qClearStartHLE)\n",
    "qClearEndHLE = f'''MATCH (n)<-[r:END]-(e:HighLevelEvent) DELETE r'''\n",
    "db_connection.exec_query(qClearEndHLE)\n",
    "qClearHighLevelEvent = f'''MATCH (h:HighLevelEvent) DETACH DELETE h'''\n",
    "db_connection.exec_query(qClearHighLevelEvent)\n",
    "qClearHL_DF = f'''MATCH (:Event)-[r:HL_DF]-(e:Event) DELETE r'''\n",
    "db_connection.exec_query(qClearHL_DF)"
   ],
   "outputs": [],
   "execution_count": null
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T14:26:11.624749700Z",
     "start_time": "2025-11-05T14:26:08.222769500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "qClearStart = '''\n",
    ":auto\n",
    "MATCH (n)<-[r:START_CORR]-(e:HighLevelEvent)\n",
    "CALL (r) {\n",
    "    DELETE r\n",
    "} IN TRANSACTIONS\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(qClearStart)\n",
    "qClearEnd = '''\n",
    ":auto\n",
    "MATCH (n)<-[r:END_CORR]-(e:HighLevelEvent)\n",
    "CALL (r) {\n",
    "    DELETE r\n",
    "} IN TRANSACTIONS\n",
    "'''\n",
    "db_connection.exec_query(qClearEnd)"
   ],
   "id": "f8c8dd93901e6ec0",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 11
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T15:19:15.462879600Z",
     "start_time": "2025-11-05T15:18:18.563628800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "qClearDuring = '''\n",
    ":auto\n",
    "MATCH (:HighLevelEvent)<-[r:DURING]-(:HighLevelEvent)\n",
    "CALL (r) {\n",
    "    DELETE r\n",
    "} IN TRANSACTIONS\n",
    "'''\n",
    "db_connection.exec_query(qClearDuring)"
   ],
   "id": "c13d7edd6d9f4a80",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 31
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "3c288895",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<bound method Result.single of <neo4j._sync.work.result.Result object at 0x00000221C9219910>>\n"
     ]
    }
   ],
   "source": [
    "# fix DF relations for incidents\n",
    "qDeleteDFIncidents = f'''\n",
    "    MATCH (e1:Event)-[df:DF {{objectType:\"Incident\"}}]->(e2:Event)\n",
    "    DELETE df\n",
    "'''\n",
    "db_connection.exec_query(qDeleteDFIncidents)\n",
    "\n",
    "with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "    qBuildDFIncidents = f'''\n",
    "        MATCH (e:Event)-[:CORR]->(o:Incident)\n",
    "        WHERE e.timestamp IS NOT NULL\n",
    "        WITH o, e ORDER BY e.timestamp, ID(e)\n",
    "        WITH o, collect(e) AS events\n",
    "        UNWIND range(0, size(events)-2) AS idx\n",
    "        WITH events[idx] AS fromEv, events[idx+1] AS toEv, o.sysId AS objSysId\n",
    "        MERGE (fromEv)-[rel:DF {{objectType:\"Incident\", id:objSysId}}]->(toEv)\n",
    "    '''\n",
    "    result = session.run(qBuildDFIncidents)\n",
    "    result.consume()\n",
    "    print(str(result.single))"
   ]
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T14:03:07.265995400Z",
     "start_time": "2025-11-05T14:03:07.252981900Z"
    }
   },
   "cell_type": "code",
   "source": "objectTypes = [\"Change\", \"Incident\", \"Interaction\"]",
   "id": "7113d1308e78b1a4",
   "outputs": [],
   "execution_count": 5
  },
  {
   "cell_type": "code",
   "id": "3ab1924a",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T13:22:41.111062600Z",
     "start_time": "2025-11-05T13:22:32.072933400Z"
    }
   },
   "source": [
    "# infer start and end events for each object type\n",
    "\n",
    "for objectType in objectTypes:\n",
    "    print(f\"Inferring start and end events for object type: {objectType}\")\n",
    "\n",
    "    qStartEvent = f'''\n",
    "    // Infer start event of an object\n",
    "    MATCH (n:{objectType})\n",
    "    MATCH (n)<-[c:CORR]-(e:Event) WHERE NOT ()-[:DF {{id:n.sysId}}]->(e)\n",
    "    MERGE (n)<-[:START]-(e)\n",
    "    '''\n",
    "    result = db_connection.exec_query(qStartEvent)\n",
    "    qEndEvent = f'''\n",
    "    // Infer start event of an object\n",
    "    MATCH (n:{objectType})\n",
    "    MATCH (n)<-[c:CORR]-(e:Event) WHERE NOT (e)-[:DF {{id:n.sysId}}]->()\n",
    "    MERGE (n)<-[:END]-(e)\n",
    "    '''\n",
    "    db_connection.exec_query(qEndEvent)"
   ],
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Inferring start and end events for object type: Change\n",
      "Inferring start and end events for object type: Incident\n",
      "Inferring start and end events for object type: Interaction\n"
     ]
    }
   ],
   "execution_count": 4
  },
  {
   "cell_type": "code",
   "id": "57982ba2",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T13:22:42.113162100Z",
     "start_time": "2025-11-05T13:22:41.621067600Z"
    }
   },
   "source": [
    "# materialize time between events as duration on DF edge\n",
    "with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "    q_materialize_duration_on_df = f'''\n",
    "        MATCH (e1:Event)-[df:DF]->(e2:Event) WHERE df.duration IS NOT NULL\n",
    "        CALL {{\n",
    "            WITH e1,e2,df\n",
    "            SET df.duration = duration.inSeconds(e1.timestamp, e2.timestamp).seconds    \n",
    "        }} IN TRANSACTIONS OF 1000 ROWS\n",
    "        RETURN count(*) AS total\n",
    "    '''\n",
    "    result = session.run(q_materialize_duration_on_df)\n",
    "    result.consume()\n",
    "    print(str(result.single))"
   ],
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N00', status_description='warn: feature deprecated. CALL subquery without a variable scope clause is deprecated. Use CALL (e1, e2, df) { ... }', position=<SummaryInputPosition line=3, column=9, offset=84>, raw_classification='DEPRECATION', classification=<NotificationClassification.DEPRECATION: 'DEPRECATION'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'DEPRECATION', '_severity': 'WARNING', '_position': {'offset': 84, 'line': 3, 'column': 9}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n        MATCH (e1:Event)-[df:DF]->(e2:Event) WHERE df.duration IS NOT NULL\\n        CALL {\\n            WITH e1,e2,df\\n            SET df.duration = duration.inSeconds(e1.timestamp, e2.timestamp).seconds    \\n        } IN TRANSACTIONS OF 1000 ROWS\\n        RETURN count(*) AS total\\n    '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<bound method Result.single of <neo4j._sync.work.result.Result object at 0x000001A638B528D0>>\n"
     ]
    }
   ],
   "execution_count": 5
  },
  {
   "cell_type": "code",
   "id": "98e4243c",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T13:24:35.347782200Z",
     "start_time": "2025-11-05T13:24:35.298785900Z"
    }
   },
   "source": [
    "# build index for high-level events\n",
    "qCreateIndexHLE_sys = f'''\n",
    "    CREATE INDEX highLevelEventSysIdIndex IF NOT EXISTS FOR (h:HighLevelEvent) ON (h.sysId);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_sys)\n",
    "qCreateIndexHLE_start = f'''\n",
    "    CREATE INDEX highLevelEventStartTimeIndex IF NOT EXISTS FOR (h:HighLevelEvent) ON (h.startTime);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_start)\n",
    "qCreateIndexHLE_end = f'''\n",
    "    CREATE INDEX highLevelEventEndTimeIndex IF NOT EXISTS FOR (h:HighLevelEvent) ON (h.endTime);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_end)"
   ],
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 7
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T13:32:43.984870Z",
     "start_time": "2025-11-05T13:32:34.725607300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# build high-level events\n",
    "qBuildHighLevelEvent = '''\n",
    "    :auto\n",
    "    MATCH (n) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "    MATCH (eStart:Event)-[st:START]->(n)<-[en:END]-(eEnd:Event)\n",
    "    WITH DISTINCT eStart, eEnd\n",
    "    CALL (eStart, eEnd) {\n",
    "        MERGE (h:HighLevelEvent {sysId: eStart.sysId + \"_\" + eEnd.sysId})\n",
    "        ON CREATE SET h.startTime=eStart.timestamp, h.endTime=eEnd.timestamp, h.activity=$objectType\n",
    "        MERGE (h)-[:START]->(eStart)\n",
    "        MERGE (h)-[:END]->(eEnd)\n",
    "    } IN TRANSACTIONS\n",
    "'''\n",
    "\n",
    "for objectType in objectTypes:\n",
    "    query = Query(\n",
    "        query_str=qBuildHighLevelEvent,\n",
    "        parameters={\n",
    "            \"objectType\": objectType,\n",
    "        }\n",
    "    )\n",
    "\n",
    "    db_connection.exec_query(query)"
   ],
   "id": "6986d35a4303d9d7",
   "outputs": [],
   "execution_count": 13
  },
  {
   "cell_type": "code",
   "id": "fd4364e7",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T13:34:44.815068300Z",
     "start_time": "2025-11-05T13:34:39.138867300Z"
    }
   },
   "source": [
    "# lift CORR to high-level events\n",
    "qLiftCorrToHL = '''\n",
    "    :auto\n",
    "    MATCH (h:HighLevelEvent)-[:START]->(eStart:Event)-[:CORR]->(n)\n",
    "    CALL (h, n) {\n",
    "        MERGE(h) - [:CORR]->(n)\n",
    "    } IN TRANSACTIONS\n",
    "'''\n",
    "db_connection.exec_query(qLiftCorrToHL)"
   ],
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 15
  },
  {
   "cell_type": "code",
   "id": "d9d5e7e1",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T14:02:52.329822700Z",
     "start_time": "2025-11-05T14:02:52.324912Z"
    }
   },
   "source": [
    "# build DF relations between high-level events\n",
    "# step 1: build HL-DF relations between events\n",
    "\n",
    "qBuildDfRelationsHLE = '''\n",
    "    :auto\n",
    "    // get only START/END events of each HL event correlated to CI_SC\n",
    "    MATCH (ot:ObjectType {objectType: $objectType}) <- [:IS_OF_TYPE] - (o) <-[:CORR]-(h:HighLevelEvent)-->(e:Event)\n",
    "    // order by time\n",
    "    WHERE e.timestamp IS NOT NULL\n",
    "    WITH o, e ORDER BY e.timestamp, ID(e)\n",
    "    WITH o, collect(e) AS events\n",
    "    UNWIND range(0, size(events)-2) AS idx\n",
    "    WITH events[idx] AS fromEv, events[idx+1] AS toEv, o\n",
    "    CALL (fromEv,toEv,o) {\n",
    "        // get their HL events correlated to the same object\n",
    "        MATCH (fromEv)<--(h1:HighLevelEvent)-[:CORR]->(o)<-[:CORR]-(h2:HighLevelEvent)-->(toEv) WHERE h1 <> h2\n",
    "        // and add their DF relation\n",
    "        MERGE (h1)-[rel:DF {objectType:$objectType, id:o.sysId}]->(h2)\n",
    "    } IN TRANSACTIONS\n",
    "    RETURN count(*) AS total\n",
    "'''"
   ],
   "outputs": [],
   "execution_count": 3
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T14:03:21.090326100Z",
     "start_time": "2025-11-05T14:03:15.067407800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "for objectType in objectTypes:\n",
    "    query = Query(\n",
    "        query_str=qBuildDfRelationsHLE,\n",
    "        parameters={\n",
    "            \"objectType\": objectType,\n",
    "        }\n",
    "    )\n",
    "\n",
    "    db_connection.exec_query(query)"
   ],
   "id": "1b20613c5218d711",
   "outputs": [],
   "execution_count": 6
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T14:47:15.169123200Z",
     "start_time": "2025-11-05T14:47:12.588567800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# infer start and end events for each object type\n",
    "\n",
    "object_type = \"CI_SC\"\n",
    "print(f\"Inferring start and end events for object type: {object_type}\")\n",
    "\n",
    "q_start_event_str = '''\n",
    ":auto\n",
    "// Infer start event of an object\n",
    "MATCH (ot:ObjectType {objectType: $objectType}) <- [:IS_OF_TYPE] - (n)\n",
    "CALL (n) {\n",
    "    MATCH (n) <- [:CORR] - (e:HighLevelEvent)\n",
    "    RETURN e ORDER BY e.startTime, id(e) LIMIT 1\n",
    "}\n",
    "CALL (n, e) {\n",
    "    MERGE (n)<-[:START_CORR]-(e)\n",
    "} IN TRANSACTIONS\n",
    "RETURN count(n)\n",
    "'''\n",
    "\n",
    "q_start_event = Query(\n",
    "    query_str=q_start_event_str,\n",
    "    parameters={\n",
    "        \"objectType\": object_type,\n",
    "    }\n",
    ")\n",
    "\n",
    "db_connection.exec_query(q_start_event)"
   ],
   "id": "27532820645af71c",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Inferring start and end events for object type: CI_SC\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[{'count(n)': 22259}]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 18
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T14:48:56.203906100Z",
     "start_time": "2025-11-05T14:48:55.947941100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "\n",
    "\n",
    "q_end_event_str = '''\n",
    ":auto\n",
    "// Infer end event of an object\n",
    "MATCH (ot:ObjectType {objectType: $objectType}) <- [:IS_OF_TYPE] - (n)\n",
    "CALL (n) {\n",
    "    MATCH (n) <- [:CORR] - (e:HighLevelEvent)\n",
    "    RETURN e ORDER BY e.endTime DESC, id(e) LIMIT 1\n",
    "}\n",
    "CALL (n, e) {\n",
    "    MERGE (n)<-[:END_CORR]-(e)\n",
    "} IN TRANSACTIONS\n",
    "\n",
    "RETURN count(n)\n",
    "'''\n",
    "\n",
    "q_end_event = Query(\n",
    "    query_str=q_end_event_str,\n",
    "    parameters={\n",
    "        \"objectType\": object_type,\n",
    "    }\n",
    ")\n",
    "\n",
    "db_connection.exec_query(q_end_event)"
   ],
   "id": "24bfe99c7a09c7f2",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(n)': 22259}]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 24
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T14:56:28.976177800Z",
     "start_time": "2025-11-05T14:56:26.523813800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# find overlapping high-level events and create DURING relations\n",
    "qFindContainedHLEvents = '''\n",
    ":auto\n",
    "    MATCH (h1:HighLevelEvent) - [df:DF] -> (h2:HighLevelEvent) - [:DF {id: df.id}] -> (h1)\n",
    "    WHERE h1 <> h2 AND h1.startTime < h2.startTime AND h2.endTime < h1.endTime\n",
    "      CALL (h1, h2) {\n",
    "        MERGE (h2)-[:DURING]->(h1)\n",
    "    } IN TRANSACTIONS\n",
    "    RETURN count(h2) AS total\n",
    "'''\n",
    "db_connection.exec_query(qFindContainedHLEvents)"
   ],
   "id": "7f98a317e18e8405",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'total': 18823}]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 3
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "# find overlapping high-level events and create DURING relations\n",
    "\n",
    "qFindContainedHLEvents = '''\n",
    ":auto\n",
    "    MATCH (h1:HighLevelEvent) - [df:DF] -> (h2:HighLevelEvent) - [df2:DF {id: df.id}] -> (h1)\n",
    "    WHERE h1 <> h2 AND h1.startTime < h2.startTime AND h2.endTime < h1.endTime\n",
    "      CALL (h1, h2) {\n",
    "        MERGE (h2)-[:DURING]->(h1)\n",
    "    } IN TRANSACTIONS\n",
    "    RETURN count(h2) AS total\n",
    "'''\n",
    "db_connection.exec_query(qFindContainedHLEvents)"
   ],
   "id": "db144066b2d4dc2a"
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e1a441da",
   "metadata": {},
   "outputs": [],
   "source": [
    "# lift DF relations from events to high-level events\n",
    "qLiftDfRelations = '''\n",
    "    :auto\n",
    "    MATCH (h1:HighLevelEvent)-[:END]->(e1:Event)-[df:DF]->(e2:Event)<-[:START]-(h2:HighLevelEvent)\n",
    "    CALL (h1, df, h2) {\n",
    "        MERGE (h1)-[df2:DF]->(h2)\n",
    "        ON CREATE SET df2 = properties(df)\n",
    "    }\n",
    "    YIELD total\n",
    "    RETURN total\n",
    "'''\n",
    "result = db_connection.exec_query(qLiftDfRelations)\n",
    "print(result)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3ab433df",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j._sync.work.result.Result object at 0x000002754A4B4DD0>\n"
     ]
    }
   ],
   "source": [
    "# lift DF relations from events to high-level events\n",
    "with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "    qLiftDfRelations = f'''\n",
    "        MATCH (h1:HighLevelEvent)-[:END]->(e1:Event)-[df:DF]->(e2:Event)<-[:START]-(h2:HighLevelEvent)\n",
    "        CALL {{\n",
    "            WITH h1,df,h2\n",
    "            MERGE (h1)-[df2:DF]->(h2) ON CREATE SET df2 = properties(df)\n",
    "        }} IN TRANSACTIONS OF 1000 ROWS\n",
    "        RETURN count(*) AS total\n",
    "    '''\n",
    "    result = session.run(qLiftDfRelations)\n",
    "    result.consume()\n",
    "    print(result.single)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c7283805",
   "metadata": {},
   "outputs": [],
   "source": [
    "# find overlapping high-level events and create DURING relations\n",
    "with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "    qFindContainedHLEvents = f'''\n",
    "        MATCH (h1:HighLevelEvent)-[c1:CORR]->(n:CI_SC)<-[c2:CORR]-(h2:HighLevelEvent) WHERE h1 <> h2\n",
    "        WHERE h1.startTime < h2.startTime AND h2.endTime < h1.endTime\n",
    "        CALL {{\n",
    "            WITH h1,h2\n",
    "            MERGE (h2)-[:DURING]->(h1)\n",
    "        }} IN TRANSACTIONS OF 1000 ROWS\n",
    "        RETURN count(*) AS total\n",
    "    '''\n",
    "    result = session.run(qFindContainedHLEvents)\n",
    "    result.consume()\n",
    "    print(result.single)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
