{
 "cells": [
  {
   "cell_type": "code",
   "id": "537085a2",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T14:58:31.950329100Z",
     "start_time": "2025-11-07T14:58:31.846676800Z"
    }
   },
   "source": [
    "from pathlib import Path\n",
    "\n",
    "import pandas as pd\n",
    "from promg.modules.db_management import DBManagement\n",
    "from promg import Configuration, DatabaseConnection, Performance, SemanticHeader, DatasetDescriptions, OcedPg, Query\n",
    "\n",
    "import yaml\n",
    "\n",
    "import plotly.express as px\n",
    "import plotly.subplots as sp\n",
    "import plotly.graph_objects as go"
   ],
   "outputs": [],
   "execution_count": 23
  },
  {
   "cell_type": "code",
   "id": "60b6e72b",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T14:58:32.791433600Z",
     "start_time": "2025-11-07T14:58:32.663204900Z"
    }
   },
   "source": [
    "case_study = 'bpic14'\n",
    "\n",
    "conf_path = Path(case_study, 'config.yaml')\n",
    "config = yaml.safe_load(open(conf_path))\n",
    "\n",
    "print(f\"These are the credentials that I expect to be set for the database.\")\n",
    "print(f\"db_name: {config['db_name']}\")\n",
    "print(f\"uri: {config['uri']}\")\n",
    "print(f\"password: {config['password']}\")\n",
    "print(\"----------------------\")\n",
    "print(f\"If you have other credentials, please change them at: {conf_path}\")\n",
    "\n",
    "config = Configuration.init_conf_with_config_file(conf_path)\n",
    "db_connection = DatabaseConnection.set_up_connection(config=config)"
   ],
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "These are the credentials that I expect to be set for the database.\n",
      "db_name: neo4j\n",
      "uri: bolt://localhost:7687\n",
      "password: bpic2014\n",
      "----------------------\n",
      "If you have other credentials, please change them at: bpic14\\config.yaml\n"
     ]
    }
   ],
   "execution_count": 24
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T14:58:35.856236Z",
     "start_time": "2025-11-07T14:58:33.691780200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# clear previously created nodes and relations\n",
    "# start/end relations\n",
    "q_clear_start = '''\n",
    ":auto\n",
    "MATCH (n)<-[r:START]-(e:Event)\n",
    "CALL (r) {\n",
    "    DELETE r\n",
    "} IN TRANSACTIONS\n",
    " RETURN count(r) '''\n",
    "db_connection.exec_query(q_clear_start)"
   ],
   "id": "19bc39b6d7cb8fd4",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(r)': 0}]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 25
  },
  {
   "cell_type": "code",
   "id": "ca768b4f",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T14:58:36.421358600Z",
     "start_time": "2025-11-07T14:58:36.382261800Z"
    }
   },
   "source": [
    "q_clear_end = '''\n",
    ":auto\n",
    "MATCH (n)<-[r:END]-(e:Event)\n",
    " CALL (r) {\n",
    "    DELETE r\n",
    " } IN TRANSACTIONS\n",
    "\n",
    " RETURN count(r)\n",
    "'''\n",
    "db_connection.exec_query(q_clear_end)\n"
   ],
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(r)': 0}]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 26
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T14:58:36.900633Z",
     "start_time": "2025-11-07T14:58:36.863582600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# high-level events\n",
    "qClearStartHLE = '''\n",
    ":auto\n",
    "MATCH (n)<-[r:START]-(e:HighLevelEvent)\n",
    "CALL (r) {\n",
    "    DELETE r\n",
    "} IN TRANSACTIONS\n",
    "\n",
    " RETURN count(r)\n",
    " '''\n",
    "db_connection.exec_query(qClearStartHLE)\n"
   ],
   "id": "31547c20b5c437ec",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(r)': 0}]"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 27
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T14:58:37.521701900Z",
     "start_time": "2025-11-07T14:58:37.485626600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "qClearEndHLE = '''\n",
    ":auto\n",
    "MATCH (n)<-[r:END]-(e:HighLevelEvent)\n",
    "CALL (r) {\n",
    "    DELETE r\n",
    "} IN TRANSACTIONS\n",
    "\n",
    " RETURN count(r)\n",
    "'''\n",
    "db_connection.exec_query(qClearEndHLE)\n"
   ],
   "id": "b0f250041e080a96",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(r)': 0}]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 28
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T14:58:38.073980800Z",
     "start_time": "2025-11-07T14:58:38.034869600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "q_clear_df_hle = '''\n",
    ":auto\n",
    "MATCH (e2:HighLevelEvent)<-[r:DF]-(e:HighLevelEvent)\n",
    "CALL (r) {\n",
    "    DELETE r\n",
    "} IN TRANSACTIONS\n",
    "\n",
    " RETURN count(r)\n",
    "'''\n",
    "db_connection.exec_query(q_clear_df_hle)\n"
   ],
   "id": "b6d87b73b1f8c026",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(r)': 0}]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 29
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T14:58:38.625270800Z",
     "start_time": "2025-11-07T14:58:38.588916300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "qClearHighLevelEvent = '''\n",
    ":auto\n",
    "MATCH (h:HighLevelEvent)\n",
    "CALL (h) {\n",
    "    DETACH DELETE h\n",
    "} IN TRANSACTIONS\n",
    " RETURN count(h)\n",
    "'''\n",
    "db_connection.exec_query(qClearHighLevelEvent)\n"
   ],
   "id": "287ab300c3c68fe4",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(h)': 0}]"
      ]
     },
     "execution_count": 30,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 30
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T14:58:39.121201Z",
     "start_time": "2025-11-07T14:58:39.069225500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "q_clear_start = '''\n",
    ":auto\n",
    "MATCH (n)<-[r:START_CORR]-(e:HighLevelEvent)\n",
    "CALL (r) {\n",
    "    DELETE r\n",
    "} IN TRANSACTIONS\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(q_clear_start)\n",
    "q_clear_end = '''\n",
    ":auto\n",
    "MATCH (n)<-[r:END_CORR]-(e:HighLevelEvent)\n",
    "CALL (r) {\n",
    "    DELETE r\n",
    "} IN TRANSACTIONS\n",
    "'''\n",
    "db_connection.exec_query(q_clear_end)"
   ],
   "id": "f8c8dd93901e6ec0",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 31
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T14:58:39.594534500Z",
     "start_time": "2025-11-07T14:58:39.556139500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "qClearDuring = '''\n",
    ":auto\n",
    "MATCH (:HighLevelEvent)<-[r:DURING]-(:HighLevelEvent)\n",
    "CALL (r) {\n",
    "    DELETE r\n",
    "} IN TRANSACTIONS\n",
    "'''\n",
    "db_connection.exec_query(qClearDuring)"
   ],
   "id": "c13d7edd6d9f4a80",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 32
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T14:58:40.310549Z",
     "start_time": "2025-11-07T14:58:40.297332700Z"
    }
   },
   "cell_type": "code",
   "source": "object_types = [\"Change\", \"Incident\", \"Interaction\"]",
   "id": "7113d1308e78b1a4",
   "outputs": [],
   "execution_count": 33
  },
  {
   "cell_type": "code",
   "id": "3ab1924a",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T14:59:01.363356100Z",
     "start_time": "2025-11-07T14:58:41.657312900Z"
    }
   },
   "source": [
    "# infer start and end events for each object type\n",
    "q_start_event = '''\n",
    "    // Infer start event of an object\n",
    "    MATCH (n) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "    MATCH (n)<-[c:CORR]-(e:Event) WHERE NOT ()-[:DF {id:n.sysId}]->(e)\n",
    "    MERGE (n)<-[:START]-(e)\n",
    "    RETURN count(n)\n",
    "'''\n",
    "\n",
    "q_end_event = '''\n",
    "    // Infer start event of an object\n",
    "\n",
    "    MATCH (n) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "    MATCH (n)<-[c:CORR]-(e:Event) WHERE NOT (e)-[:DF {id:n.sysId}]->()\n",
    "    MERGE (n)<-[:END]-(e)\n",
    "\n",
    "    RETURN count(n)\n",
    "    '''\n",
    "\n",
    "for object_type in object_types:\n",
    "    print(f\"Inferring start and end events for object type: {object_type}\")\n",
    "    q_start_event_result = Query(\n",
    "        query_str=q_start_event,\n",
    "        parameters={\"objectType\": object_type}\n",
    "    )\n",
    "\n",
    "    print(db_connection.exec_query(q_start_event_result))\n",
    "\n",
    "    q_end_event_result = Query(\n",
    "        query_str=q_end_event,\n",
    "        parameters={\"objectType\": object_type}\n",
    "    )\n",
    "    print(db_connection.exec_query(q_end_event_result))"
   ],
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Inferring start and end events for object type: Change\n",
      "[{'count(n)': 16611}]\n",
      "[{'count(n)': 16611}]\n",
      "Inferring start and end events for object type: Incident\n",
      "[{'count(n)': 46368}]\n",
      "[{'count(n)': 46368}]\n",
      "Inferring start and end events for object type: Interaction\n",
      "[{'count(n)': 146553}]\n",
      "[{'count(n)': 146553}]\n"
     ]
    }
   ],
   "execution_count": 34
  },
  {
   "cell_type": "code",
   "id": "57982ba2",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T14:59:27.626331500Z",
     "start_time": "2025-11-07T14:59:03.857365800Z"
    }
   },
   "source": [
    "# materialize time between events as duration on DF edge\n",
    "q_materialize_duration_on_df = '''\n",
    "    :auto\n",
    "    MATCH (e1:Event)-[df:DF]->(e2:Event) WHERE df.duration IS NULL\n",
    "    CALL (e1, df, e2) {\n",
    "        SET df.duration = duration.inSeconds(e1.timestamp, e2.timestamp).seconds\n",
    "    } IN TRANSACTIONS\n",
    "    RETURN count(*) AS total\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(q_materialize_duration_on_df)"
   ],
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'total': 2100886}]"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 35
  },
  {
   "cell_type": "code",
   "id": "98e4243c",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T14:59:29.800701200Z",
     "start_time": "2025-11-07T14:59:29.551906100Z"
    }
   },
   "source": [
    "# build index for high-level events\n",
    "qCreateIndexHLE_sys = f'''\n",
    "    CREATE INDEX highLevelEventSysIdIndex IF NOT EXISTS FOR (h:HighLevelEvent) ON (h.sysId);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_sys)\n",
    "\n",
    "qCreateIndexHLE_timestamp = f'''\n",
    "        CREATE INDEX highLevelEventEndTimeIndex IF NOT EXISTS FOR (h:HighLevelEvent) ON (h.timestamp);\n",
    "    '''\n",
    "db_connection.exec_query(qCreateIndexHLE_timestamp)"
   ],
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 36
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T14:59:46.456829800Z",
     "start_time": "2025-11-07T14:59:30.498351800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "\n",
    "# build high-level events\n",
    "qBuildHighLevelEvent = '''\n",
    "    :auto\n",
    "    MATCH (n) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "    MATCH (eStart:Event)-[st:START]->(n)<-[en:END]-(eEnd:Event)\n",
    "    WITH DISTINCT eStart, eEnd\n",
    "    CALL (eStart, eEnd) {\n",
    "        MERGE (h:HighLevelEvent {sysId: \"HLE_\" + eStart.sysId})\n",
    "        ON CREATE SET h.timestamp=eStart.timestamp, h.activity=$objectType, h.subActivity = eStart.activity\n",
    "        MERGE (h)-[:START]->(eStart)\n",
    "        RETURN h\n",
    "        UNION\n",
    "        MERGE (h:HighLevelEvent {sysId: \"HLE_\" + eEnd.sysId})\n",
    "        ON CREATE SET h.timestamp=eEnd.timestamp, h.activity=$objectType, h.subActivity = eEnd.activity\n",
    "        MERGE (h)-[:END]->(eEnd)\n",
    "        RETURN h\n",
    "    } IN TRANSACTIONS\n",
    "    RETURN count(h)\n",
    "'''\n",
    "\n",
    "for object_type in object_types:\n",
    "    query = Query(\n",
    "        query_str=qBuildHighLevelEvent,\n",
    "        parameters={\n",
    "            \"objectType\": object_type,\n",
    "        }\n",
    "    )\n",
    "\n",
    "    result = db_connection.exec_query(query)\n",
    "    print(f\"{result[0]['count(h)']} high level events for {object_type}\")"
   ],
   "id": "6986d35a4303d9d7",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "33217 high level events for Change\n",
      "92736 high level events for Incident\n",
      "293106 high level events for Interaction\n"
     ]
    }
   ],
   "execution_count": 37
  },
  {
   "cell_type": "code",
   "id": "fd4364e7",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T14:59:59.575851Z",
     "start_time": "2025-11-07T14:59:50.013103600Z"
    }
   },
   "source": [
    "# lift CORR to high-level events\n",
    "qLiftCorrToHL = '''\n",
    "    :auto\n",
    "    MATCH (h:HighLevelEvent)-[:START|END]->(:Event)-[:CORR]->(n)\n",
    "    WITH distinct h, n\n",
    "    CALL (h, n) {\n",
    "        MERGE(h) - [:CORR]->(n)\n",
    "    } IN TRANSACTIONS\n",
    "'''\n",
    "db_connection.exec_query(qLiftCorrToHL)"
   ],
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 38
  },
  {
   "cell_type": "code",
   "id": "d9d5e7e1",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T15:00:01.742356200Z",
     "start_time": "2025-11-07T15:00:01.735498700Z"
    }
   },
   "source": [
    "# build DF relations between high-level events\n",
    "# step 1: build HL-DF relations between events\n",
    "\n",
    "qBuildDfRelationsHLE = '''\n",
    "    :auto\n",
    "    // get only START/END events of each HL event correlated to CI_SC\n",
    "    MATCH (ot:ObjectType {objectType: $objectType}) <- [:IS_OF_TYPE] - (o) <-[:CORR]-(h:HighLevelEvent)\n",
    "    // order by time\n",
    "    WHERE h.timestamp IS NOT NULL\n",
    "    WITH o, h ORDER BY h.timestamp, ID(h)\n",
    "    // We want to prioritize those events that have already a DF, but False becomes before true, so negate\n",
    "    WITH o, collect(h) AS events\n",
    "    UNWIND range(0, size(events)-2) AS idx\n",
    "    WITH events[idx] AS fromEv, events[idx+1] AS toEv, o\n",
    "    CALL (fromEv,toEv,o) {\n",
    "        MERGE (fromEv)-[rel:DF {objectType:$objectType, id:o.sysId}]->(toEv)\n",
    "        RETURN rel\n",
    "    } IN TRANSACTIONS\n",
    "    RETURN count(rel) AS total\n",
    "'''"
   ],
   "outputs": [],
   "execution_count": 39
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T15:00:18.016233200Z",
     "start_time": "2025-11-07T15:00:04.830388500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "for object_type in object_types + [\"CI_SC\"]:\n",
    "    query = Query(\n",
    "        query_str=qBuildDfRelationsHLE,\n",
    "        parameters={\n",
    "            \"objectType\": object_type,\n",
    "        }\n",
    "    )\n",
    "\n",
    "    print(f\"DF for {object_type}: {db_connection.exec_query(query)}\")"
   ],
   "id": "1b20613c5218d711",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "DF for Change: [{'total': 16606}]\n",
      "DF for Incident: [{'total': 46368}]\n",
      "DF for Interaction: [{'total': 146553}]\n",
      "DF for CI_SC: [{'total': 426299}]\n"
     ]
    }
   ],
   "execution_count": 40
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "Fix DF for those with 0 minutes and are overlapping",
   "id": "53f8dc8ca1af2b61"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T15:00:35.135913900Z",
     "start_time": "2025-11-07T15:00:33.863421700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "    MATCH (hle) - [:DF {objectType: hle.activity}] -> (hle3)\n",
    "    MATCH (hle2) - [:DF {objectType: hle2.activity}] -> (hle4)\n",
    "    MATCH (hle:HighLevelEvent) - [df12:DF  {objectType: 'CI_SC'}] -> (hle2:HighLevelEvent)\n",
    "        - [df23:DF  {objectType: 'CI_SC', id:df12.id}] -> (hle3:HighLevelEvent)\n",
    "        - [df34:DF  {objectType: 'CI_SC', id:df12.id}] -> (hle4:HighLevelEvent)\n",
    "    WITH hle, hle2, hle3, hle4, df12, df23, df34, duration.inSeconds(hle3.timestamp, hle4.timestamp).seconds as seconds\n",
    "    WHERE seconds = 0\n",
    "    DELETE df23\n",
    "    DELETE df34\n",
    "    MERGE (hle2)-[:DF {objectType: 'CI_SC', id:df12.id}] -> (hle4)\n",
    "    MERGE (hle4)-[:DF {objectType: 'CI_SC', id:df12.id}] -> (hle3)\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(query)"
   ],
   "id": "cceff35a59d58d3e",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 41
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T15:00:38.012070400Z",
     "start_time": "2025-11-07T15:00:36.888316100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "    MATCH (hle) - [:DF {objectType: hle.activity}] -> (hle3)\n",
    "    MATCH (hle2) - [:DF {objectType: hle2.activity}] -> (hle4)\n",
    "    MATCH (hle:HighLevelEvent) - [df12:DF  {objectType: 'CI_SC'}] -> (hle2:HighLevelEvent)\n",
    "        - [df23:DF  {objectType: 'CI_SC', id:df12.id}] -> (hle3:HighLevelEvent)\n",
    "        - [df34:DF  {objectType: 'CI_SC', id:df12.id}] -> (hle4:HighLevelEvent)\n",
    "    WITH hle, hle2, hle3, hle4, df12, df23, df34, duration.inSeconds(hle.timestamp, hle2.timestamp).seconds as seconds\n",
    "    WHERE seconds = 0\n",
    "    DELETE df12\n",
    "    DELETE df23\n",
    "    MERGE (hle)-[:DF {objectType: 'CI_SC', id:df34.id}] -> (hle3)\n",
    "    MERGE (hle3)-[:DF {objectType: 'CI_SC', id:df34.id}] -> (hle2)\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(query)"
   ],
   "id": "939198eaf439aab7",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 42
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T15:00:39.840341700Z",
     "start_time": "2025-11-07T15:00:38.957803900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# infer start and end events for each object type\n",
    "\n",
    "object_type = \"CI_SC\"\n",
    "print(f\"Inferring start and end events for object type: {object_type}\")\n",
    "\n",
    "q_start_high_level_event_str = '''\n",
    ":auto\n",
    "// Infer start event of an object\n",
    "MATCH (ot:ObjectType {objectType: $objectType}) <- [:IS_OF_TYPE] - (n)\n",
    "CALL (n) {\n",
    "    MATCH (n) <- [:CORR] - (e:HighLevelEvent)\n",
    "    RETURN e ORDER BY e.startTime, id(e) LIMIT 1\n",
    "}\n",
    "CALL (n, e) {\n",
    "    MERGE (n)<-[:START_CORR]-(e)\n",
    "} IN TRANSACTIONS\n",
    "RETURN count(n)\n",
    "'''\n",
    "\n",
    "q_start_hl_event = Query(\n",
    "    query_str=q_start_high_level_event_str,\n",
    "    parameters={\n",
    "        \"objectType\": object_type,\n",
    "    }\n",
    ")\n",
    "\n",
    "db_connection.exec_query(q_start_hl_event)"
   ],
   "id": "27532820645af71c",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Inferring start and end events for object type: CI_SC\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[{'count(n)': 22301}]"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 43
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "2f53f171d246f1d7"
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
