{
 "cells": [
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:17:18.257320700Z",
     "start_time": "2025-11-06T11:17:18.230966200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "%matplotlib inline\n",
    "import matplotlib.pyplot as plt\n",
    "\n",
    "from pathlib import Path\n",
    "\n",
    "from promg.modules.db_management import DBManagement\n",
    "from tabulate import tabulate\n",
    "import yaml\n",
    "\n",
    "from promg import Configuration, DatabaseConnection, Performance, SemanticHeader, DatasetDescriptions, OcedPg, Query\n",
    "\n",
    "from IPython.core.interactiveshell import InteractiveShell\n",
    "\n",
    "InteractiveShell.ast_node_interactivity = \"all\"\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "pd.set_option('display.width', 2000)"
   ],
   "id": "a83786237630755f",
   "outputs": [],
   "execution_count": 4
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### Define the project that you want to do analysis on",
   "id": "7621249a902ed231"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:17:19.077024200Z",
     "start_time": "2025-11-06T11:17:19.060523600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "case_study = 'bpic14'\n",
    "use_sample = False"
   ],
   "id": "9ff2c60b73bb0b11",
   "outputs": [],
   "execution_count": 5
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:17:19.599745Z",
     "start_time": "2025-11-06T11:17:19.571304400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# retrieve configuration for case_study\n",
    "conf_path = Path(case_study, 'config.yaml')\n",
    "config = yaml.safe_load(open(conf_path))\n",
    "\n",
    "print(f\"These are the credentials that I expect to be set for the database.\")\n",
    "print(f\"db_name: {config['db_name']}\")\n",
    "print(f\"uri: {config['uri']}\")\n",
    "print(f\"password: {config['password']}\")\n",
    "print(\"----------------------\")\n",
    "print(f\"If you have other credentials, please change them at: {conf_path}\")"
   ],
   "id": "aa3387e167d67135",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "These are the credentials that I expect to be set for the database.\n",
      "db_name: neo4j\n",
      "uri: bolt://localhost:7687\n",
      "password: bpic2014\n",
      "----------------------\n",
      "If you have other credentials, please change them at: bpic14\\config.yaml\n"
     ]
    }
   ],
   "execution_count": 6
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "### Prepare so we can use PromG to load the data and execute queries"
   ],
   "id": "e8120ab6c716ab32"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:17:20.716464600Z",
     "start_time": "2025-11-06T11:17:20.643759200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "config = Configuration.init_conf_with_config_file(conf_path)\n",
    "db_connection = DatabaseConnection.set_up_connection(config=config)\n",
    "perf = Performance.set_up_performance(config=config)\n",
    "dataset_descriptions = DatasetDescriptions(config=config)"
   ],
   "id": "6a43b12f667191c7",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0it [00:00, ?it/s]"
     ]
    }
   ],
   "execution_count": 7
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:17:21.196797400Z",
     "start_time": "2025-11-06T11:17:21.176846Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def reset_pbar(pbar=perf.pbar, total=None):\n",
    "    # clear db\n",
    "    pbar.reset()\n",
    "    # TODO update dragons in PromG, #update method to set total for pbar\n",
    "    pbar.total = total\n",
    "    pbar.set_postfix_str()"
   ],
   "id": "401c224950fa68e",
   "outputs": [],
   "execution_count": 8
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "#### Prepare the DB"
   ],
   "id": "6bb7df7ad87d2580"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:17:22.513689Z",
     "start_time": "2025-11-06T11:17:22.500635800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# read the semantic header --> this details how the data should be structured\n",
    "semantic_header = SemanticHeader.create_semantic_header(config=config)"
   ],
   "id": "62c8f00ce4cfd71a",
   "outputs": [],
   "execution_count": 9
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:17:26.012900900Z",
     "start_time": "2025-11-06T11:17:23.100420600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Clear the DB (if use_sample = False, this should not take long on a loaded database)\n",
    "db_manager = DBManagement(db_connection=db_connection, semantic_header=None)\n",
    "db_manager.clear_db(replace=True);  # in the community version of neo4j, replace is not allowed. In that case, set replace=False"
   ],
   "id": "60b3495572a9748b",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1it [00:05,  5.29s/it, clear_db: took 5.28 seconds]"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\s156229\\PycharmProjects\\EKG_BPIC2014_Notebook\\.venv\\Lib\\site-packages\\promg\\utilities\\performance_handling.py:64: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.\n",
      "  perf.perf = pd.concat([perf.perf, pd.DataFrame.from_records([\n"
     ]
    }
   ],
   "execution_count": 10
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:17:28.264076800Z",
     "start_time": "2025-11-06T11:17:27.930893600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Set constraints in DB\n",
    "db_manager.set_constraints();"
   ],
   "id": "ba4c8c205f2085dd",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2it [00:07,  3.52s/it, set_constraints: took 2.29 seconds]"
     ]
    }
   ],
   "execution_count": 11
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:17:29.092758600Z",
     "start_time": "2025-11-06T11:17:28.960410700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "db_manager.get_constraints(ignore_defaults=True)"
   ],
   "id": "ad8f6f7f8636ca0",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['activity_index',\n",
       " 'entity_sys_id_index',\n",
       " 'record_id_range',\n",
       " 'record_type_range',\n",
       " 'unique_entity_ids']"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 12
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "### Load the data"
   ],
   "id": "fc848247a6c26bb8"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:17:30.161224200Z",
     "start_time": "2025-11-06T11:17:30.143506700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "use_sample = False\n",
    "oced_pg = OcedPg(database_connection=db_connection,\n",
    "                 dataset_descriptions=dataset_descriptions,\n",
    "                 semantic_header=semantic_header,\n",
    "                 use_sample=use_sample)\n"
   ],
   "id": "a1acd711cd96c81e",
   "outputs": [],
   "execution_count": 13
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:18:11.459245700Z",
     "start_time": "2025-11-06T11:17:30.843645600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# first, we load all records\n",
    "# (if use_sample = False, this should take less than 2 minutes)\n",
    "reset_pbar(total=11)\n",
    "oced_pg.load();"
   ],
   "id": "53df1bcd67b8742a",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "100%|██████████| 11/11 [00:40<00:00,  3.50s/it, _filter_nodes for BPIC14Interaction: took 0.0 seconds]                      "
     ]
    }
   ],
   "execution_count": 14
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:18:11.477677900Z",
     "start_time": "2025-11-06T11:18:11.460249500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Check whether import and transformation was successful by checking whether all nodes were imported\n",
    "check_nodes = '''\n",
    "    MATCH (n)\n",
    "    RETURN labels(n) as label, count(n) as count'''\n",
    "\n",
    "check_relations = '''\n",
    "    MATCH () - [r] -> ()\n",
    "    RETURN type(r) as label, count(r) as count'''"
   ],
   "id": "891dbcee1fe7c024",
   "outputs": [],
   "execution_count": 15
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:18:12.279220700Z",
     "start_time": "2025-11-06T11:18:11.481202Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Check whether import and transformation was successful by checking whether all nodes were imported\n",
    "node_count = db_connection.exec_query(check_nodes)\n",
    "rel_count = db_connection.exec_query(check_relations)\n",
    "print(\n",
    "    f\"In total, there are {sum([node['count'] for node in node_count])} nodes and {sum([rel['count'] for rel in rel_count])} relations.\")\n",
    "\n",
    "# we report on nodes and Relations excluding the record layer as these are not part of our schema\n",
    "print(\n",
    "    f\"In total (excluding record layer), there are {sum([node['count'] for node in node_count if not node['label'] in [['Record'], ['RecordType'], ['Log']]])} nodes \"\n",
    "    f\"and {sum([rel['count'] for rel in rel_count if not rel['label'] in ['IS_OF_TYPE', 'CONTAINS', 'EXTRACTED_FROM']])} relations.\")\n"
   ],
   "id": "eeca2087a4f79cd5",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "In total, there are 690626 nodes and 690622 relations.\n",
      "In total (excluding record layer), there are 0 nodes and 0 relations.\n"
     ]
    }
   ],
   "execution_count": 16
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:18:12.293726400Z",
     "start_time": "2025-11-06T11:18:12.286687600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Print node statistics\n",
    "print(\"Nodes\")\n",
    "print(tabulate(node_count))"
   ],
   "id": "cec797532cd4f49a",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Nodes\n",
      "----------  ------\n",
      "['Log']          4\n",
      "['Record']  690622\n",
      "----------  ------\n"
     ]
    }
   ],
   "execution_count": 17
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:18:12.300504200Z",
     "start_time": "2025-11-06T11:18:12.293726400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Print relationship statistics\n",
    "print(\"Relations\")\n",
    "print(tabulate(rel_count))"
   ],
   "id": "9aa3aee88f2e20de",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Relations\n",
      "--------  ------\n",
      "CONTAINS  690622\n",
      "--------  ------\n"
     ]
    }
   ],
   "execution_count": 18
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# EKG creation",
   "id": "4ce7140e95b71b1e"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "Pipeline: Objects (simple & complex objects) + Resources Nodes-> Relations between objects and Resources -> Events nodes -> Relations between events and events & objects",
   "id": "42484a660610b990"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### Objects and Resources Nodes",
   "id": "a8cbbfafb58e0d72"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "\"Simple objects\" are object nodes that could be extracted directly from Record nodes as is. Those are Incidents, Interactions, Change, Knowledge Document. Resources nodes created in the same way as simple objects.\n",
    "\n",
    "The name \"Simple\" is used as a placeholder."
   ],
   "id": "6c93482e299a4cf"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:18:12.309492800Z",
     "start_time": "2025-11-06T11:18:12.300504200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "SIMPLE_OBJECTS = {\n",
    "    \"Incident\": {\n",
    "        \"log\": \"BPIC14Incident.csv\",\n",
    "        \"sysId\": \"incidentId\",\n",
    "        \"attributes\": [\"incidentId\",\"status\", \"impact\", \"priority\", \"category\", \"handleTimeHours\", \"closureCode\", \"alertStatus\", \"numReassignments\", \"numRelatedInteractions\", \"numRelatedIncidents\", \"numRelatedChanges\"\n",
    "        ],\n",
    "    },\n",
    "    \"Interaction\": {\n",
    "        \"log\": \"BPIC14Interaction.csv\",\n",
    "        \"sysId\": \"interactionId\",\n",
    "        \"attributes\": [\"interactionId\",\"status\", \"impact\", \"priority\", \"category\", \"handleTimeSecs\", \"closureCode\", \"firstCallResolution\"       ],\n",
    "    },\n",
    "    \"Change\":{\n",
    "        \"log\": \"Detail_Change.csv\",\n",
    "        \"sysId\": \"changeId\",\n",
    "        \"attributes\": [\"changeId\", \"changeType\", \"riskAssessment\", \"cabApprovalNeeded\", \"plannedStart\", \"plannedEnd\", \"scheduledDowntimeStart\", \"scheduledDowntimeEnd\", \"requestedEndDate\", \"originatedFrom\", \"numRelatedInteractions\", \"numRelatedIncidents\"\n",
    "        ],\n",
    "    },\n",
    "    \"KnowledgeDocument\": {\n",
    "        \"log\": None,\n",
    "        \"sysId\": \"kmNumber\",\n",
    "        \"attributes\": [\"kmNumber\"]\n",
    "}}\n",
    "\n",
    "RESOURCES = {\n",
    "    \"Resource\":{\n",
    "    \"log\": \"Detail_Incident_Activity.csv\",\n",
    "    \"sysId\": \"assignmentGroup\",\n",
    "    \"attributes\": [\"assignmentGroup\"],\n",
    "    }\n",
    "}"
   ],
   "id": "c064003270b67a32",
   "outputs": [],
   "execution_count": 19
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:18:12.317929600Z",
     "start_time": "2025-11-06T11:18:12.310497600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def build_simple_objects_and_resources(db_connection):\n",
    "    \"\"\"\n",
    "    Create simple Object and Resource nodes. Includes indexing.\n",
    "    \"\"\"\n",
    "\n",
    "    def create_index(session, label):\n",
    "        index_query = f\"\"\"\n",
    "        CREATE INDEX {label.lower()}_sysId_index IF NOT EXISTS\n",
    "        FOR (n:{label})\n",
    "        ON (n.sysId)\n",
    "        \"\"\"\n",
    "        session.run(index_query)\n",
    "        print(f\"Index for :{label}(sysId)\")\n",
    "\n",
    "    def build_entity(tx, label, config):\n",
    "        log_name = config[\"log\"]\n",
    "        sysId_field = config[\"sysId\"]\n",
    "        attributes = config[\"attributes\"]\n",
    "\n",
    "        attr_updates = \", \".join([f\"n.{attr} = r.{attr}\" for attr in attributes])\n",
    "\n",
    "        if log_name:\n",
    "            source_query = f\"\"\"\n",
    "            MATCH (l:Log {{name: '{log_name}'}})-[:CONTAINS]->(r:Record)\n",
    "            WHERE r.{sysId_field} IS NOT NULL\n",
    "            RETURN r.{sysId_field} AS sysId, r\n",
    "            \"\"\"\n",
    "        else:\n",
    "            source_query = f\"\"\"\n",
    "            MATCH (r:Record)\n",
    "            WHERE r.{sysId_field} IS NOT NULL\n",
    "            RETURN r.{sysId_field} AS sysId, r\n",
    "            \"\"\"\n",
    "\n",
    "        iterate_query = f\"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "            \"{source_query}\",\n",
    "            \"MERGE (n:{label} {{sysId: sysId}})\n",
    "             SET {attr_updates}\n",
    "             MERGE (n)-[:EXTRACTED_FROM]->(r)\",\n",
    "            {{batchSize: 1000, parallel: false}}\n",
    "        )\n",
    "        YIELD total, batches, failedBatches\n",
    "        RETURN total\n",
    "        \"\"\"\n",
    "\n",
    "        res = tx.run(iterate_query)\n",
    "        print(f\"→ {label} nodes created.\")\n",
    "        return\n",
    "\n",
    "\n",
    "    with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "        print(\"\\n=== INDEXES ===\")\n",
    "        for _, dictionary in [(\"Object\", SIMPLE_OBJECTS), (\"Resource\", RESOURCES)]:\n",
    "            for label in dictionary.keys():\n",
    "                try:\n",
    "                    create_index(session, label)\n",
    "                except Exception as e:\n",
    "                    print(f\"Failed to create index for {label}: {e}\")\n",
    "\n",
    "\n",
    "        for collection, dictionary in [(\"Object\", SIMPLE_OBJECTS), (\"Resource\", RESOURCES)]:\n",
    "            print(f\"\\n=== Building {collection.upper()} NODES ===\")\n",
    "            for label, config in dictionary.items():\n",
    "                try:\n",
    "                    session.execute_write(lambda tx, l=label, c=config: build_entity(tx, l, c))\n",
    "                except Exception as e:\n",
    "                    print(f\"Failed for {label}: {e}\")\n"
   ],
   "id": "fe48b6a214dfb0ba",
   "outputs": [],
   "execution_count": 20
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:18:12.323497600Z",
     "start_time": "2025-11-06T11:18:12.319939300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def add_object_type_node(object_type):\n",
    "    query_str = '''\n",
    "        MERGE (ot:ObjectType {objectType: '$label' })\n",
    "        WITH ot\n",
    "        MATCH (o:$label)\n",
    "        WITH o, ot\n",
    "        MERGE (o) - [:IS_OF_TYPE] -> (ot)\n",
    "    '''\n",
    "\n",
    "    query = Query(\n",
    "        query_str=query_str,\n",
    "        template_string_parameters={\"label\": object_type}\n",
    "    )\n",
    "\n",
    "    db_connection.exec_query(query)"
   ],
   "id": "6bddabb973723ee1",
   "outputs": [],
   "execution_count": 21
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:18:34.479054600Z",
     "start_time": "2025-11-06T11:18:12.325257100Z"
    }
   },
   "cell_type": "code",
   "source": "build_simple_objects_and_resources(db_connection)",
   "id": "586ed0a1377317f7",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "=== INDEXES ===\n",
      "Index for :Incident(sysId)\n",
      "Index for :Interaction(sysId)\n",
      "Index for :Change(sysId)\n",
      "Index for :KnowledgeDocument(sysId)\n",
      "Index for :Resource(sysId)\n",
      "\n",
      "=== Building OBJECT NODES ===\n",
      "→ Incident nodes created.\n",
      "→ Interaction nodes created.\n",
      "→ Change nodes created.\n",
      "→ KnowledgeDocument nodes created.\n",
      "\n",
      "=== Building RESOURCE NODES ===\n",
      "→ Resource nodes created.\n"
     ]
    }
   ],
   "execution_count": 22
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:18:36.597612300Z",
     "start_time": "2025-11-06T11:18:34.487419100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "for dictionary in [SIMPLE_OBJECTS, RESOURCES]:\n",
    "    for label in dictionary.keys():\n",
    "        add_object_type_node(object_type=label)\n",
    "        print(f'-> (:ObjectType {{objectType: \"{label}\"}} created.')"
   ],
   "id": "7e42d9ae50a6a22a",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-> (:ObjectType {objectType: \"Incident\"} created.\n",
      "-> (:ObjectType {objectType: \"Interaction\"} created.\n",
      "-> (:ObjectType {objectType: \"Change\"} created.\n",
      "-> (:ObjectType {objectType: \"KnowledgeDocument\"} created.\n",
      "-> (:ObjectType {objectType: \"Resource\"} created.\n"
     ]
    }
   ],
   "execution_count": 23
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "\"Complex objects\" are objects that require transformation during the extraction from Record nodes. Configuration Item (CI), Service Component (SC) and combined object CI_SC are complex objects. CI_SC includes additional attributes affected & caused (boolean values) to identify whether CI_SC node was affected entity or the entity that cause disruption.\n",
    "\n",
    "The name \"Complex is used as a placeholder.\n"
   ],
   "id": "9fc857ce79e1b69c"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:18:36.611473500Z",
     "start_time": "2025-11-06T11:18:36.605545700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "COMPLEX_OBJECTS = {\n",
    "    \"ConfigurationItem\": {\n",
    "        \"log\": None,\n",
    "        \"sysId\": \"ciName\",\n",
    "        \"attributes\": {\n",
    "            \"affected\": {\n",
    "                \"ciName\": \"ciNameAff\",\n",
    "                \"ciType\": \"ciTypeAff\",\n",
    "                \"ciSubtype\": \"ciSubtypeAff\",\n",
    "            },\n",
    "            \"caused\": {\n",
    "                \"ciName\": \"ciNameCby\",\n",
    "                \"ciType\": \"ciTypeCby\",\n",
    "                \"ciSubtype\": \"ciSubtypeCby\",\n",
    "            },\n",
    "        },\n",
    "    },\n",
    "    \"ServiceComponent\": {\n",
    "        \"log\": None,\n",
    "        \"sysId\": \"scName\",\n",
    "        \"attributes\": {\n",
    "            \"affected\": {\"scName\": \"serviceComponentAff\"},\n",
    "            \"caused\": {\"scName\": \"serviceComponentCBy\"},\n",
    "        },\n",
    "    },\n",
    "\n",
    "    \"CI_SC\": {\n",
    "        \"log\": None,\n",
    "        \"sysId\": \"sysId\",  # CI_SC sysId = ciName + '_' + scName\n",
    "        \"attributes\": {\n",
    "            \"affected\": {\"ciName\": \"ciNameAff\", \"scName\": \"serviceComponentAff\"},\n",
    "            \"caused\": {\"ciName\": \"ciNameCby\", \"scName\": \"serviceComponentCBy\"},\n",
    "        },\n",
    "    },\n",
    "}\n"
   ],
   "id": "7e86a939b2b0e36f",
   "outputs": [],
   "execution_count": 24
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:18:36.631839Z",
     "start_time": "2025-11-06T11:18:36.615114100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def build_complex_objects(tx, label):\n",
    "    \"\"\"\n",
    "    Create complex nodes. Includes indexing\n",
    "    \"\"\"\n",
    "    config = COMPLEX_OBJECTS[label]\n",
    "    attributes = config[\"attributes\"]\n",
    "    sysId_field = config[\"sysId\"]\n",
    "\n",
    "    for role, attr in attributes.items():\n",
    "        if label == \"ConfigurationItem\":\n",
    "            name_attr = attr[\"ciName\"]\n",
    "            type_attr = attr[\"ciType\"]\n",
    "            subtype_attr = attr[\"ciSubtype\"]\n",
    "\n",
    "            source_query = f\"\"\"\n",
    "            MATCH (r:Record)\n",
    "            WHERE r.{name_attr} IS NOT NULL\n",
    "            RETURN r.{name_attr} AS sysId,\n",
    "                   r.{type_attr} AS type,\n",
    "                   r.{subtype_attr} AS subtype,\n",
    "                   r\n",
    "            \"\"\"\n",
    "\n",
    "            iterate_query = f\"\"\"\n",
    "            MERGE (ci:{label} {{sysId: sysId}})\n",
    "            SET ci.{sysId_field} = sysId,\n",
    "                ci.ciType = type,\n",
    "                ci.ciSubtype = subtype,\n",
    "                ci.{role} = true\n",
    "            MERGE (ci)-[:EXTRACTED_FROM]->(r)\n",
    "            \"\"\"\n",
    "\n",
    "        elif label == \"ServiceComponent\":\n",
    "            name_attr = attr[\"scName\"]\n",
    "\n",
    "            source_query = f\"\"\"\n",
    "            MATCH (r:Record)\n",
    "            WHERE r.{name_attr} IS NOT NULL\n",
    "            RETURN r.{name_attr} AS sysId, r\n",
    "            \"\"\"\n",
    "\n",
    "            iterate_query = f\"\"\"\n",
    "            MERGE (sc:{label} {{sysId: sysId}})\n",
    "            SET sc.{sysId_field} = sysId,\n",
    "                sc.{role} = true\n",
    "            MERGE (sc)-[:EXTRACTED_FROM]->(r)\n",
    "            \"\"\"\n",
    "\n",
    "        apoc_query = f\"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "            \"{source_query}\",\n",
    "            \"{iterate_query}\",\n",
    "            {{batchSize: 1000, parallel: false}}\n",
    "        )\n",
    "        YIELD total, batches, failedBatches\n",
    "        RETURN total\n",
    "        \"\"\"\n",
    "\n",
    "        tx.run(apoc_query)\n",
    "\n",
    "    print(f\"→ {label} nodes created.\")\n",
    "\n",
    "def build_ci_sc(tx):\n",
    "    \"\"\"\n",
    "    Create combined CI_SC nodes (can be both affected and caused).\n",
    "    Handles nulls with 'ci_null' and 'sc_null'.\n",
    "    \"\"\"\n",
    "\n",
    "    config = COMPLEX_OBJECTS[\"CI_SC\"]\n",
    "    attributes = config[\"attributes\"]\n",
    "\n",
    "    for role, attr in attributes.items():\n",
    "        ci_field = attr[\"ciName\"]\n",
    "        sc_field = attr[\"scName\"]\n",
    "\n",
    "\n",
    "        source_query = f\"\"\"\n",
    "        MATCH (r:Record)\n",
    "        WHERE r.{ci_field} IS NOT NULL OR r.{sc_field} IS NOT NULL\n",
    "        RETURN\n",
    "            coalesce(r.{ci_field}, 'ci_null') AS ciName,\n",
    "            coalesce(r.{sc_field}, 'sc_null') AS scName,\n",
    "            r\n",
    "        \"\"\"\n",
    "\n",
    "        iterate_query = f\"\"\"\n",
    "        MERGE (cs:CI_SC {{sysId: ciName + '_' + scName}})\n",
    "        SET cs.ciName = ciName,\n",
    "            cs.scName = scName,\n",
    "            cs.{role} = true\n",
    "        MERGE (cs)-[:EXTRACTED_FROM]->(r)\n",
    "        \"\"\"\n",
    "\n",
    "        apoc_query = f\"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "            \"{source_query}\",\n",
    "            \"{iterate_query}\",\n",
    "            {{batchSize: 1000, parallel: false}}\n",
    "        )\n",
    "        YIELD total, batches, failedBatches\n",
    "        RETURN total\n",
    "        \"\"\"\n",
    "\n",
    "        res = tx.run(apoc_query)\n",
    "        record = res.single()\n",
    "\n",
    "    print(\"→ CI_SC nodes created.\")\n",
    "\n",
    "def build_all_complex_objects(db_connection):\n",
    "    \"\"\"\n",
    "    Create indexes and build complex objects\n",
    "    \"\"\"\n",
    "    with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "        print(\"\\n=== INDEXES for COMPLEX OBJECTS ===\")\n",
    "        for label in COMPLEX_OBJECTS.keys():\n",
    "            try:\n",
    "                session.run(\n",
    "                    f\"CREATE INDEX {label.lower()}_sysId_index IF NOT EXISTS \"\n",
    "                    f\"FOR (n:{label}) ON (n.sysId)\"\n",
    "                )\n",
    "                print(f\"Index for :{label}(sysId)\")\n",
    "            except Exception as e:\n",
    "                print(f\" Failed to create index for {label}: {e}\")\n",
    "\n",
    "        print(\"\\n=== BUILDING COMPLEX OBJECTS ===\")\n",
    "        for label in COMPLEX_OBJECTS.keys():\n",
    "            try:\n",
    "                if label == \"CI_SC\":\n",
    "                    session.execute_write(build_ci_sc)\n",
    "                else:\n",
    "                    session.execute_write(lambda tx: build_complex_objects(tx, label))\n",
    "            except Exception as e:\n",
    "                print(f\"Failed for {label}: {e}\")\n"
   ],
   "id": "6a609d516f2e73ad",
   "outputs": [],
   "execution_count": 25
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:18:49.915758300Z",
     "start_time": "2025-11-06T11:18:36.631839Z"
    }
   },
   "cell_type": "code",
   "source": "build_all_complex_objects(db_connection)",
   "id": "adab87230fbeedfd",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "=== INDEXES for COMPLEX OBJECTS ===\n",
      "Index for :ConfigurationItem(sysId)\n",
      "Index for :ServiceComponent(sysId)\n",
      "Index for :CI_SC(sysId)\n",
      "\n",
      "=== BUILDING COMPLEX OBJECTS ===\n",
      "→ ConfigurationItem nodes created.\n",
      "→ ServiceComponent nodes created.\n",
      "→ CI_SC nodes created.\n"
     ]
    }
   ],
   "execution_count": 26
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:18:50.269739500Z",
     "start_time": "2025-11-06T11:18:49.933230800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "for dictionary in [COMPLEX_OBJECTS]:\n",
    "    for label in dictionary.keys():\n",
    "        add_object_type_node(object_type=label)\n",
    "        print(f'-> (:ObjectType {{objectType: \"{label}\"}} created.')"
   ],
   "id": "a84e37be78f91d3e",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-> (:ObjectType {objectType: \"ConfigurationItem\"} created.\n",
      "-> (:ObjectType {objectType: \"ServiceComponent\"} created.\n",
      "-> (:ObjectType {objectType: \"CI_SC\"} created.\n"
     ]
    }
   ],
   "execution_count": 27
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### Objects and Resources Relations",
   "id": "aa185bfdc92e05f1"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "- (Incident|Interaction)-[:USED_KM]->(KnowledgeDocument)\n",
    "- (Incident)-[:RELATED_CHANGE]->(Change)\n",
    "- (CI_SC)-[:RELATED_SC]->(ServiceComponent)\n",
    "- (CI_SC)-[:RELATED_CI]->(ConfigurationItem)\n",
    "- (Interaction)-[:RELATED_INCIDENT]->(Incident)\n",
    "- (Incident|Interaction|Change)-[:AFFECTED_CI_SC]->(CI_SC)\n",
    "- (Incident|Interaction|Change)<-[:CAUSED_BY_CI_SC]-(CI_SC)"
   ],
   "id": "e037d57c37224d93"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "\n",
    "There are interactions that have foregn keys to incidents that are missing in out data. For these cases i created new Incident nodes that only have sysId and a new attribute derivedFromInteraction and the nodes do not have relations to Record nodes."
   ],
   "id": "d905f03b4cedde09"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:18:50.285732Z",
     "start_time": "2025-11-06T11:18:50.269739500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def build_object_Relations(db_connection):\n",
    "    \"\"\"\n",
    "    Build Relations between Object nodes based on Record data:\n",
    "\n",
    "    \"\"\"\n",
    "\n",
    "    with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "        print(\"\\n=== INDEXES for RELATIONSHIP BUILDING ===\")\n",
    "\n",
    "        indexes = [\n",
    "            (\"Record\", \"changeId\"),\n",
    "            (\"Record\", \"kmNumber\"),\n",
    "            (\"Record\", \"relatedIncident\"),\n",
    "            (\"Record\", \"relatedInteraction\"),\n",
    "            (\"Record\", \"ciNameAff\"),\n",
    "            (\"Record\", \"serviceComponentAff\"),\n",
    "            (\"Record\", \"ciNameCby\"),\n",
    "            (\"Record\", \"serviceComponentCBy\"),\n",
    "            (\"CI_SC\", \"ciName\"),\n",
    "            (\"CI_SC\", \"scName\"),\n",
    "        ]\n",
    "\n",
    "        for label, prop in indexes:\n",
    "            try:\n",
    "                session.run(\n",
    "                    f\"CREATE INDEX {label.lower()}_{prop}_index IF NOT EXISTS \"\n",
    "                    f\"FOR (n:{label}) ON (n.{prop})\"\n",
    "                )\n",
    "                print(f\"Index ensured for :{label}({prop})\")\n",
    "            except Exception as e:\n",
    "                print(f\"Failed to create index for {label}.{prop}: {e}\")\n",
    "\n",
    "    with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "        print(\"\\n=== BUILDING OBJECT Relations ===\")\n",
    "\n",
    "        # INCIDENT / INTERACTION → KNOWLEDGE DOCUMENT\n",
    "        for src_label in [\"Incident\", \"Interaction\"]:\n",
    "            used_km_query = f\"\"\"\n",
    "            CALL apoc.periodic.iterate(\n",
    "                \"\n",
    "                MATCH (n:{src_label})-[:EXTRACTED_FROM]->(r)\n",
    "                WHERE r.kmNumber IS NOT NULL\n",
    "                RETURN n, r.kmNumber AS km\n",
    "                \",\n",
    "                \"\n",
    "                MATCH (m:KnowledgeDocument {{sysId: km}})\n",
    "                MERGE (n)-[:USED_KM]->(m)\n",
    "                \",\n",
    "                {{batchSize: 2000, parallel: false}}\n",
    "            )\n",
    "            YIELD total\n",
    "            RETURN total\n",
    "            \"\"\"\n",
    "            res = session.run(used_km_query)\n",
    "            record = res.single()\n",
    "            print(f\"Created  USED_KM Relations for {src_label}.\")\n",
    "\n",
    "        # :RELATED_CHANGE Relations (Incident → Change)\n",
    "        related_change_query = \"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "            \"\n",
    "            MATCH (n:Incident)-[:EXTRACTED_FROM]->(r)\n",
    "            WHERE r.relatedChange IS NOT NULL\n",
    "            RETURN n, r.relatedChange AS ch\n",
    "            \",\n",
    "            \"\n",
    "            MATCH (c:Change {sysId: ch})\n",
    "            MERGE (n)-[:RELATED_CHANGE]->(c)\n",
    "            \",\n",
    "            {batchSize: 2000, parallel: false}\n",
    "        )\n",
    "        YIELD total\n",
    "        RETURN total\n",
    "        \"\"\"\n",
    "        res = session.run(related_change_query)\n",
    "        record = res.single()\n",
    "        print(f\"Created RELATED_CHANGE Relations (Incident → Change).\")\n",
    "\n",
    "        # :RELATED_CI Relations (ConfigurationItem ← CI_SC)\n",
    "        related_ci_query = \"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "            \"\n",
    "            MATCH (cs:CI_SC)\n",
    "            WHERE cs.ciName IS NOT NULL AND cs.ciName <> 'ci_null'\n",
    "            WITH cs, cs.ciName AS ci\n",
    "            MATCH (ciNode:ConfigurationItem {sysId: ci})\n",
    "            RETURN cs, ciNode\n",
    "            \",\n",
    "            \"\n",
    "            MERGE (ciNode)<-[:RELATED_CI]-(cs)\n",
    "            \",\n",
    "            {batchSize: 2000, parallel: false}\n",
    "        )\n",
    "        YIELD total\n",
    "        RETURN total\n",
    "        \"\"\"\n",
    "        try:\n",
    "            res = session.run(related_ci_query)\n",
    "            rec = res.single()\n",
    "            print(f\" Created RELATED_CI Relations.\")\n",
    "        except Exception as e:\n",
    "            print(f\"Failed to create RELATED_CI: {e}\")\n",
    "\n",
    "        # :RELATED_SC Relations (ServiceComponent ← CI_SC)\n",
    "        related_sc_query = \"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "            \"\n",
    "            MATCH (cs:CI_SC)\n",
    "            WHERE cs.scName IS NOT NULL AND cs.scName <> 'sc_null'\n",
    "            WITH cs, cs.scName AS sc\n",
    "            MATCH (scNode:ServiceComponent {sysId: sc})\n",
    "            RETURN cs, scNode\n",
    "            \",\n",
    "            \"\n",
    "            MERGE (scNode)<-[:RELATED_SC]-(cs)\n",
    "            \",\n",
    "            {batchSize: 2000, parallel: false}\n",
    "        )\n",
    "        YIELD total\n",
    "        RETURN total\n",
    "        \"\"\"\n",
    "        try:\n",
    "            res = session.run(related_sc_query)\n",
    "            rec = res.single()\n",
    "            print(f\" Created RELATED_SC Relations.\")\n",
    "        except Exception as e:\n",
    "            print(f\" Failed to create RELATED_SC: {e}\")\n",
    "\n",
    "        # :RELATED_INCIDENT Relations (Interaction → Incident). On creation we add attribute \"primary\" to mark a pair\n",
    "        # of Interaction(relatedIncident)->Incident(relatedInteraction) that refer each other using foreign keys (mentioned in ()). In addition, there are interactions\n",
    "        # that refer to incidents that do not exist in the data, those incidents are created only with sysId and derivedFromInteraction = true attributes.\n",
    "        related_incident_query = \"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "            \"\n",
    "            MATCH (inter:Interaction)-[:EXTRACTED_FROM]->(r)\n",
    "            WHERE r.relatedIncident IS NOT NULL\n",
    "            RETURN inter, r.relatedIncident AS incId, r\n",
    "            \",\n",
    "            \"\n",
    "            MERGE (inc:Incident {sysId: incId})\n",
    "                ON CREATE SET inc.derivedFromInteraction = true\n",
    "            WITH inter, inc, r\n",
    "            OPTIONAL MATCH (r2:Record)<-[:EXTRACTED_FROM]-(inc)\n",
    "            MERGE (inter)-[rel:RELATED_INCIDENT]->(inc)\n",
    "            SET rel.primary = CASE WHEN r2 IS NOT NULL AND r2.relatedInteraction = inter.sysId THEN true ELSE false END\n",
    "            \",\n",
    "            {batchSize: 2000, parallel: false}\n",
    "        )\n",
    "        YIELD total\n",
    "        RETURN total\n",
    "        \"\"\"\n",
    "        try:\n",
    "            res = session.run(related_incident_query)\n",
    "            rec = res.single()\n",
    "            print(f\"Created RELATED_INCIDENT Relations and new Incident nodes\")\n",
    "        except Exception as e:\n",
    "            print(f\" Failed to create RELATED_SC: {e}\")\n",
    "\n",
    "        # :AFFECTED_CI_SC Relations\n",
    "        for src_label in [\"Incident\", \"Interaction\", \"Change\"]:\n",
    "            affected_query = f\"\"\"\n",
    "            CALL apoc.periodic.iterate(\n",
    "                \"\n",
    "                MATCH (src:{src_label})-[:EXTRACTED_FROM]->(r)\n",
    "                WHERE r.ciNameAff IS NOT NULL OR r.serviceComponentAff IS NOT NULL\n",
    "                WITH src,\n",
    "                     coalesce(r.ciNameAff, 'ci_null') AS ciName,\n",
    "                     coalesce(r.serviceComponentAff, 'sc_null') AS scName\n",
    "                RETURN src, ciName, scName\n",
    "                \",\n",
    "                \"\n",
    "                MATCH (cs:CI_SC {{ciName: ciName, scName: scName}})\n",
    "                MERGE (src)-[:AFFECTED_CI_SC]->(cs)\n",
    "                \",\n",
    "                {{batchSize: 2000, parallel: false}}\n",
    "            )\n",
    "            YIELD total\n",
    "            RETURN total\n",
    "            \"\"\"\n",
    "            try:\n",
    "                res = session.run(affected_query)\n",
    "                rec = res.single()\n",
    "                print(f\" Created AFFECTED_CI_SC Relations ({src_label} → CI_SC).\")\n",
    "            except Exception as e:\n",
    "                print(f\" Failed to create AFFECTED_CI_SC: {e}\")\n",
    "\n",
    "        # :CAUSED_CI_SC Relations\n",
    "        for src_label in [\"Incident\", \"Interaction\", \"Change\"]:\n",
    "            caused_query = f\"\"\"\n",
    "            CALL apoc.periodic.iterate(\n",
    "                \"\n",
    "                MATCH (src:{src_label})-[:EXTRACTED_FROM]->(r)\n",
    "                WHERE r.ciNameCby IS NOT NULL OR r.serviceComponentCBy IS NOT NULL\n",
    "                WITH src,\n",
    "                     coalesce(r.ciNameCby, 'ci_null') AS ciName,\n",
    "                     coalesce(r.serviceComponentCBy, 'sc_null') AS scName\n",
    "                RETURN src, ciName, scName\n",
    "                \",\n",
    "                \"\n",
    "                MATCH (cs:CI_SC {{ciName: ciName, scName: scName}})\n",
    "                MERGE (src)-[:CAUSED_BY_CI_SC]->(cs)\n",
    "                \",\n",
    "                {{batchSize: 2000, parallel: false}}\n",
    "            )\n",
    "            YIELD total\n",
    "            RETURN total\n",
    "            \"\"\"\n",
    "            try:\n",
    "                res = session.run(caused_query)\n",
    "                rec = res.single()\n",
    "                print(f\" Created CAUSED_BY_CI_SC Relations ({src_label} → CI_SC).\")\n",
    "            except Exception as e:\n",
    "                print(f\" Failed to create CAUSED_BY_CI_SC: {e}\")"
   ],
   "id": "fc313a195419f9f2",
   "outputs": [],
   "execution_count": 28
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:19:01.039093700Z",
     "start_time": "2025-11-06T11:18:50.285732Z"
    }
   },
   "cell_type": "code",
   "source": "build_object_Relations(db_connection)",
   "id": "909a61ac2cbd7d88",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "=== INDEXES for RELATIONSHIP BUILDING ===\n",
      "Index ensured for :Record(changeId)\n",
      "Index ensured for :Record(kmNumber)\n",
      "Index ensured for :Record(relatedIncident)\n",
      "Index ensured for :Record(relatedInteraction)\n",
      "Index ensured for :Record(ciNameAff)\n",
      "Index ensured for :Record(serviceComponentAff)\n",
      "Index ensured for :Record(ciNameCby)\n",
      "Index ensured for :Record(serviceComponentCBy)\n",
      "Index ensured for :CI_SC(ciName)\n",
      "Index ensured for :CI_SC(scName)\n",
      "\n",
      "=== BUILDING OBJECT Relations ===\n",
      "Created  USED_KM Relations for Incident.\n",
      "Created  USED_KM Relations for Interaction.\n",
      "Created RELATED_CHANGE Relations (Incident → Change).\n",
      " Created RELATED_CI Relations.\n",
      " Created RELATED_SC Relations.\n",
      "Created RELATED_INCIDENT Relations and new Incident nodes\n",
      " Created AFFECTED_CI_SC Relations (Incident → CI_SC).\n",
      " Created AFFECTED_CI_SC Relations (Interaction → CI_SC).\n",
      " Created AFFECTED_CI_SC Relations (Change → CI_SC).\n",
      " Created CAUSED_BY_CI_SC Relations (Incident → CI_SC).\n",
      " Created CAUSED_BY_CI_SC Relations (Interaction → CI_SC).\n",
      " Created CAUSED_BY_CI_SC Relations (Change → CI_SC).\n"
     ]
    }
   ],
   "execution_count": 29
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### Events and Relations",
   "id": "23a9f4678f0309c6"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "Add a generic label event",
   "id": "9be2d8a3808d7494"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "There are four types of events Incident Events, Incident Activity Events, Change Events and Interaction Events",
   "id": "f32831ed123b0907"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:19:01.055139400Z",
     "start_time": "2025-11-06T11:19:01.048184100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "EVENTS = {\n",
    "    \"IncidentEvent\": {\n",
    "        \"log\": \"BPIC14Incident.csv\",\n",
    "        \"source_label\": \"Incident\",\n",
    "        \"id_field\": \"incidentId\",\n",
    "        \"mappings\": {\n",
    "            \"Opened\": \"openTime\",\n",
    "            \"Resolved\": \"resolvedTime\",\n",
    "            \"Closed\": \"closeTime\",\n",
    "        },\n",
    "    },\n",
    "    \"ChangeEvent\": {\n",
    "        \"log\": \"Detail_Change.csv\",\n",
    "        \"source_label\": \"Change\",\n",
    "        \"id_field\": \"changeId\",\n",
    "        \"mappings\": {\n",
    "            \"Start\": \"actualStart\",\n",
    "            \"End\": \"actualEnd\"\n",
    "            #\"OpenRecord\": \"changeRecordOpenTime\",       #Added OpenRecord as additional event\n",
    "            #\"ClosedRecord\": \"changeRecordCloseTime\",    #Added CloseRecord as additional event\n",
    "        },\n",
    "    },\n",
    "    \"InteractionEvent\": {\n",
    "        \"log\": \"BPIC14Interaction.csv\",\n",
    "        \"source_label\": \"Interaction\",\n",
    "        \"id_field\": \"interactionId\",\n",
    "        \"mappings\": {\n",
    "            \"Open\": \"openTime\",\n",
    "            \"Close\": \"closeTime\",\n",
    "        },\n",
    "    },\n",
    "    \"IncidentActivityEvent\": {\n",
    "        \"log\": \"Detail_Incident_Activity.csv\",\n",
    "        \"id_field\": \"incidentId\",\n",
    "        \"activityNumber\": \"activityNumber\",\n",
    "        \"attributes\": [\"activity\", \"timestamp\"],\n",
    "    }\n",
    "}"
   ],
   "id": "2cd9efe51b7b5d59",
   "outputs": [],
   "execution_count": 30
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:19:01.064107300Z",
     "start_time": "2025-11-06T11:19:01.055139400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def build_events_for_objects(db_connection):\n",
    "    \"\"\"\n",
    "    Event nodes for Interaction, Change, Incident, IncidentActivity handled separately\n",
    "    \"\"\"\n",
    "\n",
    "    with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "        print(\"\\n=== INDEXES FOR EVENT ===\")\n",
    "        for label in EVENTS.keys():\n",
    "            try:\n",
    "                session.run(\n",
    "                    f\"CREATE INDEX {label.lower()}_sysid_index IF NOT EXISTS \"\n",
    "                    f\"FOR (n:{label}) ON (n.sysId)\"\n",
    "                )\n",
    "                print(f\"Index for :{label}(sysId)\")\n",
    "            except Exception as e:\n",
    "                print(f\"Failed to create index for {label}: {e}\")\n",
    "\n",
    "    with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "        print(\"\\n=== BUILDING EVENT OBJECTS ===\")\n",
    "\n",
    "        for label, cfg in EVENTS.items():\n",
    "            if \"mappings\" not in cfg:\n",
    "                print(f\" Skipping {label}, handled separately.\")\n",
    "                continue\n",
    "            log_name = cfg[\"log\"]\n",
    "            id_field = cfg[\"id_field\"]\n",
    "            mappings = cfg[\"mappings\"]\n",
    "            source_label = cfg[\"source_label\"]\n",
    "\n",
    "\n",
    "            for activity, time_field in mappings.items():\n",
    "\n",
    "                event_query = f\"\"\"\n",
    "                CALL apoc.periodic.iterate(\n",
    "                    \"\n",
    "                    MATCH (l:Log {{name: '{log_name}'}})-[:CONTAINS]->(r:Record)\n",
    "                    WHERE r.{id_field} IS NOT NULL AND r.{time_field} IS NOT NULL\n",
    "                    RETURN r.{id_field} AS sysIdrec, r.{time_field} AS ts, r\n",
    "                    \",\n",
    "                    \"\n",
    "                    MERGE (e:{label}:Event {{sysId: sysIdrec + '_{activity}'}})\n",
    "                    SET e.activity = '{activity}', e.timestamp = ts, e.{id_field} = sysIdrec\n",
    "                    MERGE (e)-[:EXTRACTED_FROM]->(r)\n",
    "                    WITH e, r\n",
    "                    MATCH (source:{source_label})-[:EXTRACTED_FROM]->(r)\n",
    "                    MERGE (e)-[:CORR]->(source)\n",
    "\n",
    "                    \",\n",
    "                    {{batchSize: 2000, parallel: false}}\n",
    "                )\n",
    "                YIELD total\n",
    "                RETURN total\n",
    "                \"\"\"\n",
    "                try:\n",
    "                    res = session.run(event_query)\n",
    "                    rec = res.single()\n",
    "                    print(f\"      Created {activity} {label} nodes\")\n",
    "                except Exception as e:\n",
    "                    print(f\"      Failed for {label} {activity}: {e}\")\n"
   ],
   "id": "40e965edca10eac9",
   "outputs": [],
   "execution_count": 31
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:19:31.679411400Z",
     "start_time": "2025-11-06T11:19:01.064107300Z"
    }
   },
   "cell_type": "code",
   "source": "build_events_for_objects(db_connection)",
   "id": "2ddcef32c38044d9",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "=== INDEXES FOR EVENT ===\n",
      "Index for :IncidentEvent(sysId)\n",
      "Index for :ChangeEvent(sysId)\n",
      "Index for :InteractionEvent(sysId)\n",
      "Index for :IncidentActivityEvent(sysId)\n",
      "\n",
      "=== BUILDING EVENT OBJECTS ===\n",
      "      Created Opened IncidentEvent nodes\n",
      "      Created Resolved IncidentEvent nodes\n",
      "      Created Closed IncidentEvent nodes\n",
      "      Created Start ChangeEvent nodes\n",
      "      Created End ChangeEvent nodes\n",
      "      Created Open InteractionEvent nodes\n",
      "      Created Close InteractionEvent nodes\n",
      " Skipping IncidentActivityEvent, handled separately.\n"
     ]
    }
   ],
   "execution_count": 32
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:19:31.694916200Z",
     "start_time": "2025-11-06T11:19:31.686570500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def build_incidentactivityevent_nodes(db_connection):\n",
    "    \"\"\"\n",
    "    Event nodes for IncidentActivity.\n",
    "    \"\"\"\n",
    "\n",
    "    with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "\n",
    "        print(\"\\n=== BUILDING INCIDENT ACTIVITY EVENTS ===\")\n",
    "\n",
    "        conf = EVENTS[\"IncidentActivityEvent\"]\n",
    "        log_name = conf[\"log\"]\n",
    "        incident_field = conf[\"id_field\"]\n",
    "        activity_number_field = conf[\"activityNumber\"]\n",
    "        attributes = conf[\"attributes\"]\n",
    "\n",
    "        attr_return = \", \".join([f\"r.{a} AS {a}\" for a in attributes])\n",
    "        attr_set = \", \".join([f\"e.{a} = r.{a}\" for a in attributes])\n",
    "\n",
    "        source_query = f\"\"\"\n",
    "        MATCH (l:Log {{name: '{log_name}'}})-[:CONTAINS]->(r:Record)\n",
    "        WHERE r.{incident_field} IS NOT NULL AND r.{activity_number_field} IS NOT NULL\n",
    "        RETURN r.{incident_field} AS incidentId,\n",
    "               r.{activity_number_field} AS activityNumber,\n",
    "               r.assignmentGroup AS assignmentGroup,\n",
    "               r.activity AS activity_name,\n",
    "               {attr_return},\n",
    "               r\n",
    "        \"\"\"\n",
    "\n",
    "        iterate_query = f\"\"\"\n",
    "        MERGE (e:IncidentActivityEvent:Event {{sysId: incidentId + '_' + activity_name+ '_' + activityNumber}})\n",
    "        SET {\", \".join([f\"e.{a} = {a}\" for a in attributes])},\n",
    "            e.activityNumber = activityNumber,\n",
    "            e.{incident_field} = incidentId\n",
    "        MERGE (e)-[:EXTRACTED_FROM]->(r)\n",
    "        WITH e, incidentId AS incId, assignmentGroup\n",
    "        MATCH (i:Incident {{sysId: incId}})\n",
    "        MERGE (e)-[:CORR]->(i)\n",
    "        WITH e, assignmentGroup\n",
    "        MATCH (res:Resource {{sysId: assignmentGroup}})\n",
    "        MERGE (e)-[:EXECUTED_BY]->(res)\n",
    "        \"\"\"\n",
    "\n",
    "        apoc_query = f\"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "            \"{source_query}\",\n",
    "            \"{iterate_query}\",\n",
    "            {{batchSize: 2000, parallel: false}}\n",
    "        )\n",
    "        YIELD total\n",
    "        RETURN total\n",
    "        \"\"\"\n",
    "\n",
    "        try:\n",
    "            res = session.run(apoc_query)\n",
    "            rec = res.single()\n",
    "            print(f\"Created IncidentActivityEvent nodes and Relations.\")\n",
    "        except Exception as e:\n",
    "            print(f\"Failed to build IncidentActivityEvent: {e}\")\n"
   ],
   "id": "181b27abbc632cf3",
   "outputs": [],
   "execution_count": 33
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:19:55.508406700Z",
     "start_time": "2025-11-06T11:19:31.694916200Z"
    }
   },
   "cell_type": "code",
   "source": "build_incidentactivityevent_nodes(db_connection)",
   "id": "7955274c9a4f10ac",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "=== BUILDING INCIDENT ACTIVITY EVENTS ===\n",
      "Created IncidentActivityEvent nodes and Relations.\n"
     ]
    }
   ],
   "execution_count": 34
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### Relations between Events and Events & Objects",
   "id": "be9f0133a3875aca"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "- (Resource)-[:RELATED]->(Incident) through IncidentActivityEvent\n",
    "- (IncidentEvent|IncidentActivityEvent)-[:CORR]->(CI_SC) through Incident\n",
    "- (InteractionEvent)-[:CORR]->(CI_SC) through Interaction\n",
    "- (ChangeEvent)-[:CORR]->(CI_SC) through Change\n",
    "- (IncidentEvent|IncidentActivityEvent|ChangeEvent|InteractionEvent) -[:CORR]-> (CI|SC) through CI_SC"
   ],
   "id": "7ccd9256753e3724"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:19:55.560542800Z",
     "start_time": "2025-11-06T11:19:55.517336800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def build_cross_object_Relations(db_connection):\n",
    "    \"\"\"\n",
    "    Relations between Events and Events & Objects\n",
    "    \"\"\"\n",
    "\n",
    "    with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "        print(\"\\n=== BUILDING CROSS-OBJECT Relations ===\")\n",
    "\n",
    "        # Resource -[:RELATED]→ Incident (through IncidentActivityEvent)\n",
    "        query_1 = \"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "            \"\n",
    "            MATCH (res:Resource)<-[:EXECUTED_BY]-(e:IncidentActivityEvent)-[:CORR]->(inc:Incident)\n",
    "            RETURN DISTINCT res, inc\n",
    "            \",\n",
    "            \"\n",
    "            MERGE (res)-[:RELATED]->(inc)\n",
    "            \",\n",
    "            {batchSize: 2000, parallel: false}\n",
    "        )\n",
    "        YIELD total\n",
    "        RETURN total\n",
    "        \"\"\"\n",
    "        try:\n",
    "            session.run(query_1)\n",
    "            print(\" Created :RELATED Relations between Resource and Incident\")\n",
    "        except Exception as e:\n",
    "            print(f\" Failed creating Resource→Incident: {e}\")\n",
    "\n",
    "        # IncidentActivityEvent & IncidentEvent -[:CORR]→ CI_SC (through Incident)\n",
    "        query_2 = \"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "        '\n",
    "        MATCH (e)-[:CORR]->(i:Incident)\n",
    "        WHERE e:IncidentEvent OR e:IncidentActivityEvent\n",
    "        OPTIONAL MATCH (i)-[:AFFECTED_CI_SC]->(cs1:CI_SC)\n",
    "        OPTIONAL MATCH (i)<-[:CAUSED_BY_CI_SC]-(cs2:CI_SC)\n",
    "        WITH e, collect(DISTINCT cs1) + collect(DISTINCT cs2) AS all_cs\n",
    "        UNWIND all_cs AS cs\n",
    "        WITH DISTINCT e, cs WHERE cs IS NOT NULL\n",
    "        RETURN e, cs\n",
    "        ',\n",
    "        '\n",
    "        MERGE (e)-[:CORR]->(cs)\n",
    "        ',\n",
    "        {batchSize: 2000, parallel: false}\n",
    "    )\n",
    "    YIELD total\n",
    "    RETURN total\n",
    "    \"\"\"\n",
    "        try:\n",
    "            session.run(query_2)\n",
    "            print(\" Created :CORR edges between IncidentEvents/IncidentActivityEvents and CI_SC\")\n",
    "        except Exception as e:\n",
    "            print(f\" Failed creating IncidentEvents→CI_SC: {e}\")\n",
    "\n",
    "\n",
    "        # ChangeEvent-[:CORR]→ CI_SC (through Change)\n",
    "        query_3 = \"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "            \"\n",
    "            MATCH (e:ChangeEvent)-[:CORR]->(c:Change)-[:AFFECTED_CI_SC]->(cs:CI_SC)\n",
    "            RETURN DISTINCT e, cs\n",
    "            \",\n",
    "            \"\n",
    "            MERGE (e)-[:CORR]->(cs)\n",
    "            \",\n",
    "            {batchSize: 2000, parallel: false}\n",
    "        )\n",
    "        YIELD total\n",
    "        RETURN total\n",
    "        \"\"\"\n",
    "        try:\n",
    "            session.run(query_3)\n",
    "            print(\" Created :CORR edges from ChangeEvent to CI_SC\")\n",
    "        except Exception as e:\n",
    "            print(f\"   Failed creating ChangeEvent→CI_SC: {e}\")\n",
    "\n",
    "\n",
    "        # InteractionEvent-[:CORR]→CI_SC (through Interaction)\n",
    "        query_4 = \"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "            \"\n",
    "            MATCH (ie:InteractionEvent)-[:CORR]->(i:Interaction)-[:AFFECTED_CI_SC]->(cs:CI_SC)\n",
    "            RETURN DISTINCT ie, cs\n",
    "            \",\n",
    "            \"\n",
    "            MERGE (ie)-[:CORR]->(cs)\n",
    "            \",\n",
    "            {batchSize: 2000, parallel: false}\n",
    "        )\n",
    "        YIELD total\n",
    "        RETURN total\n",
    "        \"\"\"\n",
    "        try:\n",
    "            session.run(query_4)\n",
    "            print(\" Created :CORR edges from InteractionEvent to CI_SC\")\n",
    "        except Exception as e:\n",
    "            print(f\"   Failed creating InteractionEvent→CI_SC: {e}\")\n",
    "\n",
    "        #  All Event Types -[:CORR]-> CI and SC (through CI_SC)\n",
    "        query_5 = \"\"\"\n",
    "        CALL apoc.periodic.iterate(\n",
    "            \"\n",
    "            MATCH (e)-[:CORR]->(cs:CI_SC)\n",
    "            OPTIONAL MATCH (cs)-[:RELATED_CI]->(ci:ConfigurationItem)\n",
    "            OPTIONAL MATCH (cs)-[:RELATED_SC]->(sc:ServiceComponent)\n",
    "            WITH e, collect(DISTINCT ci) + collect(DISTINCT sc) AS targets\n",
    "            UNWIND targets AS t\n",
    "            WITH DISTINCT e, t WHERE t IS NOT NULL\n",
    "            RETURN e, t\n",
    "            \",\n",
    "            \"\n",
    "            MERGE (e)-[:CORR]->(t)\n",
    "            \",\n",
    "            {batchSize: 2000, parallel: false}\n",
    "        )\n",
    "        YIELD total\n",
    "        RETURN total\n",
    "        \"\"\"\n",
    "        try:\n",
    "            session.run(query_5)\n",
    "            print(\" Created :CORR edges from all Events to ConfigurationItem and ServiceComponent (via CI_SC)\")\n",
    "        except Exception as e:\n",
    "            print(f\"  Failed creating Events→CI/SC: {e}\")\n",
    "\n"
   ],
   "id": "e276a0fb9ea5d9c9",
   "outputs": [],
   "execution_count": 35
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:20:09.221248700Z",
     "start_time": "2025-11-06T11:19:55.562424600Z"
    }
   },
   "cell_type": "code",
   "source": "build_cross_object_Relations(db_connection)",
   "id": "1f6560ceb0bcfacb",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "=== BUILDING CROSS-OBJECT Relations ===\n",
      " Created :RELATED Relations between Resource and Incident\n",
      " Created :CORR edges between IncidentEvents/IncidentActivityEvents and CI_SC\n",
      " Created :CORR edges from ChangeEvent to CI_SC\n",
      " Created :CORR edges from InteractionEvent to CI_SC\n",
      " Created :CORR edges from all Events to ConfigurationItem and ServiceComponent (via CI_SC)\n"
     ]
    }
   ],
   "execution_count": 36
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "RELATED_ACTIVITY edges between IncidentEvent and IncidentActivityEvent for activities (Opened → Open, Resolved → Resolved, Closed → Closed)",
   "id": "d2760f5f4ca95185"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:20:09.240730200Z",
     "start_time": "2025-11-06T11:20:09.229467700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def build_related_activity_edges(db_connection):\n",
    "    \"\"\"\n",
    "    Create RELATED_ACTIVITY edges between IncidentEvent and IncidentActivityEvent\n",
    "    based on activity mapping (Opened → Open, Resolved → Resolved, Closed → Closed)\n",
    "    for events correlated to the same Incident.\n",
    "    \"\"\"\n",
    "    activity_map = {\n",
    "        \"Opened\": \"Open\",\n",
    "        \"Resolved\": \"Resolved\",\n",
    "        \"Closed\": \"Closed\"\n",
    "    }\n",
    "\n",
    "    with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "        print(\"\\n=== BUILDING RELATED_ACTIVITY EDGES ===\")\n",
    "\n",
    "        for inc_act, act_act in activity_map.items():\n",
    "            query = f\"\"\"\n",
    "            CALL apoc.periodic.iterate(\n",
    "                '\n",
    "                MATCH (e:IncidentEvent)-[:CORR]->(i:Incident)\n",
    "                MATCH (ae:IncidentActivityEvent)-[:CORR]->(i)\n",
    "                WHERE e.activity = \"{inc_act}\" AND ae.activity = \"{act_act}\"\n",
    "                RETURN e, ae\n",
    "                ',\n",
    "                '\n",
    "                MERGE (e)-[:RELATED_ACTIVITY]->(ae)\n",
    "                ',\n",
    "                {{batchSize: 2000, parallel: true}}\n",
    "            )\n",
    "            YIELD total\n",
    "            RETURN total\n",
    "            \"\"\"\n",
    "            try:\n",
    "                session.run(query)\n",
    "                print(f\" Created RELATED_ACTIVITY edges for {inc_act} → {act_act}\")\n",
    "            except Exception as e:\n",
    "                print(f\" Failed for {inc_act} → {act_act}: {e}\")\n"
   ],
   "id": "82a214ed0db4ca61",
   "outputs": [],
   "execution_count": 37
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:20:10.621464700Z",
     "start_time": "2025-11-06T11:20:09.240730200Z"
    }
   },
   "cell_type": "code",
   "source": "build_related_activity_edges(db_connection)",
   "id": "8952962231072c5d",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "=== BUILDING RELATED_ACTIVITY EDGES ===\n",
      " Created RELATED_ACTIVITY edges for Opened → Open\n",
      " Created RELATED_ACTIVITY edges for Resolved → Resolved\n",
      " Created RELATED_ACTIVITY edges for Closed → Closed\n"
     ]
    }
   ],
   "execution_count": 38
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "# Filter out all events of objects that have at least one event before cutoff\n",
    "Cutoff = 2013-08-19T09:59:53.000000000+01:00"
   ],
   "id": "6e27209c011817a5"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:20:13.630178900Z",
     "start_time": "2025-11-06T11:20:10.629098100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "results = []\n",
    "labels = ['Incident', 'Interaction', 'Change']\n",
    "\n",
    "count_query = '''\n",
    "    MATCH (ot:ObjectType) <- [:IS_OF_TYPE] - (o) - [] - (e:Event)\n",
    "    WHERE ot.objectType in $labels\n",
    "    WITH e, ot, o, e.timestamp < dateTime(\"2013-08-19T09:59:53.000000000+01:00\") as before_cutoff\n",
    "    WITH ot, o, collect(distinct before_cutoff) as before_cutoffs\n",
    "    WHERE True in before_cutoffs\n",
    "    MATCH (o) - [] - (all_e:Event)\n",
    "    RETURN ot.objectType as _label, count(distinct o) as object_deleted, count(distinct all_e) as events_deleted\n",
    "'''\n",
    "query = Query(\n",
    "    query_str=count_query,\n",
    "    parameters={'labels': labels}\n",
    ")\n",
    "result = pd.DataFrame(db_connection.exec_query(query))\n",
    "results.append(result)\n",
    "\n",
    "delete_query_str = '''\n",
    "    MATCH (ot:ObjectType) <- [:IS_OF_TYPE] - (o) - [] - (e:Event)\n",
    "    WHERE ot.objectType in $labels\n",
    "    WITH e, o, e.timestamp < dateTime(\"2013-08-19T09:59:53.000000000+01:00\") as before_cutoff\n",
    "    WITH o, collect(distinct before_cutoff) as before_cutoffs\n",
    "    WHERE True in before_cutoffs\n",
    "    MATCH (o) - [] - (all_e:Event)\n",
    "    DETACH DELETE o\n",
    "    DETACH DELETE all_e\n",
    "'''\n",
    "\n",
    "delete_query = Query(\n",
    "    query_str=delete_query_str,\n",
    "    parameters={'labels': labels}\n",
    ")\n",
    "db_connection.exec_query(delete_query)\n",
    "\n",
    "df_result = pd.concat(results)\n",
    "df_result"
   ],
   "id": "1689de9b5be00367",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "text/plain": [
       "        _label  object_deleted  events_deleted\n",
       "0     Incident             238            8691\n",
       "1  Interaction             451             902\n",
       "2       Change              82             164"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>_label</th>\n",
       "      <th>object_deleted</th>\n",
       "      <th>events_deleted</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Incident</td>\n",
       "      <td>238</td>\n",
       "      <td>8691</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>451</td>\n",
       "      <td>902</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Change</td>\n",
       "      <td>82</td>\n",
       "      <td>164</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 39
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:20:14.439591700Z",
     "start_time": "2025-11-06T11:20:13.688463900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "\n",
    "query = '''\n",
    "    MATCH (ot:ObjectType) <- [:IS_OF_TYPE] - (o) - [] - (e:Event)\n",
    "    WHERE ot.objectType in $labels\n",
    "    RETURN ot.objectType as _label, count(distinct o) as objects_kept, count(distinct e) as events_kept\n",
    "'''\n",
    "query = Query(\n",
    "    query_str=query,\n",
    "    parameters={'labels': labels}\n",
    ")\n",
    "df_result_kept = pd.DataFrame(db_connection.exec_query(query))\n",
    "print(df_result_kept)"
   ],
   "id": "f285159d29d4a8cb",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "        _label  objects_kept  events_kept\n",
      "0     Incident         46368       596012\n",
      "1  Interaction        146553       293106\n",
      "2       Change         16611        33217\n"
     ]
    }
   ],
   "execution_count": 40
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:20:14.627592800Z",
     "start_time": "2025-11-06T11:20:14.613553100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "df_both = df_result.set_index('_label').join(df_result_kept.set_index('_label'))\n",
    "df_both['total_objects'] = df_both['objects_kept'] + df_both['object_deleted']\n",
    "df_both['total_events'] = df_both['events_kept'] + df_both['events_deleted']\n",
    "df_both['% events deleted'] = round(df_both['events_deleted'] / df_both['total_events'] * 100, 2)\n",
    "df_both['% objects deleted'] = round(df_both['object_deleted'] / df_both['total_objects'] * 100, 2)\n",
    "df_both = df_both[\n",
    "    ['object_deleted', 'objects_kept', 'total_objects', '% objects deleted', 'events_deleted', 'events_kept',\n",
    "     'total_events', '% events deleted']]\n",
    "print(df_both)"
   ],
   "id": "f3c978dab55b399e",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "             object_deleted  objects_kept  total_objects  % objects deleted  events_deleted  events_kept  total_events  % events deleted\n",
      "_label                                                                                                                                  \n",
      "Incident                238         46368          46606               0.51            8691       596012        604703              1.44\n",
      "Interaction             451        146553         147004               0.31             902       293106        294008              0.31\n",
      "Change                   82         16611          16693               0.49             164        33217         33381              0.49\n"
     ]
    }
   ],
   "execution_count": 41
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "## Delete non-referred CI_SC",
   "id": "b98d943539e288c"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:20:14.978135200Z",
     "start_time": "2025-11-06T11:20:14.663883300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''MATCH (ci_sc:CI_SC)\n",
    "WHERE NOT EXISTS((ci_sc) <- [] - (:Event)) AND NOT EXISTS ((ci_sc) -- (:Incident|Change|Interaction))\n",
    "DETACH DELETE ci_sc\n",
    "RETURN count(ci_sc) as cnt'''\n",
    "\n",
    "pd.DataFrame(db_connection.exec_query(query))"
   ],
   "id": "c2c3400d97cbb37b",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   cnt\n",
       "0   49"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>cnt</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>49</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 42
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### DF edges",
   "id": "abb86fd392e56fc5"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Each DF has attributes:\n",
    "- object (which object it correlates Incident, Interactions, Change, etc.)\n",
    "- object identifier (sysid) (which object it belongs incidentId, interactionsId, changeId, etc.)\n",
    "- dftype is an attribute that only exists for events of Incident objects that specifyes whether the DF relation connects IncidentActivityEvent or IncidentEvent Event nodes"
   ],
   "id": "621312905a7ac140"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:20:15.076832100Z",
     "start_time": "2025-11-06T11:20:15.056046100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def build_df_edges(db_connection):\n",
    "    \"\"\"\n",
    "    Build :DF:* edges for all objects except KnowledgeDocument.\n",
    "    Creates separate DF edges for each object type and incident event type.\n",
    "    \"\"\"\n",
    "\n",
    "    all_objects = {**SIMPLE_OBJECTS, **RESOURCES, **COMPLEX_OBJECTS}\n",
    "    excluded_objects = {\"KnowledgeDocument\", \"ConfigurationItem\", \"ServiceComponent\"} # add here objects for which DF are not needed\n",
    "    for key in excluded_objects:\n",
    "        all_objects.pop(key, None)\n",
    "\n",
    "    with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "        print(\"=== BUILDING DIRECTLY_FOLLOWS (DF) EDGES (excluding Incident) ===\")\n",
    "\n",
    "        for obj_label, obj_data in all_objects.items():\n",
    "            sys_id_attr = obj_data.get(\"sysId\")\n",
    "\n",
    "            query = f\"\"\"\n",
    "            CALL apoc.periodic.iterate(\n",
    "                '\n",
    "                MATCH (e:Event)-[]-> (o) - [:IS_OF_TYPE] -> (ot:ObjectType {{objectType:\"{obj_label}\" }})\n",
    "                WHERE e.timestamp IS NOT NULL\n",
    "                WITH o, ot.objectType as oType, e ORDER BY e.timestamp, ID(e)\n",
    "                WITH o, oType, collect(e) AS events\n",
    "                UNWIND range(0, size(events)-2) AS idx\n",
    "                WITH events[idx] AS fromEv, events[idx+1] AS toEv, o.{sys_id_attr} AS objSysId, oType\n",
    "                RETURN fromEv, toEv, objSysId, oType\n",
    "                ',\n",
    "                '\n",
    "                WITH fromEv, toEv, objSysId, oType\n",
    "                MERGE (fromEv)-[rel:DF {{objectType:oType, id:objSysId}}]->(toEv)\n",
    "                ',\n",
    "                {{batchSize:1000, parallel:false}}\n",
    "            ) YIELD total\n",
    "            RETURN total\n",
    "            \"\"\"\n",
    "\n",
    "            res = session.run(query).data()\n",
    "            print(f\"{obj_label} DF creation result:\", res)\n"
   ],
   "id": "956c7eae0c9f430d",
   "outputs": [],
   "execution_count": 43
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:20:54.297052100Z",
     "start_time": "2025-11-06T11:20:15.163127200Z"
    }
   },
   "cell_type": "code",
   "source": "build_df_edges(db_connection)",
   "id": "f1a91776846473ba",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "=== BUILDING DIRECTLY_FOLLOWS (DF) EDGES (excluding Incident) ===\n",
      "Incident DF creation result: [{'total': 549644}]\n",
      "Interaction DF creation result: [{'total': 146553}]\n",
      "Change DF creation result: [{'total': 16606}]\n",
      "Resource DF creation result: [{'total': 458508}]\n",
      "CI_SC DF creation result: [{'total': 929575}]\n"
     ]
    }
   ],
   "execution_count": 44
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### Statistics",
   "id": "ecc42898681ab0"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:20:54.379078Z",
     "start_time": "2025-11-06T11:20:54.371260100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def get_graph_statistics(db_connection):\n",
    "    \"\"\"\n",
    "    Statistics about nodes and relations.\n",
    "    \"\"\"\n",
    "\n",
    "    with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "        print(\"\\n=== GRAPH STATISTICS ===\")\n",
    "\n",
    "        try:\n",
    "            node_query = \"\"\"\n",
    "            MATCH (n)\n",
    "            WITH n, labels(n) as labels\n",
    "            RETURN reduce(label_str = \"(\", l in labels | label_str + \":\" + l) + \")\" as label, count(n) as count ORDER BY count DESC\n",
    "            \"\"\"\n",
    "            node_counts = session.run(node_query)\n",
    "            print(\"\\n--- Node counts ---\")\n",
    "            for record in node_counts:\n",
    "                print(f\"{record['label']:<30} {record['count']}\")\n",
    "\n",
    "            rel_query = \"\"\"\n",
    "            MATCH (n) - [r] -> (n2)\n",
    "            RETURN \"[:\" + type(r) + \"]\" as  type, count(r) as count ORDER BY count DESC\n",
    "            \"\"\"\n",
    "            rel_counts = session.run(rel_query)\n",
    "            print(\"\\n--- Relationship counts ---\")\n",
    "            for record in rel_counts:\n",
    "                print(f\"{record['type']:<30} {record['count']}\")\n",
    "\n",
    "            total_nodes = session.run(\"MATCH (n) RETURN count(n) AS total\").single()[\"total\"]\n",
    "            total_rels = session.run(\"MATCH ()-[r]->() RETURN count(r) AS total\").single()[\"total\"]\n",
    "\n",
    "            print(\"\\n--- Totals ---\")\n",
    "            print(f\"Total nodes: {total_nodes}\")\n",
    "            print(f\"Total relationships: {total_rels}\")\n",
    "\n",
    "        except Exception as e:\n",
    "            print(f\"Failed to get graph statistics: {e}\")\n"
   ],
   "id": "ad9be90484d13cb8",
   "outputs": [],
   "execution_count": 45
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:20:59.065109100Z",
     "start_time": "2025-11-06T11:20:54.407659800Z"
    }
   },
   "cell_type": "code",
   "source": "get_graph_statistics(db_connection)",
   "id": "10d4ce9d8042d1d4",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "=== GRAPH STATISTICS ===\n",
      "\n",
      "--- Node counts ---\n",
      "(:Record)                      690622\n",
      "(:IncidentActivityEvent:Event) 458748\n",
      "(:InteractionEvent:Event)      293106\n",
      "(:Interaction)                 146553\n",
      "(:IncidentEvent:Event)         137336\n",
      "(:Incident)                    46819\n",
      "(:ChangeEvent:Event)           33217\n",
      "(:Change)                      17918\n",
      "(:CI_SC)                       15307\n",
      "(:ConfigurationItem)           15134\n",
      "(:KnowledgeDocument)           2373\n",
      "(:ServiceComponent)            340\n",
      "(:Resource)                    242\n",
      "(:ObjectType)                  8\n",
      "(:Log)                         4\n",
      "\n",
      "--- Relationship counts ---\n",
      "[:EXTRACTED_FROM]              2982400\n",
      "[:DF]                          2100886\n",
      "[:CORR]                        1864892\n",
      "[:CONTAINS]                    690622\n",
      "[:EXECUTED_BY]                 458748\n",
      "[:IS_OF_TYPE]                  244235\n",
      "[:AFFECTED_CI_SC]              222859\n",
      "[:USED_KM]                     192921\n",
      "[:RELATED]                     113425\n",
      "[:RELATED_ACTIVITY]            97622\n",
      "[:RELATED_INCIDENT]            51303\n",
      "[:CAUSED_BY_CI_SC]             45318\n",
      "[:RELATED_CI]                  15306\n",
      "[:RELATED_SC]                  15279\n",
      "[:RELATED_CHANGE]              501\n",
      "\n",
      "--- Totals ---\n",
      "Total nodes: 1857727\n",
      "Total relationships: 9096317\n"
     ]
    }
   ],
   "execution_count": 46
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T11:11:48.331325900Z",
     "start_time": "2025-11-05T11:11:48.324634400Z"
    }
   },
   "cell_type": "code",
   "source": "",
   "id": "3afffd7648b43cc",
   "outputs": [],
   "execution_count": 138
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T11:11:48.337847700Z",
     "start_time": "2025-11-05T11:11:48.332325600Z"
    }
   },
   "cell_type": "code",
   "source": "",
   "id": "bc4c4781c8c8ea10",
   "outputs": [],
   "execution_count": 138
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
