{
 "cells": [
  {
   "cell_type": "code",
   "id": "537085a2",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T12:34:23.677572700Z",
     "start_time": "2025-11-06T12:34:23.627738700Z"
    }
   },
   "source": [
    "from pathlib import Path\n",
    "\n",
    "import pandas as pd\n",
    "from promg.modules.db_management import DBManagement\n",
    "from promg import Configuration, DatabaseConnection, Performance, SemanticHeader, DatasetDescriptions, OcedPg, Query\n",
    "\n",
    "import yaml\n",
    "\n",
    "import plotly.express as px\n",
    "import plotly.subplots as sp\n",
    "import plotly.graph_objects as go"
   ],
   "outputs": [],
   "execution_count": 5
  },
  {
   "cell_type": "code",
   "id": "60b6e72b",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T12:34:24.277327900Z",
     "start_time": "2025-11-06T12:34:24.207608200Z"
    }
   },
   "source": [
    "case_study = 'bpic14'\n",
    "\n",
    "conf_path = Path(case_study, 'config.yaml')\n",
    "config = yaml.safe_load(open(conf_path))\n",
    "\n",
    "print(f\"These are the credentials that I expect to be set for the database.\")\n",
    "print(f\"db_name: {config['db_name']}\")\n",
    "print(f\"uri: {config['uri']}\")\n",
    "print(f\"password: {config['password']}\")\n",
    "print(\"----------------------\")\n",
    "print(f\"If you have other credentials, please change them at: {conf_path}\")\n",
    "\n",
    "config = Configuration.init_conf_with_config_file(conf_path)\n",
    "db_connection = DatabaseConnection.set_up_connection(config=config)"
   ],
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "These are the credentials that I expect to be set for the database.\n",
      "db_name: neo4j\n",
      "uri: bolt://localhost:7687\n",
      "password: bpic2014\n",
      "----------------------\n",
      "If you have other credentials, please change them at: bpic14\\config.yaml\n"
     ]
    }
   ],
   "execution_count": 6
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T12:34:43.944771900Z",
     "start_time": "2025-11-06T12:34:43.619757300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# clear previously created nodes and relations\n",
    "# start/end relations\n",
    "q_clear_start = '''\n",
    ":auto\n",
    "MATCH (n)<-[r:START]-(e:Event)\n",
    "CALL (r) {\n",
    "    DELETE r\n",
    "} IN TRANSACTIONS\n",
    " RETURN count(r) '''\n",
    "db_connection.exec_query(q_clear_start)"
   ],
   "id": "19bc39b6d7cb8fd4",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(r)': 0}]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 8
  },
  {
   "cell_type": "code",
   "id": "ca768b4f",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T12:35:01.044873700Z",
     "start_time": "2025-11-06T12:34:58.528064900Z"
    }
   },
   "source": [
    "q_clear_end = '''\n",
    ":auto\n",
    "MATCH (n)<-[r:END]-(e:Event)\n",
    " CALL (r) {\n",
    "    DELETE r\n",
    " } IN TRANSACTIONS\n",
    "\n",
    " RETURN count(r)\n",
    "'''\n",
    "db_connection.exec_query(q_clear_end)\n"
   ],
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(r)': 209532}]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 9
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T12:35:04.266238800Z",
     "start_time": "2025-11-06T12:35:02.261774500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# high-level events\n",
    "qClearStartHLE = '''\n",
    ":auto\n",
    "MATCH (n)<-[r:START]-(e:HighLevelEvent)\n",
    "CALL (r) {\n",
    "    DELETE r\n",
    "} IN TRANSACTIONS\n",
    "\n",
    " RETURN count(r)\n",
    " '''\n",
    "db_connection.exec_query(qClearStartHLE)\n"
   ],
   "id": "31547c20b5c437ec",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(r)': 209532}]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 10
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T12:35:07.748431Z",
     "start_time": "2025-11-06T12:35:05.844983900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "qClearEndHLE = '''\n",
    ":auto\n",
    "MATCH (n)<-[r:END]-(e:HighLevelEvent)\n",
    "CALL (r) {\n",
    "    DELETE r\n",
    "} IN TRANSACTIONS\n",
    "\n",
    " RETURN count(r)\n",
    "'''\n",
    "db_connection.exec_query(qClearEndHLE)\n"
   ],
   "id": "b0f250041e080a96",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(r)': 209532}]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 11
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T13:49:56.091702700Z",
     "start_time": "2025-11-06T13:49:51.087689300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "q_clear_df_hle = '''\n",
    ":auto\n",
    "MATCH (e2:HighLevelEvent)<-[r:DF]-(e:HighLevelEvent)\n",
    "CALL (r) {\n",
    "    DELETE r\n",
    "} IN TRANSACTIONS\n",
    "\n",
    " RETURN count(r)\n",
    "'''\n",
    "db_connection.exec_query(q_clear_df_hle)\n"
   ],
   "id": "b6d87b73b1f8c026",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(r)': 635826}]"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 32
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T12:35:36.279336500Z",
     "start_time": "2025-11-06T12:35:25.147563200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "qClearHighLevelEvent = '''\n",
    ":auto\n",
    "MATCH (h:HighLevelEvent)\n",
    "CALL (h) {\n",
    "    DETACH DELETE h\n",
    "} IN TRANSACTIONS\n",
    " RETURN count(h)\n",
    "'''\n",
    "db_connection.exec_query(qClearHighLevelEvent)\n"
   ],
   "id": "287ab300c3c68fe4",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(h)': 419059}]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 13
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T12:35:40.866440900Z",
     "start_time": "2025-11-06T12:35:40.724277700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "q_clear_start = '''\n",
    ":auto\n",
    "MATCH (n)<-[r:START_CORR]-(e:HighLevelEvent)\n",
    "CALL (r) {\n",
    "    DELETE r\n",
    "} IN TRANSACTIONS\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(q_clear_start)\n",
    "q_clear_end = '''\n",
    ":auto\n",
    "MATCH (n)<-[r:END_CORR]-(e:HighLevelEvent)\n",
    "CALL (r) {\n",
    "    DELETE r\n",
    "} IN TRANSACTIONS\n",
    "'''\n",
    "db_connection.exec_query(q_clear_end)"
   ],
   "id": "f8c8dd93901e6ec0",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 14
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T12:35:41.546606200Z",
     "start_time": "2025-11-06T12:35:41.432734900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "qClearDuring = '''\n",
    ":auto\n",
    "MATCH (:HighLevelEvent)<-[r:DURING]-(:HighLevelEvent)\n",
    "CALL (r) {\n",
    "    DELETE r\n",
    "} IN TRANSACTIONS\n",
    "'''\n",
    "db_connection.exec_query(qClearDuring)"
   ],
   "id": "c13d7edd6d9f4a80",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 15
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T12:35:43.244342600Z",
     "start_time": "2025-11-06T12:35:43.212936Z"
    }
   },
   "cell_type": "code",
   "source": "object_types = [\"Change\", \"Incident\", \"Interaction\"]",
   "id": "7113d1308e78b1a4",
   "outputs": [],
   "execution_count": 16
  },
  {
   "cell_type": "code",
   "id": "3ab1924a",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T12:35:54.552651Z",
     "start_time": "2025-11-06T12:35:44.273532500Z"
    }
   },
   "source": [
    "# infer start and end events for each object type\n",
    "q_start_event = '''\n",
    "    // Infer start event of an object\n",
    "    MATCH (n) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "    MATCH (n)<-[c:CORR]-(e:Event) WHERE NOT ()-[:DF {id:n.sysId}]->(e)\n",
    "    MERGE (n)<-[:START]-(e)\n",
    "    RETURN count(n)\n",
    "'''\n",
    "\n",
    "q_end_event = '''\n",
    "    // Infer start event of an object\n",
    "\n",
    "    MATCH (n) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "    MATCH (n)<-[c:CORR]-(e:Event) WHERE NOT (e)-[:DF {id:n.sysId}]->()\n",
    "    MERGE (n)<-[:END]-(e)\n",
    "\n",
    "    RETURN count(n)\n",
    "    '''\n",
    "\n",
    "for object_type in object_types:\n",
    "    print(f\"Inferring start and end events for object type: {object_type}\")\n",
    "    q_start_event_result = Query(\n",
    "        query_str=q_start_event,\n",
    "        parameters={\"objectType\": object_type}\n",
    "    )\n",
    "\n",
    "    print(db_connection.exec_query(q_start_event_result))\n",
    "\n",
    "    q_end_event_result = Query(\n",
    "        query_str=q_end_event,\n",
    "        parameters={\"objectType\": object_type}\n",
    "    )\n",
    "    print(db_connection.exec_query(q_end_event_result))"
   ],
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Inferring start and end events for object type: Change\n",
      "[{'count(n)': 16611}]\n",
      "[{'count(n)': 16611}]\n",
      "Inferring start and end events for object type: Incident\n",
      "[{'count(n)': 46368}]\n",
      "[{'count(n)': 46368}]\n",
      "Inferring start and end events for object type: Interaction\n",
      "[{'count(n)': 146553}]\n",
      "[{'count(n)': 146553}]\n"
     ]
    }
   ],
   "execution_count": 17
  },
  {
   "cell_type": "code",
   "id": "57982ba2",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T12:35:57.862399800Z",
     "start_time": "2025-11-06T12:35:57.027864600Z"
    }
   },
   "source": [
    "# materialize time between events as duration on DF edge\n",
    "q_materialize_duration_on_df = '''\n",
    "    :auto\n",
    "    MATCH (e1:Event)-[df:DF]->(e2:Event) WHERE df.duration IS NULL\n",
    "    CALL (e1, df, e2) {\n",
    "        SET df.duration = duration.inSeconds(e1.timestamp, e2.timestamp).seconds\n",
    "    } IN TRANSACTIONS\n",
    "    RETURN count(*) AS total\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(q_materialize_duration_on_df)"
   ],
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'total': 0}]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 18
  },
  {
   "cell_type": "code",
   "id": "98e4243c",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T12:35:59.336306700Z",
     "start_time": "2025-11-06T12:35:59.216365900Z"
    }
   },
   "source": [
    "# build index for high-level events\n",
    "qCreateIndexHLE_sys = f'''\n",
    "    CREATE INDEX highLevelEventSysIdIndex IF NOT EXISTS FOR (h:HighLevelEvent) ON (h.sysId);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_sys)\n",
    "\n",
    "qCreateIndexHLE_timestamp = f'''\n",
    "        CREATE INDEX highLevelEventEndTimeIndex IF NOT EXISTS FOR (h:HighLevelEvent) ON (h.timestamp);\n",
    "    '''\n",
    "db_connection.exec_query(qCreateIndexHLE_timestamp)"
   ],
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 19
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T12:36:19.470417800Z",
     "start_time": "2025-11-06T12:36:06.313372700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "\n",
    "# build high-level events\n",
    "qBuildHighLevelEvent = '''\n",
    "    :auto\n",
    "    MATCH (n) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "    MATCH (eStart:Event)-[st:START]->(n)<-[en:END]-(eEnd:Event)\n",
    "    WITH DISTINCT eStart, eEnd\n",
    "    CALL (eStart, eEnd) {\n",
    "        MERGE (h:HighLevelEvent {sysId: \"HLE_\" + eStart.sysId})\n",
    "        ON CREATE SET h.timestamp=eStart.timestamp, h.activity=$objectType, h.subActivity = eStart.activity\n",
    "        MERGE (h)-[:START]->(eStart)\n",
    "        RETURN h\n",
    "        UNION\n",
    "        MERGE (h:HighLevelEvent {sysId: \"HLE_\" + eEnd.sysId})\n",
    "        ON CREATE SET h.timestamp=eEnd.timestamp, h.activity=$objectType, h.subActivity = eEnd.activity\n",
    "        MERGE (h)-[:END]->(eEnd)\n",
    "        RETURN h\n",
    "    } IN TRANSACTIONS\n",
    "    RETURN count(h)\n",
    "'''\n",
    "\n",
    "for object_type in object_types:\n",
    "    query = Query(\n",
    "        query_str=qBuildHighLevelEvent,\n",
    "        parameters={\n",
    "            \"objectType\": object_type,\n",
    "        }\n",
    "    )\n",
    "\n",
    "    result = db_connection.exec_query(query)\n",
    "    print(f\"{result[0]['count(h)']} high level events for {object_type}\")"
   ],
   "id": "6986d35a4303d9d7",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "33217 high level events for Change\n",
      "92736 high level events for Incident\n",
      "293106 high level events for Interaction\n"
     ]
    }
   ],
   "execution_count": 20
  },
  {
   "cell_type": "code",
   "id": "fd4364e7",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T12:37:27.915933700Z",
     "start_time": "2025-11-06T12:37:21.101521700Z"
    }
   },
   "source": [
    "# lift CORR to high-level events\n",
    "qLiftCorrToHL = '''\n",
    "    :auto\n",
    "    MATCH (h:HighLevelEvent)-[:START|END]->(:Event)-[:CORR]->(n)\n",
    "    WITH distinct h, n\n",
    "    CALL (h, n) {\n",
    "        MERGE(h) - [:CORR]->(n)\n",
    "    } IN TRANSACTIONS\n",
    "'''\n",
    "db_connection.exec_query(qLiftCorrToHL)"
   ],
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 21
  },
  {
   "cell_type": "code",
   "id": "d9d5e7e1",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T13:51:02.693020200Z",
     "start_time": "2025-11-06T13:51:02.677257700Z"
    }
   },
   "source": [
    "# build DF relations between high-level events\n",
    "# step 1: build HL-DF relations between events\n",
    "\n",
    "qBuildDfRelationsHLE = '''\n",
    "    :auto\n",
    "    // get only START/END events of each HL event correlated to CI_SC\n",
    "    MATCH (ot:ObjectType {objectType: $objectType}) <- [:IS_OF_TYPE] - (o) <-[:CORR]-(h:HighLevelEvent)\n",
    "    // order by time\n",
    "    WHERE h.timestamp IS NOT NULL\n",
    "    WITH o, h ORDER BY h.timestamp, ID(h)\n",
    "    // We want to prioritize those events that have already a DF, but False becomes before true, so negate\n",
    "    WITH o, collect(h) AS events\n",
    "    UNWIND range(0, size(events)-2) AS idx\n",
    "    WITH events[idx] AS fromEv, events[idx+1] AS toEv, o\n",
    "    CALL (fromEv,toEv,o) {\n",
    "        MERGE (fromEv)-[rel:DF {objectType:$objectType, id:o.sysId}]->(toEv)\n",
    "        RETURN rel\n",
    "    } IN TRANSACTIONS\n",
    "    RETURN count(rel) AS total\n",
    "'''"
   ],
   "outputs": [],
   "execution_count": 33
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T13:51:17.689262300Z",
     "start_time": "2025-11-06T13:51:05.687650700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "for object_type in object_types + [\"CI_SC\"]:\n",
    "    query = Query(\n",
    "        query_str=qBuildDfRelationsHLE,\n",
    "        parameters={\n",
    "            \"objectType\": object_type,\n",
    "        }\n",
    "    )\n",
    "\n",
    "    print(f\"DF for {object_type}: {db_connection.exec_query(query)}\")"
   ],
   "id": "1b20613c5218d711",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "DF for Change: [{'total': 16606}]\n",
      "DF for Incident: [{'total': 46368}]\n",
      "DF for Interaction: [{'total': 146553}]\n",
      "DF for CI_SC: [{'total': 426299}]\n"
     ]
    }
   ],
   "execution_count": 34
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "Fix DF for those with 0 minutes and are overlapping",
   "id": "53f8dc8ca1af2b61"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T13:57:11.108047600Z",
     "start_time": "2025-11-06T13:57:09.557055500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "    MATCH (hle) - [:DF {objectType: hle.activity}] -> (hle3)\n",
    "    MATCH (hle2) - [:DF {objectType: hle2.activity}] -> (hle4)\n",
    "    MATCH (hle:HighLevelEvent) - [df12:DF  {objectType: 'CI_SC'}] -> (hle2:HighLevelEvent)\n",
    "        - [df23:DF  {objectType: 'CI_SC', id:df12.id}] -> (hle3:HighLevelEvent)\n",
    "        - [df34:DF  {objectType: 'CI_SC', id:df12.id}] -> (hle4:HighLevelEvent)\n",
    "    WITH hle, hle2, hle3, hle4, df12, df23, df34, duration.inSeconds(hle3.timestamp, hle4.timestamp).seconds as seconds\n",
    "    WHERE seconds = 0\n",
    "    DELETE df23\n",
    "    DELETE df34\n",
    "    MERGE (hle2)-[:DF {objectType: 'CI_SC', id:df12.id}] -> (hle4)\n",
    "    MERGE (hle4)-[:DF {objectType: 'CI_SC', id:df12.id}] -> (hle3)\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(query)"
   ],
   "id": "cceff35a59d58d3e",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 37
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T13:59:54.577428600Z",
     "start_time": "2025-11-06T13:59:53.397206700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "    MATCH (hle) - [:DF {objectType: hle.activity}] -> (hle3)\n",
    "    MATCH (hle2) - [:DF {objectType: hle2.activity}] -> (hle4)\n",
    "    MATCH (hle:HighLevelEvent) - [df12:DF  {objectType: 'CI_SC'}] -> (hle2:HighLevelEvent)\n",
    "        - [df23:DF  {objectType: 'CI_SC', id:df12.id}] -> (hle3:HighLevelEvent)\n",
    "        - [df34:DF  {objectType: 'CI_SC', id:df12.id}] -> (hle4:HighLevelEvent)\n",
    "    WITH hle, hle2, hle3, hle4, df12, df23, df34, duration.inSeconds(hle.timestamp, hle2.timestamp).seconds as seconds\n",
    "    WHERE seconds = 0\n",
    "    DELETE df12\n",
    "    DELETE df23\n",
    "    MERGE (hle)-[:DF {objectType: 'CI_SC', id:df34.id}] -> (hle3)\n",
    "    MERGE (hle3)-[:DF {objectType: 'CI_SC', id:df34.id}] -> (hle2)\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(query)"
   ],
   "id": "939198eaf439aab7",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 38
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T09:40:01.357324Z",
     "start_time": "2025-11-06T09:40:00.625387400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# infer start and end events for each object type\n",
    "\n",
    "object_type = \"CI_SC\"\n",
    "print(f\"Inferring start and end events for object type: {object_type}\")\n",
    "\n",
    "q_start_high_level_event_str = '''\n",
    ":auto\n",
    "// Infer start event of an object\n",
    "MATCH (ot:ObjectType {objectType: $objectType}) <- [:IS_OF_TYPE] - (n)\n",
    "CALL (n) {\n",
    "    MATCH (n) <- [:CORR] - (e:HighLevelEvent)\n",
    "    RETURN e ORDER BY e.startTime, id(e) LIMIT 1\n",
    "}\n",
    "CALL (n, e) {\n",
    "    MERGE (n)<-[:START_CORR]-(e)\n",
    "} IN TRANSACTIONS\n",
    "RETURN count(n)\n",
    "'''\n",
    "\n",
    "q_start_hl_event = Query(\n",
    "    query_str=q_start_high_level_event_str,\n",
    "    parameters={\n",
    "        \"objectType\": object_type,\n",
    "    }\n",
    ")\n",
    "\n",
    "db_connection.exec_query(q_start_hl_event)"
   ],
   "id": "27532820645af71c",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Inferring start and end events for object type: CI_SC\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[{'count(n)': 22137}]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 14
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T14:56:28.976177800Z",
     "start_time": "2025-11-05T14:56:26.523813800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# find overlapping high-level events and create DURING relations\n",
    "# TODO FIGURE OUT!!!!!\n",
    "qFindContainedHLEvents = '''\n",
    ":auto\n",
    "    MATCH (h1:HighLevelEvent) - [df:DF] -> (h2:HighLevelEvent) - [:DF {id: df.id}] -> (h1)\n",
    "    WHERE h1 <> h2 AND h1.startTime < h2.startTime AND h2.endTime < h1.endTime\n",
    "      CALL (h1, h2) {\n",
    "        MERGE (h2)-[:DURING]->(h1)\n",
    "    } IN TRANSACTIONS\n",
    "    RETURN count(h2) AS total\n",
    "'''\n",
    "db_connection.exec_query(qFindContainedHLEvents)"
   ],
   "id": "7f98a317e18e8405",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'total': 18823}]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 3
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "# find overlapping high-level events and create DURING relations\n",
    "\n",
    "qFindContainedHLEvents = '''\n",
    ":auto\n",
    "    MATCH (h1:HighLevelEvent) - [df:DF] -> (h2:HighLevelEvent) - [df2:DF {id: df.id}] -> (h1)\n",
    "    WHERE h1 <> h2 AND h1.startTime < h2.startTime AND h2.endTime < h1.endTime\n",
    "      CALL (h1, h2) {\n",
    "        MERGE (h2)-[:DURING]->(h1)\n",
    "    } IN TRANSACTIONS\n",
    "    RETURN count(h2) AS total\n",
    "'''\n",
    "db_connection.exec_query(qFindContainedHLEvents)"
   ],
   "id": "db144066b2d4dc2a"
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e1a441da",
   "metadata": {},
   "outputs": [],
   "source": [
    "# lift DF relations from events to high-level events\n",
    "qLiftDfRelations = '''\n",
    "    :auto\n",
    "    MATCH (h1:HighLevelEvent)-[:END]->(e1:Event)-[df:DF]->(e2:Event)<-[:START]-(h2:HighLevelEvent)\n",
    "    CALL (h1, df, h2) {\n",
    "        MERGE (h1)-[df2:DF]->(h2)\n",
    "        ON CREATE SET df2 = properties(df)\n",
    "    }\n",
    "    YIELD total\n",
    "    RETURN total\n",
    "'''\n",
    "result = db_connection.exec_query(qLiftDfRelations)\n",
    "print(result)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3ab433df",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j._sync.work.result.Result object at 0x000002754A4B4DD0>\n"
     ]
    }
   ],
   "source": [
    "# lift DF relations from events to high-level events\n",
    "with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "    qLiftDfRelations = f'''\n",
    "        MATCH (h1:HighLevelEvent)-[:END]->(e1:Event)-[df:DF]->(e2:Event)<-[:START]-(h2:HighLevelEvent)\n",
    "        CALL {{\n",
    "            WITH h1,df,h2\n",
    "            MERGE (h1)-[df2:DF]->(h2) ON CREATE SET df2 = properties(df)\n",
    "        }} IN TRANSACTIONS OF 1000 ROWS\n",
    "        RETURN count(*) AS total\n",
    "    '''\n",
    "    result = session.run(qLiftDfRelations)\n",
    "    result.consume()\n",
    "    print(result.single)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c7283805",
   "metadata": {},
   "outputs": [],
   "source": [
    "# find overlapping high-level events and create DURING relations\n",
    "with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "    qFindContainedHLEvents = f'''\n",
    "        MATCH (h1:HighLevelEvent)-[c1:CORR]->(n:CI_SC)<-[c2:CORR]-(h2:HighLevelEvent) WHERE h1 <> h2\n",
    "        WHERE h1.startTime < h2.startTime AND h2.endTime < h1.endTime\n",
    "        CALL {{\n",
    "            WITH h1,h2\n",
    "            MERGE (h2)-[:DURING]->(h1)\n",
    "        }} IN TRANSACTIONS OF 1000 ROWS\n",
    "        RETURN count(*) AS total\n",
    "    '''\n",
    "    result = session.run(qFindContainedHLEvents)\n",
    "    result.consume()\n",
    "    print(result.single)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
