{
 "cells": [
  {
   "cell_type": "code",
   "id": "537085a2",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:22:30.371066600Z",
     "start_time": "2025-11-06T11:22:30.355478600Z"
    }
   },
   "source": [
    "from pathlib import Path\n",
    "\n",
    "import pandas as pd\n",
    "from promg.modules.db_management import DBManagement\n",
    "from promg import Configuration, DatabaseConnection, Performance, SemanticHeader, DatasetDescriptions, OcedPg, Query\n",
    "\n",
    "import yaml\n",
    "\n",
    "import plotly.express as px\n",
    "import plotly.subplots as sp\n",
    "import plotly.graph_objects as go"
   ],
   "outputs": [],
   "execution_count": 4
  },
  {
   "cell_type": "code",
   "id": "60b6e72b",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:22:31.218826200Z",
     "start_time": "2025-11-06T11:22:31.187318600Z"
    }
   },
   "source": [
    "case_study = 'bpic14'\n",
    "\n",
    "conf_path = Path(case_study, 'config.yaml')\n",
    "config = yaml.safe_load(open(conf_path))\n",
    "\n",
    "print(f\"These are the credentials that I expect to be set for the database.\")\n",
    "print(f\"db_name: {config['db_name']}\")\n",
    "print(f\"uri: {config['uri']}\")\n",
    "print(f\"password: {config['password']}\")\n",
    "print(\"----------------------\")\n",
    "print(f\"If you have other credentials, please change them at: {conf_path}\")\n",
    "\n",
    "config = Configuration.init_conf_with_config_file(conf_path)\n",
    "db_connection = DatabaseConnection.set_up_connection(config=config)"
   ],
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "These are the credentials that I expect to be set for the database.\n",
      "db_name: neo4j\n",
      "uri: bolt://localhost:7687\n",
      "password: bpic2014\n",
      "----------------------\n",
      "If you have other credentials, please change them at: bpic14\\config.yaml\n"
     ]
    }
   ],
   "execution_count": 5
  },
  {
   "cell_type": "code",
   "id": "ca768b4f",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:22:34.225236500Z",
     "start_time": "2025-11-06T11:22:31.976823500Z"
    }
   },
   "source": [
    "# clear previously created nodes and relations\n",
    "# start/end relations\n",
    "qClearStart = f'''MATCH (n)<-[r:START]-(e:Event) DELETE r'''\n",
    "db_connection.exec_query(qClearStart)\n",
    "qClearEnd = f'''MATCH (n)<-[r:END]-(e:Event) DELETE r'''\n",
    "db_connection.exec_query(qClearEnd)\n",
    "# high-level events\n",
    "qClearStartHLE = f'''MATCH (n)<-[r:START]-(e:HighLevelEvent) DELETE r'''\n",
    "db_connection.exec_query(qClearStartHLE)\n",
    "qClearEndHLE = f'''MATCH (n)<-[r:END]-(e:HighLevelEvent) DELETE r'''\n",
    "db_connection.exec_query(qClearEndHLE)\n",
    "qClearHighLevelEvent = f'''MATCH (h:HighLevelEvent) DETACH DELETE h'''\n",
    "db_connection.exec_query(qClearHighLevelEvent)\n",
    "qClearHL_DF = f'''MATCH (:Event)-[r:HL_DF]-(e:Event) DELETE r'''\n",
    "db_connection.exec_query(qClearHL_DF)"
   ],
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 6
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:22:35.493833500Z",
     "start_time": "2025-11-06T11:22:35.376842500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "qClearStart = '''\n",
    ":auto\n",
    "MATCH (n)<-[r:START_CORR]-(e:HighLevelEvent)\n",
    "CALL (r) {\n",
    "    DELETE r\n",
    "} IN TRANSACTIONS\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(qClearStart)\n",
    "qClearEnd = '''\n",
    ":auto\n",
    "MATCH (n)<-[r:END_CORR]-(e:HighLevelEvent)\n",
    "CALL (r) {\n",
    "    DELETE r\n",
    "} IN TRANSACTIONS\n",
    "'''\n",
    "db_connection.exec_query(qClearEnd)"
   ],
   "id": "f8c8dd93901e6ec0",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 7
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:22:36.133377700Z",
     "start_time": "2025-11-06T11:22:36.060444400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "qClearDuring = '''\n",
    ":auto\n",
    "MATCH (:HighLevelEvent)<-[r:DURING]-(:HighLevelEvent)\n",
    "CALL (r) {\n",
    "    DELETE r\n",
    "} IN TRANSACTIONS\n",
    "'''\n",
    "db_connection.exec_query(qClearDuring)"
   ],
   "id": "c13d7edd6d9f4a80",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 8
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:22:36.781688800Z",
     "start_time": "2025-11-06T11:22:36.765842100Z"
    }
   },
   "cell_type": "code",
   "source": "object_types = [\"Change\", \"Incident\", \"Interaction\"]",
   "id": "7113d1308e78b1a4",
   "outputs": [],
   "execution_count": 9
  },
  {
   "cell_type": "code",
   "id": "3ab1924a",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:22:47.607339700Z",
     "start_time": "2025-11-06T11:22:38.893748800Z"
    }
   },
   "source": [
    "# infer start and end events for each object type\n",
    "q_start_event = '''\n",
    "    // Infer start event of an object\n",
    "    MATCH (n) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "    MATCH (n)<-[c:CORR]-(e:Event) WHERE NOT ()-[:DF {id:n.sysId}]->(e)\n",
    "    MERGE (n)<-[:START]-(e)\n",
    "    RETURN count(n)\n",
    "'''\n",
    "\n",
    "q_end_event = '''\n",
    "    // Infer start event of an object\n",
    "\n",
    "    MATCH (n) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "    MATCH (n)<-[c:CORR]-(e:Event) WHERE NOT (e)-[:DF {id:n.sysId}]->()\n",
    "    MERGE (n)<-[:END]-(e)\n",
    "\n",
    "    RETURN count(n)\n",
    "    '''\n",
    "\n",
    "for object_type in object_types:\n",
    "    print(f\"Inferring start and end events for object type: {object_type}\")\n",
    "    q_start_event_result = Query(\n",
    "        query_str=q_start_event,\n",
    "        parameters={\"objectType\": object_type}\n",
    "    )\n",
    "\n",
    "    print(db_connection.exec_query(q_start_event_result))\n",
    "\n",
    "    q_end_event_result = Query(\n",
    "        query_str=q_end_event,\n",
    "        parameters={\"objectType\": object_type}\n",
    "    )\n",
    "    print(db_connection.exec_query(q_end_event_result))"
   ],
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Inferring start and end events for object type: Change\n",
      "[{'count(n)': 16611}]\n",
      "[{'count(n)': 16611}]\n",
      "Inferring start and end events for object type: Incident\n",
      "[{'count(n)': 46368}]\n",
      "[{'count(n)': 46368}]\n",
      "Inferring start and end events for object type: Interaction\n",
      "[{'count(n)': 146553}]\n",
      "[{'count(n)': 146553}]\n"
     ]
    }
   ],
   "execution_count": 10
  },
  {
   "cell_type": "code",
   "id": "57982ba2",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:23:04.760491200Z",
     "start_time": "2025-11-06T11:22:49.292348Z"
    }
   },
   "source": [
    "# materialize time between events as duration on DF edge\n",
    "q_materialize_duration_on_df = '''\n",
    "    :auto\n",
    "    MATCH (e1:Event)-[df:DF]->(e2:Event) WHERE df.duration IS NULL\n",
    "    CALL (e1, df, e2) {\n",
    "        SET df.duration = duration.inSeconds(e1.timestamp, e2.timestamp).seconds\n",
    "    } IN TRANSACTIONS\n",
    "    RETURN count(*) AS total\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(q_materialize_duration_on_df)"
   ],
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'total': 2100886}]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 11
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:23:09.776800400Z",
     "start_time": "2025-11-06T11:23:09.743568500Z"
    }
   },
   "cell_type": "code",
   "source": "split_high_level_events = True",
   "id": "62aab412eaaeaa61",
   "outputs": [],
   "execution_count": 12
  },
  {
   "cell_type": "code",
   "id": "98e4243c",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:23:11.033644300Z",
     "start_time": "2025-11-06T11:23:10.910502600Z"
    }
   },
   "source": [
    "# build index for high-level events\n",
    "qCreateIndexHLE_sys = f'''\n",
    "    CREATE INDEX highLevelEventSysIdIndex IF NOT EXISTS FOR (h:HighLevelEvent) ON (h.sysId);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_sys)\n",
    "\n",
    "qCreateIndexHLE_start = f'''\n",
    "    CREATE INDEX highLevelEventStartTimeIndex IF NOT EXISTS FOR (h:HighLevelEvent) ON (h.startTime);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_start)\n",
    "qCreateIndexHLE_end = f'''\n",
    "    CREATE INDEX highLevelEventEndTimeIndex IF NOT EXISTS FOR (h:HighLevelEvent) ON (h.endTime);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_end)\n"
   ],
   "outputs": [],
   "execution_count": 13
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "# build high-level events\n",
    "qBuildHighLevelEvent = '''\n",
    "    :auto\n",
    "    MATCH (n) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "    MATCH (eStart:Event)-[st:START]->(n)<-[en:END]-(eEnd:Event)\n",
    "    WITH DISTINCT eStart, eEnd\n",
    "    CALL (eStart, eEnd) {\n",
    "        MERGE (h:HighLevelEvent {sysId: \"HLE_\" + eStart.sysId + \"_\" + eEnd.sysId})\n",
    "        ON CREATE SET h.startTime=eStart.timestamp, h.endTime=eEnd.timestamp, h.activity=$objectType\n",
    "        MERGE (h)-[:START]->(eStart)\n",
    "        MERGE (h)-[:END]->(eEnd)\n",
    "        RETURN h\n",
    "    } IN TRANSACTIONS\n",
    "    RETURN count(h)\n",
    "'''"
   ],
   "id": "8c1262f5e6ad6e6f"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:23:28.058345Z",
     "start_time": "2025-11-06T11:23:12.210203300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "for object_type in object_types:\n",
    "    query = Query(\n",
    "        query_str=qBuildHighLevelEvent,\n",
    "        parameters={\n",
    "            \"objectType\": object_type,\n",
    "        }\n",
    "    )\n",
    "\n",
    "    result = db_connection.exec_query(query)\n",
    "    print(f\"{result[0]['count(h)']} high level events for {object_type}\")"
   ],
   "id": "6986d35a4303d9d7",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "33217 high level events for Change\n",
      "92736 high level events for Incident\n",
      "293106 high level events for Interaction\n"
     ]
    }
   ],
   "execution_count": 14
  },
  {
   "cell_type": "code",
   "id": "fd4364e7",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T11:25:02.452143700Z",
     "start_time": "2025-11-06T11:25:00.169458900Z"
    }
   },
   "source": [
    "# lift CORR to high-level events\n",
    "qLiftCorrToHL = '''\n",
    "    :auto\n",
    "    MATCH (h:HighLevelEvent)-[:START|END]->(:Event)-[:CORR]->(n)\n",
    "    WITH distinct h, n\n",
    "    CALL (h, n) {\n",
    "        MERGE(h) - [:CORR]->(n)\n",
    "    } IN TRANSACTIONS\n",
    "'''\n",
    "db_connection.exec_query(qLiftCorrToHL)"
   ],
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 16
  },
  {
   "cell_type": "code",
   "id": "d9d5e7e1",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T09:39:44.181133200Z",
     "start_time": "2025-11-06T09:39:44.168967Z"
    }
   },
   "source": [
    "# build DF relations between high-level events\n",
    "# step 1: build HL-DF relations between events\n",
    "\n",
    "qBuildDfRelationsHLE = '''\n",
    "    :auto\n",
    "    // get only START/END events of each HL event correlated to CI_SC\n",
    "    MATCH (ot:ObjectType {objectType: $objectType}) <- [:IS_OF_TYPE] - (o) <-[:CORR]-(h:HighLevelEvent)-->(e:Event)\n",
    "    // order by time\n",
    "    WHERE e.timestamp IS NOT NULL\n",
    "    WITH o, e ORDER BY e.timestamp, ID(e)\n",
    "    WITH o, collect(e) AS events\n",
    "    UNWIND range(0, size(events)-2) AS idx\n",
    "    WITH events[idx] AS fromEv, events[idx+1] AS toEv, o\n",
    "    CALL (fromEv,toEv,o) {\n",
    "        // get their HL events correlated to the same object\n",
    "        MATCH (fromEv)<--(h1:HighLevelEvent)-[:CORR]->(o)<-[:CORR]-(h2:HighLevelEvent)-->(toEv)\n",
    "        WHERE h1 <> h2\n",
    "        // and add their DF relation\n",
    "        MERGE (h1)-[rel:DF {objectType:$objectType, id:o.sysId}]->(h2)\n",
    "        RETURN rel\n",
    "    } IN TRANSACTIONS\n",
    "    RETURN count(rel) AS total\n",
    "'''"
   ],
   "outputs": [],
   "execution_count": 12
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T10:58:01.224553800Z",
     "start_time": "2025-11-06T10:50:58.866546300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "for object_type in object_types + [\"CI_SC\"]:\n",
    "    query = Query(\n",
    "        query_str=qBuildDfRelationsHLE,\n",
    "        parameters={\n",
    "            \"objectType\": object_type,\n",
    "        }\n",
    "    )\n",
    "\n",
    "    print(f\"DF for {object_type}: {db_connection.exec_query(query)}\")"
   ],
   "id": "1b20613c5218d711",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "DF for Change: [{'total': 16611}]\n",
      "DF for Incident: [{'total': 46368}]\n",
      "DF for Interaction: [{'total': 146553}]\n"
     ]
    }
   ],
   "execution_count": null
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T09:40:01.357324Z",
     "start_time": "2025-11-06T09:40:00.625387400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# infer start and end events for each object type\n",
    "\n",
    "object_type = \"CI_SC\"\n",
    "print(f\"Inferring start and end events for object type: {object_type}\")\n",
    "\n",
    "q_start_high_level_event_str = '''\n",
    ":auto\n",
    "// Infer start event of an object\n",
    "MATCH (ot:ObjectType {objectType: $objectType}) <- [:IS_OF_TYPE] - (n)\n",
    "CALL (n) {\n",
    "    MATCH (n) <- [:CORR] - (e:HighLevelEvent)\n",
    "    RETURN e ORDER BY e.startTime, id(e) LIMIT 1\n",
    "}\n",
    "CALL (n, e) {\n",
    "    MERGE (n)<-[:START_CORR]-(e)\n",
    "} IN TRANSACTIONS\n",
    "RETURN count(n)\n",
    "'''\n",
    "\n",
    "q_start_hl_event = Query(\n",
    "    query_str=q_start_high_level_event_str,\n",
    "    parameters={\n",
    "        \"objectType\": object_type,\n",
    "    }\n",
    ")\n",
    "\n",
    "db_connection.exec_query(q_start_hl_event)"
   ],
   "id": "27532820645af71c",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Inferring start and end events for object type: CI_SC\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[{'count(n)': 22137}]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 14
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T14:56:28.976177800Z",
     "start_time": "2025-11-05T14:56:26.523813800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# find overlapping high-level events and create DURING relations\n",
    "# TODO FIGURE OUT!!!!!\n",
    "qFindContainedHLEvents = '''\n",
    ":auto\n",
    "    MATCH (h1:HighLevelEvent) - [df:DF] -> (h2:HighLevelEvent) - [:DF {id: df.id}] -> (h1)\n",
    "    WHERE h1 <> h2 AND h1.startTime < h2.startTime AND h2.endTime < h1.endTime\n",
    "      CALL (h1, h2) {\n",
    "        MERGE (h2)-[:DURING]->(h1)\n",
    "    } IN TRANSACTIONS\n",
    "    RETURN count(h2) AS total\n",
    "'''\n",
    "db_connection.exec_query(qFindContainedHLEvents)"
   ],
   "id": "7f98a317e18e8405",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'total': 18823}]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 3
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "# find overlapping high-level events and create DURING relations\n",
    "\n",
    "qFindContainedHLEvents = '''\n",
    ":auto\n",
    "    MATCH (h1:HighLevelEvent) - [df:DF] -> (h2:HighLevelEvent) - [df2:DF {id: df.id}] -> (h1)\n",
    "    WHERE h1 <> h2 AND h1.startTime < h2.startTime AND h2.endTime < h1.endTime\n",
    "      CALL (h1, h2) {\n",
    "        MERGE (h2)-[:DURING]->(h1)\n",
    "    } IN TRANSACTIONS\n",
    "    RETURN count(h2) AS total\n",
    "'''\n",
    "db_connection.exec_query(qFindContainedHLEvents)"
   ],
   "id": "db144066b2d4dc2a"
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e1a441da",
   "metadata": {},
   "outputs": [],
   "source": [
    "# lift DF relations from events to high-level events\n",
    "qLiftDfRelations = '''\n",
    "    :auto\n",
    "    MATCH (h1:HighLevelEvent)-[:END]->(e1:Event)-[df:DF]->(e2:Event)<-[:START]-(h2:HighLevelEvent)\n",
    "    CALL (h1, df, h2) {\n",
    "        MERGE (h1)-[df2:DF]->(h2)\n",
    "        ON CREATE SET df2 = properties(df)\n",
    "    }\n",
    "    YIELD total\n",
    "    RETURN total\n",
    "'''\n",
    "result = db_connection.exec_query(qLiftDfRelations)\n",
    "print(result)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3ab433df",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j._sync.work.result.Result object at 0x000002754A4B4DD0>\n"
     ]
    }
   ],
   "source": [
    "# lift DF relations from events to high-level events\n",
    "with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "    qLiftDfRelations = f'''\n",
    "        MATCH (h1:HighLevelEvent)-[:END]->(e1:Event)-[df:DF]->(e2:Event)<-[:START]-(h2:HighLevelEvent)\n",
    "        CALL {{\n",
    "            WITH h1,df,h2\n",
    "            MERGE (h1)-[df2:DF]->(h2) ON CREATE SET df2 = properties(df)\n",
    "        }} IN TRANSACTIONS OF 1000 ROWS\n",
    "        RETURN count(*) AS total\n",
    "    '''\n",
    "    result = session.run(qLiftDfRelations)\n",
    "    result.consume()\n",
    "    print(result.single)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c7283805",
   "metadata": {},
   "outputs": [],
   "source": [
    "# find overlapping high-level events and create DURING relations\n",
    "with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "    qFindContainedHLEvents = f'''\n",
    "        MATCH (h1:HighLevelEvent)-[c1:CORR]->(n:CI_SC)<-[c2:CORR]-(h2:HighLevelEvent) WHERE h1 <> h2\n",
    "        WHERE h1.startTime < h2.startTime AND h2.endTime < h1.endTime\n",
    "        CALL {{\n",
    "            WITH h1,h2\n",
    "            MERGE (h2)-[:DURING]->(h1)\n",
    "        }} IN TRANSACTIONS OF 1000 ROWS\n",
    "        RETURN count(*) AS total\n",
    "    '''\n",
    "    result = session.run(qFindContainedHLEvents)\n",
    "    result.consume()\n",
    "    print(result.single)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
