{
 "cells": [
  {
   "cell_type": "code",
   "id": "initial_id",
   "metadata": {
    "collapsed": true,
    "ExecuteTime": {
     "end_time": "2025-10-29T17:46:02.802134200Z",
     "start_time": "2025-10-29T17:46:02.793877500Z"
    }
   },
   "source": [
    "import matplotlib.pyplot as plt\n",
    "\n",
    "from pathlib import Path\n",
    "\n",
    "from promg.modules.db_management import DBManagement\n",
    "from tabulate import tabulate\n",
    "import yaml\n",
    "\n",
    "from promg import Configuration, DatabaseConnection, Performance, SemanticHeader, DatasetDescriptions, OcedPg, Query\n",
    "\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "\n",
    "pd.set_option('display.width', 2000)\n"
   ],
   "outputs": [],
   "execution_count": 3
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-10-29T17:46:03.317336900Z",
     "start_time": "2025-10-29T17:46:03.305844100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "case_study = 'bpic14'\n",
    "load = False\n"
   ],
   "id": "45443dbb144f4f8e",
   "outputs": [],
   "execution_count": 4
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-10-29T17:46:03.940521Z",
     "start_time": "2025-10-29T17:46:03.918185200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "conf_path = Path(case_study, 'config.yaml')\n",
    "config = yaml.safe_load(open(conf_path))\n",
    "\n",
    "print(f\"These are the credentials that I expect to be set for the database.\")\n",
    "print(f\"db_name: {config['db_name']}\")\n",
    "print(f\"uri: {config['uri']}\")\n",
    "print(f\"password: {config['password']}\")\n",
    "print(\"----------------------\")\n",
    "print(f\"If you have other credentials, please change them at: {conf_path}\")"
   ],
   "id": "6c94ce499db57618",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "These are the credentials that I expect to be set for the database.\n",
      "db_name: neo4j\n",
      "uri: bolt://localhost:7687\n",
      "password: bpic2014\n",
      "----------------------\n",
      "If you have other credentials, please change them at: bpic14\\config.yaml\n"
     ]
    }
   ],
   "execution_count": 5
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-10-29T17:46:04.516866400Z",
     "start_time": "2025-10-29T17:46:04.505036600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "config = Configuration.init_conf_with_config_file(conf_path)\n",
    "db_connection = DatabaseConnection.set_up_connection(config=config)"
   ],
   "id": "619eb3225e46e0fb",
   "outputs": [],
   "execution_count": 6
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-10-29T17:46:05.564223500Z",
     "start_time": "2025-10-29T17:46:05.558218Z"
    }
   },
   "cell_type": "code",
   "source": [
    "if load:\n",
    "    # Import the original modeled data\n",
    "    %run./ 0_analysis_and_model.ipynb"
   ],
   "id": "b610a564ec0436ff",
   "outputs": [],
   "execution_count": 7
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# Check Objects without Any Events",
   "id": "661417e4869b8bd0"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-10-29T17:47:48.346729600Z",
     "start_time": "2025-10-29T17:47:47.858756600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "    MATCH (i) - [:IS_OF_TYPE] -> (ot:ObjectType)\n",
    "    WHERE not 'KnowledgeDocument' in labels(i)\n",
    "    RETURN EXISTS((i) <- [] - (:Event)) as has_events, labels(i)[0] as _label, count(i) as cnt order by _label, has_events\n",
    "'''\n",
    "\n",
    "df_result = pd.DataFrame(db_connection.exec_query(query))\n",
    "\n",
    "table = pd.pivot_table(df_result, index=['_label', 'has_events'], aggfunc=\"sum\")\n",
    "table['%'] = (round(table.cnt / table.groupby(level=0).cnt.transform(\"sum\") * 100, 2)).astype(str) + '%'\n",
    "table"
   ],
   "id": "d9357643e09f61e6",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                                 cnt       %\n",
       "_label            has_events                \n",
       "CI_SC             False         1353   8.81%\n",
       "                  True         14003  91.19%\n",
       "Change            False          682   3.79%\n",
       "                  True         17318  96.21%\n",
       "ConfigurationItem False        15134  100.0%\n",
       "Incident          False          238   0.51%\n",
       "                  True         46368  99.49%\n",
       "Interaction       False          451   0.31%\n",
       "                  True        146553  99.69%\n",
       "Resource          False            2   0.83%\n",
       "                  True           240  99.17%\n",
       "ServiceComponent  False          340  100.0%"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th>cnt</th>\n",
       "      <th>%</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>_label</th>\n",
       "      <th>has_events</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">CI_SC</th>\n",
       "      <th>False</th>\n",
       "      <td>1353</td>\n",
       "      <td>8.81%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>True</th>\n",
       "      <td>14003</td>\n",
       "      <td>91.19%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">Change</th>\n",
       "      <th>False</th>\n",
       "      <td>682</td>\n",
       "      <td>3.79%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>True</th>\n",
       "      <td>17318</td>\n",
       "      <td>96.21%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>ConfigurationItem</th>\n",
       "      <th>False</th>\n",
       "      <td>15134</td>\n",
       "      <td>100.0%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">Incident</th>\n",
       "      <th>False</th>\n",
       "      <td>238</td>\n",
       "      <td>0.51%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>True</th>\n",
       "      <td>46368</td>\n",
       "      <td>99.49%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">Interaction</th>\n",
       "      <th>False</th>\n",
       "      <td>451</td>\n",
       "      <td>0.31%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>True</th>\n",
       "      <td>146553</td>\n",
       "      <td>99.69%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">Resource</th>\n",
       "      <th>False</th>\n",
       "      <td>2</td>\n",
       "      <td>0.83%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>True</th>\n",
       "      <td>240</td>\n",
       "      <td>99.17%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>ServiceComponent</th>\n",
       "      <th>False</th>\n",
       "      <td>340</td>\n",
       "      <td>100.0%</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 11
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "The found numbers for 'Incident', 'Interaction', 'Change' correspond to the objects that have events deleted before the cutoff.",
   "id": "fa15e2c57fdd6333"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-10-29T17:58:43.766046300Z",
     "start_time": "2025-10-29T17:58:43.108774800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "\n",
    "labels = ['Incident', 'Interaction', 'Change']\n",
    "\n",
    "query = '''\n",
    "    MATCH (o) - [:IS_OF_TYPE] -> (ot:ObjectType)\n",
    "    WHERE ot.objectType in $labels AND NOT EXISTS((o) <- [] - (:Event))\n",
    "    DETACH DELETE o\n",
    "'''\n",
    "query = Query(query_str=query,\n",
    "              parameters={'labels': labels})\n",
    "\n",
    "pd.DataFrame(db_connection.exec_query(query))\n"
   ],
   "id": "f8cee83e61e4128a",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 24
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-10-29T17:58:53.813961400Z",
     "start_time": "2025-10-29T17:58:53.472680100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "    MATCH (i) - [:IS_OF_TYPE] -> (ot:ObjectType)\n",
    "    WHERE not 'KnowledgeDocument' in labels(i)\n",
    "    RETURN EXISTS((i) <- [] - (:Event)) as has_events, labels(i)[0] as _label, count(i) as cnt order by _label, has_events\n",
    "'''\n",
    "\n",
    "df_result = pd.DataFrame(db_connection.exec_query(query))\n",
    "\n",
    "table = pd.pivot_table(df_result, index=['_label', 'has_events'], aggfunc=\"sum\")\n",
    "table['%'] = (round(table.cnt / table.groupby(level=0).cnt.transform(\"sum\") * 100, 2)).astype(str) + '%'\n",
    "table"
   ],
   "id": "6ec7b59167da0985",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                                 cnt       %\n",
       "_label            has_events                \n",
       "CI_SC             False         1353   8.81%\n",
       "                  True         14003  91.19%\n",
       "Change            True         17318  100.0%\n",
       "ConfigurationItem False        15134  100.0%\n",
       "Incident          True         46368  100.0%\n",
       "Interaction       True        146553  100.0%\n",
       "Resource          False            2   0.83%\n",
       "                  True           240  99.17%\n",
       "ServiceComponent  False          340  100.0%"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th>cnt</th>\n",
       "      <th>%</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>_label</th>\n",
       "      <th>has_events</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">CI_SC</th>\n",
       "      <th>False</th>\n",
       "      <td>1353</td>\n",
       "      <td>8.81%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>True</th>\n",
       "      <td>14003</td>\n",
       "      <td>91.19%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Change</th>\n",
       "      <th>True</th>\n",
       "      <td>17318</td>\n",
       "      <td>100.0%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>ConfigurationItem</th>\n",
       "      <th>False</th>\n",
       "      <td>15134</td>\n",
       "      <td>100.0%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Incident</th>\n",
       "      <th>True</th>\n",
       "      <td>46368</td>\n",
       "      <td>100.0%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Interaction</th>\n",
       "      <th>True</th>\n",
       "      <td>146553</td>\n",
       "      <td>100.0%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">Resource</th>\n",
       "      <th>False</th>\n",
       "      <td>2</td>\n",
       "      <td>0.83%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>True</th>\n",
       "      <td>240</td>\n",
       "      <td>99.17%</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>ServiceComponent</th>\n",
       "      <th>False</th>\n",
       "      <td>340</td>\n",
       "      <td>100.0%</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 25
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "After deleting these objects, we might now have CI_SC that have no other object referring to them.",
   "id": "8ec0d6606ca40dd"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-10-29T18:01:43.922085300Z",
     "start_time": "2025-10-29T18:01:41.696160300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''MATCH (ci_sc:CI_SC)\n",
    "RETURN EXISTS((ci_sc) <- [] - (:Event)) as has_events, EXISTS ((ci_sc) -- (:Incident|Change|Interaction)), count(ci_sc)'''\n",
    "\n",
    "pd.DataFrame(db_connection.exec_query(query))"
   ],
   "id": "f4f7ee8db7e941fb",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   has_events  EXISTS ((ci_sc) -- (:Incident|Change|Interaction))  count(ci_sc)\n",
       "0        True                                               True          14003\n",
       "1       False                                              False            323\n",
       "2       False                                               True           1030"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>has_events</th>\n",
       "      <th>EXISTS ((ci_sc) -- (:Incident|Change|Interaction))</th>\n",
       "      <th>count(ci_sc)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>14003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>323</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>1030</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 27
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "## Explore some examples",
   "id": "734d76144f7df28c"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-10-29T17:47:52.257877500Z",
     "start_time": "2025-10-29T17:47:51.257017200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "\n",
    "    MATCH (i) - [:IS_OF_TYPE] -> (ot:ObjectType)\n",
    "    WHERE not 'KnowledgeDocument' in labels(i) AND NOT EXISTS((i) <- [] - (:Event))\n",
    "    RETURN labels(i)[0] as _label, i.sysId ORDER BY i.sysId\n",
    "'''\n",
    "\n",
    "df_result = pd.DataFrame(db_connection.exec_query(query))\n",
    "df_result"
   ],
   "id": "2e44200b913d3ba9",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                  _label            i.sysId\n",
       "0      ConfigurationItem               #N/B\n",
       "1      ConfigurationItem          ACS000001\n",
       "2      ConfigurationItem          ADB000001\n",
       "3      ConfigurationItem          ADB000002\n",
       "4      ConfigurationItem          ADB000003\n",
       "...                  ...                ...\n",
       "18195  ConfigurationItem          ZOS000030\n",
       "18196  ConfigurationItem          ZOS000031\n",
       "18197  ConfigurationItem          ZOS000032\n",
       "18198  ConfigurationItem          ZOS000033\n",
       "18199              CI_SC  ci_null_WBS000284\n",
       "\n",
       "[18200 rows x 2 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>_label</th>\n",
       "      <th>i.sysId</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>ConfigurationItem</td>\n",
       "      <td>#N/B</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ConfigurationItem</td>\n",
       "      <td>ACS000001</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ConfigurationItem</td>\n",
       "      <td>ADB000001</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ConfigurationItem</td>\n",
       "      <td>ADB000002</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ConfigurationItem</td>\n",
       "      <td>ADB000003</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18195</th>\n",
       "      <td>ConfigurationItem</td>\n",
       "      <td>ZOS000030</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18196</th>\n",
       "      <td>ConfigurationItem</td>\n",
       "      <td>ZOS000031</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18197</th>\n",
       "      <td>ConfigurationItem</td>\n",
       "      <td>ZOS000032</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18198</th>\n",
       "      <td>ConfigurationItem</td>\n",
       "      <td>ZOS000033</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18199</th>\n",
       "      <td>CI_SC</td>\n",
       "      <td>ci_null_WBS000284</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>18200 rows × 2 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 12
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-10-29T17:48:42.490399Z",
     "start_time": "2025-10-29T17:48:09.727518700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "    MATCH (i:CI_SC)\n",
    "    OPTIONAL MATCH (i) <- [] - (e:Event)\n",
    "    RETURN labels(e)[0] as eventSources, i.sysId as id, EXISTS ((:Incident) - [:CAUSED_BY_CI_SC] -> (i)) as caused_by_incident, EXISTS ((:Incident) - [:AFFECTED_CI_SC] -> (i)) as affected_incident\n",
    "'''\n",
    "\n",
    "result = pd.DataFrame(db_connection.exec_query(query))\n"
   ],
   "id": "750f1974bc086ce6",
   "outputs": [],
   "execution_count": 13
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-10-29T17:48:53.589670700Z",
     "start_time": "2025-10-29T17:48:53.434479100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "table = pd.pivot_table(result, index=['eventSources'],\n",
    "                       aggfunc={\"id\": \"count\", \"affected_incident\": \"sum\", \"caused_by_incident\": \"sum\"}, dropna=False)\n",
    "table"
   ],
   "id": "4058430855f97348",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                       affected_incident  caused_by_incident      id\n",
       "eventSources                                                        \n",
       "ChangeEvent                        18539               21959  109267\n",
       "IncidentActivityEvent             458676              451386  458676\n",
       "IncidentEvent                     137336              135230  137336\n",
       "InteractionEvent                  288144              286252  293106\n",
       "NaN                                    3                1032    1353"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>affected_incident</th>\n",
       "      <th>caused_by_incident</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>eventSources</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>ChangeEvent</th>\n",
       "      <td>18539</td>\n",
       "      <td>21959</td>\n",
       "      <td>109267</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>IncidentActivityEvent</th>\n",
       "      <td>458676</td>\n",
       "      <td>451386</td>\n",
       "      <td>458676</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>IncidentEvent</th>\n",
       "      <td>137336</td>\n",
       "      <td>135230</td>\n",
       "      <td>137336</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>InteractionEvent</th>\n",
       "      <td>288144</td>\n",
       "      <td>286252</td>\n",
       "      <td>293106</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>NaN</th>\n",
       "      <td>3</td>\n",
       "      <td>1032</td>\n",
       "      <td>1353</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 14
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# Let's Explore some CI_SC that have no events and no affected nor caused_by incident",
   "id": "86897816efdb8733"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-10-29T17:50:04.883421800Z",
     "start_time": "2025-10-29T17:50:02.679506600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "    MATCH (i:CI_SC)\n",
    "    WHERE NOT (EXISTS((i) <- [] - (:Event)) OR EXISTS((i) <- [] - (:Incident)))\n",
    "    RETURN i.sysId\n",
    "'''\n",
    "\n",
    "pd.DataFrame(db_connection.exec_query(query))\n"
   ],
   "id": "9f830682303c876c",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                 i.sysId\n",
       "0    OVR000012_WBS000256\n",
       "1    SBA000755_WBS000313\n",
       "2    SBA000754_WBS000313\n",
       "3    SBA000756_WBS000312\n",
       "4    HMD000040_WBS000196\n",
       "..                   ...\n",
       "314  LAP000744_WBS000091\n",
       "315  SBA000788_WBS000285\n",
       "316  LAP000520_WBS000091\n",
       "317  PRN000044_WBS000096\n",
       "318  SSW000280_WBS000102\n",
       "\n",
       "[319 rows x 1 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>i.sysId</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>OVR000012_WBS000256</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>SBA000755_WBS000313</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>SBA000754_WBS000313</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>SBA000756_WBS000312</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>HMD000040_WBS000196</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>314</th>\n",
       "      <td>LAP000744_WBS000091</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>315</th>\n",
       "      <td>SBA000788_WBS000285</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>316</th>\n",
       "      <td>LAP000520_WBS000091</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>317</th>\n",
       "      <td>PRN000044_WBS000096</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>318</th>\n",
       "      <td>SSW000280_WBS000102</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>319 rows × 1 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 15
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "After exploring, it comes clear that these CI_SC are extracted from the Detail_Change.csv",
   "id": "2b480b50f0634a30"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-10-29T17:50:11.920481400Z",
     "start_time": "2025-10-29T17:50:11.758320100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "    MATCH (i:CI_SC) - [:EXTRACTED_FROM] - (r:Record) <- [:CONTAINS] - (l:Log)\n",
    "    WHERE NOT (EXISTS((i) <- [] - (:Event)) OR EXISTS((i) <- [] - (:Incident)))\n",
    "    RETURN l.name, count(i)\n",
    "'''\n",
    "\n",
    "pd.DataFrame(db_connection.exec_query(query))\n"
   ],
   "id": "24b8ffed58014578",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                  l.name  count(i)\n",
       "0      Detail_Change.csv       331\n",
       "1  BPIC14Interaction.csv        12"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>l.name</th>\n",
       "      <th>count(i)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Detail_Change.csv</td>\n",
       "      <td>331</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>BPIC14Interaction.csv</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 16
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "In Changes, the mentioned CI_SC are only the CI_SC they have affected. Let's explore the timestamps of these records.",
   "id": "13d5bb1ab60eb5ef"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-10-29T17:51:18.154889Z",
     "start_time": "2025-10-29T17:51:18.061600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "    MATCH (i:CI_SC) - [:EXTRACTED_FROM] - (r:Record) <- [:CONTAINS] - (l:Log {name:'Detail_Change.csv'})\n",
    "    WHERE NOT (EXISTS((i) <- [] - (:Event)) OR EXISTS((i) <- [] - (:Incident)))\n",
    "    RETURN\n",
    "\n",
    "        count(r) as count,\n",
    "        reduce(result = \"\", item in split(r.changeType, \" \")[0..2] | result + \" \" + item) as changeType,\n",
    "        r.changeRecordOpenTime is NOT NULL as record_open,\n",
    "        r.changeRecordCloseTime IS NOT NULL as record_close,\n",
    "        r.plannedStart IS NOT NULL as planned_start,\n",
    "        r.plannedEnd IS NOT NULL as planned_end,\n",
    "        r.actualStart IS NOT NULL as actual_start,\n",
    "        r.actualEnd IS NOT NULL as actual_end ORDER BY count DESC\n",
    "'''\n",
    "\n",
    "pd.DataFrame(db_connection.exec_query(query))\n"
   ],
   "id": "e4b3bd272dc3c43b",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   count          changeType  record_open  record_close  planned_start  planned_end  actual_start  actual_end\n",
       "0    106   Standard Activity         True          True           True         True         False       False\n",
       "1     92     Standard Change         True          True           True         True          True        True\n",
       "2     68   Standard Activity         True          True           True         True          True        True\n",
       "3     33     Standard Change         True          True           True         True         False       False\n",
       "4     21        Release Type         True          True           True         True          True        True\n",
       "5      8        Release Type         True          True           True         True         False       False\n",
       "6      3       Master Change         True          True           True         True         False       False"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count</th>\n",
       "      <th>changeType</th>\n",
       "      <th>record_open</th>\n",
       "      <th>record_close</th>\n",
       "      <th>planned_start</th>\n",
       "      <th>planned_end</th>\n",
       "      <th>actual_start</th>\n",
       "      <th>actual_end</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>106</td>\n",
       "      <td>Standard Activity</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>92</td>\n",
       "      <td>Standard Change</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>68</td>\n",
       "      <td>Standard Activity</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>33</td>\n",
       "      <td>Standard Change</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>21</td>\n",
       "      <td>Release Type</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>8</td>\n",
       "      <td>Release Type</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>3</td>\n",
       "      <td>Master Change</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 21
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-10-29T11:44:01.865835700Z",
     "start_time": "2025-10-29T11:43:59.585598600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "    MATCH (r:Record) <- [:CONTAINS] - (l:Log {name:'Detail_Change.csv'})\n",
    "    WHERE r.changeRecordOpenTime IS NOT NULL\n",
    "    RETURN r.actualStart >= r.changeRecordOpenTime as change_after_record, count(DISTINCT r.changeId), avg(duration.inSeconds(r.actualStart, r.changeRecordOpenTime).minutes) as avg_duration\n",
    "'''\n",
    "\n",
    "pd.DataFrame(db_connection.exec_query(query))\n"
   ],
   "id": "5e1c3615cdb1030b",
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01G11', status_description='warn: null value eliminated in set function', position=None, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: \"\\n    MATCH (r:Record) <- [:CONTAINS] - (l:Log {name:'Detail_Change.csv'})\\n    WHERE r.changeRecordOpenTime IS NOT NULL\\n    RETURN r.actualStart >= r.changeRecordOpenTime as change_after_record, count(DISTINCT r.changeId), avg(duration.inSeconds(r.actualStart, r.changeRecordOpenTime).minutes) as avg_duration\\n\"\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "  change_after_record  count(DISTINCT r.changeId)  avg_duration\n",
       "0                True                       15984 -21034.136737\n",
       "1                None                        1310           NaN\n",
       "2               False                         708   8547.720102"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>change_after_record</th>\n",
       "      <th>count(DISTINCT r.changeId)</th>\n",
       "      <th>avg_duration</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>True</td>\n",
       "      <td>15984</td>\n",
       "      <td>-21034.136737</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>None</td>\n",
       "      <td>1310</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>False</td>\n",
       "      <td>708</td>\n",
       "      <td>8547.720102</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 76,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 76
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-10-29T11:45:49.217204100Z",
     "start_time": "2025-10-29T11:45:49.070325900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "    MATCH (r:Record) <- [:CONTAINS] - (l:Log {name:'Detail_Change.csv'})\n",
    "    WHERE r.changeRecordOpenTime IS NOT NULL AND r.actualStart < r.changeRecordOpenTime\n",
    "    RETURN DISTINCT r.changeId, r.actualStart as actual, r.changeRecordOpenTime as record_open, duration.inSeconds(r.actualStart, r.changeRecordOpenTime).minutes as diff ORDER BY diff DESC limit 100\n",
    "'''\n",
    "\n",
    "pd.DataFrame(db_connection.exec_query(query))\n"
   ],
   "id": "8833491c2518036f",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   r.changeId                               actual                          record_open    diff\n",
       "0   C00011089  2013-01-13T00:00:00.000000000+01:00  2014-01-13T09:42:00.000000000+01:00  526182\n",
       "1   C00008371  2012-12-05T08:00:00.000000000+01:00  2013-12-05T08:40:00.000000000+01:00  525640\n",
       "2   C00010471  2013-01-07T07:00:00.000000000+01:00  2014-01-06T13:30:00.000000000+01:00  524550\n",
       "3   C00010470  2013-01-07T07:45:00.000000000+01:00  2014-01-06T13:29:00.000000000+01:00  524504\n",
       "4   C00006938  2012-11-27T08:00:00.000000000+01:00  2013-11-21T09:20:00.000000000+01:00  517040\n",
       "..        ...                                  ...                                  ...     ...\n",
       "95  C00008073  2013-12-02T00:00:00.000000000+01:00  2013-12-03T10:57:00.000000000+01:00    2097\n",
       "96  C00015876  2014-02-26T08:00:00.000000000+01:00  2014-02-27T18:11:00.000000000+01:00    2051\n",
       "97  C00006948  2013-11-19T09:00:00.000000000+01:00  2013-11-20T18:30:00.000000000+01:00    2010\n",
       "98  C00011955  2014-01-20T00:00:00.000000000+01:00  2014-01-21T08:56:00.000000000+01:00    1976\n",
       "99  C00000671  2013-07-30T00:00:00.000000000+01:00  2013-07-31T08:10:00.000000000+01:00    1930\n",
       "\n",
       "[100 rows x 4 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>r.changeId</th>\n",
       "      <th>actual</th>\n",
       "      <th>record_open</th>\n",
       "      <th>diff</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>C00011089</td>\n",
       "      <td>2013-01-13T00:00:00.000000000+01:00</td>\n",
       "      <td>2014-01-13T09:42:00.000000000+01:00</td>\n",
       "      <td>526182</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>C00008371</td>\n",
       "      <td>2012-12-05T08:00:00.000000000+01:00</td>\n",
       "      <td>2013-12-05T08:40:00.000000000+01:00</td>\n",
       "      <td>525640</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>C00010471</td>\n",
       "      <td>2013-01-07T07:00:00.000000000+01:00</td>\n",
       "      <td>2014-01-06T13:30:00.000000000+01:00</td>\n",
       "      <td>524550</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>C00010470</td>\n",
       "      <td>2013-01-07T07:45:00.000000000+01:00</td>\n",
       "      <td>2014-01-06T13:29:00.000000000+01:00</td>\n",
       "      <td>524504</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>C00006938</td>\n",
       "      <td>2012-11-27T08:00:00.000000000+01:00</td>\n",
       "      <td>2013-11-21T09:20:00.000000000+01:00</td>\n",
       "      <td>517040</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95</th>\n",
       "      <td>C00008073</td>\n",
       "      <td>2013-12-02T00:00:00.000000000+01:00</td>\n",
       "      <td>2013-12-03T10:57:00.000000000+01:00</td>\n",
       "      <td>2097</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96</th>\n",
       "      <td>C00015876</td>\n",
       "      <td>2014-02-26T08:00:00.000000000+01:00</td>\n",
       "      <td>2014-02-27T18:11:00.000000000+01:00</td>\n",
       "      <td>2051</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97</th>\n",
       "      <td>C00006948</td>\n",
       "      <td>2013-11-19T09:00:00.000000000+01:00</td>\n",
       "      <td>2013-11-20T18:30:00.000000000+01:00</td>\n",
       "      <td>2010</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>98</th>\n",
       "      <td>C00011955</td>\n",
       "      <td>2014-01-20T00:00:00.000000000+01:00</td>\n",
       "      <td>2014-01-21T08:56:00.000000000+01:00</td>\n",
       "      <td>1976</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99</th>\n",
       "      <td>C00000671</td>\n",
       "      <td>2013-07-30T00:00:00.000000000+01:00</td>\n",
       "      <td>2013-07-31T08:10:00.000000000+01:00</td>\n",
       "      <td>1930</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>100 rows × 4 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 77,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 77
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
