{
 "cells": [
  {
   "cell_type": "code",
   "id": "initial_id",
   "metadata": {
    "collapsed": true,
    "ExecuteTime": {
     "end_time": "2025-11-05T16:41:55.324798Z",
     "start_time": "2025-11-05T16:41:54.820330100Z"
    }
   },
   "source": [
    "import matplotlib.pyplot as plt\n",
    "\n",
    "from pathlib import Path\n",
    "\n",
    "from promg.modules.db_management import DBManagement\n",
    "from tabulate import tabulate\n",
    "import yaml\n",
    "\n",
    "from promg import Configuration, DatabaseConnection, Performance, SemanticHeader, DatasetDescriptions, OcedPg, Query\n",
    "\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "import seaborn as sns\n",
    "\n",
    "pd.set_option('display.width', 2000)\n",
    "%matplotlib inline\n"
   ],
   "outputs": [],
   "execution_count": 5
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T16:41:56.599975600Z",
     "start_time": "2025-11-05T16:41:56.583068700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "case_study = 'bpic14'\n",
    "load = False\n"
   ],
   "id": "bd35fb9794da9b64",
   "outputs": [],
   "execution_count": 6
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T16:41:56.869856Z",
     "start_time": "2025-11-05T16:41:56.844708100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "conf_path = Path(case_study, 'config.yaml')\n",
    "config = yaml.safe_load(open(conf_path))\n",
    "\n",
    "print(f\"These are the credentials that I expect to be set for the database.\")\n",
    "print(f\"db_name: {config['db_name']}\")\n",
    "print(f\"uri: {config['uri']}\")\n",
    "print(f\"password: {config['password']}\")\n",
    "print(\"----------------------\")\n",
    "print(f\"If you have other credentials, please change them at: {conf_path}\")"
   ],
   "id": "cd60c389151b326c",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "These are the credentials that I expect to be set for the database.\n",
      "db_name: neo4j\n",
      "uri: bolt://localhost:7687\n",
      "password: bpic2014\n",
      "----------------------\n",
      "If you have other credentials, please change them at: bpic14\\config.yaml\n"
     ]
    }
   ],
   "execution_count": 7
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T16:41:58.804253900Z",
     "start_time": "2025-11-05T16:41:58.794689700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "config = Configuration.init_conf_with_config_file(conf_path)\n",
    "db_connection = DatabaseConnection.set_up_connection(config=config)"
   ],
   "id": "738cbce2a9d1686d",
   "outputs": [],
   "execution_count": 8
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T16:42:00.152043300Z",
     "start_time": "2025-11-05T16:42:00.147422Z"
    }
   },
   "cell_type": "code",
   "source": [
    "if load:\n",
    "    # Import the original modeled data\n",
    "    %run./ 0_analysis_and_model.ipynb"
   ],
   "id": "422a673cc1cd9a02",
   "outputs": [],
   "execution_count": 9
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T16:42:22.369677800Z",
     "start_time": "2025-11-05T16:42:02.471482500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# infer start and end events for each object type\n",
    "objectTypes = [\"Change\", \"Incident\", \"Interaction\"]\n",
    "for objectType in objectTypes:\n",
    "    print(f\"Inferring start and end events for object type: {objectType}\")\n",
    "\n",
    "    qStartEvent = f'''\n",
    "    // Infer start event of an object\n",
    "    MATCH (n:{objectType})\n",
    "    MATCH (n)<-[c:CORR]-(e:Event) WHERE NOT ()-[:DF {{id:n.sysId}}]->(e)\n",
    "    MERGE (n)<-[:START]-(e)\n",
    "    '''\n",
    "    result = db_connection.exec_query(qStartEvent)\n",
    "\n",
    "    qEndEvent = f'''\n",
    "    // Infer start event of an object\n",
    "    MATCH (n:{objectType})\n",
    "    MATCH (n)<-[c:CORR]-(e:Event) WHERE NOT (e)-[:DF {{id:n.sysId}}]->()\n",
    "    MERGE (n)<-[:END]-(e)\n",
    "    '''\n",
    "    db_connection.exec_query(qEndEvent)"
   ],
   "id": "50758373446f2389",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Inferring start and end events for object type: Change\n",
      "Inferring start and end events for object type: Incident\n",
      "Inferring start and end events for object type: Interaction\n"
     ]
    }
   ],
   "execution_count": 10
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "ff591e7a6561c6cb"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T11:44:53.940862700Z",
     "start_time": "2025-11-05T11:44:53.492038600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Explore start and end activities for each type\n",
    "\n",
    "# infer start and end events for each object type\n",
    "print(f\"Inferring start and end events activities per object type\")\n",
    "\n",
    "qNumberStart = f'''\n",
    "// Infer start event of an object\n",
    "MATCH (n)<-[:START]-(e:Event)\n",
    "RETURN labels(n)[0] as label, e.activity as start_activity, count(e) as number_of_start_events order by label, number_of_start_events DESC\n",
    "'''\n",
    "start_result = pd.DataFrame(db_connection.exec_query(qNumberStart))\n",
    "\n",
    "\n",
    "qNumberEnd = f'''\n",
    "// Infer start event of an object\n",
    "MATCH (n)<-[:END]-(e:Event)\n",
    "RETURN labels(n)[0] as label, e.activity as end_activity, count(e) as number_of_end_events order by label, number_of_end_events DESC\n",
    "'''\n",
    "end_result = pd.DataFrame(db_connection.exec_query(qNumberEnd))"
   ],
   "id": "82e93262f44e4b69",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Inferring start and end events activities per object type\n"
     ]
    }
   ],
   "execution_count": 7
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T11:44:54.037590400Z",
     "start_time": "2025-11-05T11:44:54.020922500Z"
    }
   },
   "cell_type": "code",
   "source": "start_result",
   "id": "9b6e80ac55b980af",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "          label              start_activity  number_of_start_events\n",
       "0        Change                       Start                   16610\n",
       "1        Change                         End                       1\n",
       "2      Incident                      Opened                   46368\n",
       "3      Incident                      Update                      15\n",
       "4      Incident                  Assignment                      11\n",
       "5      Incident                      Closed                      10\n",
       "6      Incident               Status Change                      10\n",
       "7      Incident                        Open                      10\n",
       "8      Incident             Operator Update                       6\n",
       "9      Incident                Caused By CI                       4\n",
       "10     Incident                Reassignment                       3\n",
       "11     Incident  External Vendor Assignment                       1\n",
       "12     Incident                    Resolved                       1\n",
       "13     Incident          Description Update                       1\n",
       "14  Interaction                        Open                  146553"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>label</th>\n",
       "      <th>start_activity</th>\n",
       "      <th>number_of_start_events</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Change</td>\n",
       "      <td>Start</td>\n",
       "      <td>16610</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Change</td>\n",
       "      <td>End</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Opened</td>\n",
       "      <td>46368</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Update</td>\n",
       "      <td>15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Assignment</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Closed</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Status Change</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Open</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Operator Update</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Caused By CI</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Reassignment</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Incident</td>\n",
       "      <td>External Vendor Assignment</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Resolved</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Description Update</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>Open</td>\n",
       "      <td>146553</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 8
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T11:44:54.951648900Z",
     "start_time": "2025-11-05T11:44:54.934086Z"
    }
   },
   "cell_type": "code",
   "source": "end_result",
   "id": "d12f2e836b6bea00",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "          label                 end_activity  number_of_end_events\n",
       "0        Change                          End                 16607\n",
       "1        Change                        Start                     4\n",
       "2      Incident                       Closed                 27515\n",
       "3      Incident                 Caused By CI                 15524\n",
       "4      Incident      Quality Indicator Fixed                  2654\n",
       "5      Incident            Quality Indicator                   675\n",
       "6      Incident                       Update                    20\n",
       "7      Incident                   Assignment                    14\n",
       "8      Incident                Status Change                    10\n",
       "9      Incident                         Open                    10\n",
       "10     Incident              Operator Update                     8\n",
       "11     Incident                 Reassignment                     3\n",
       "12     Incident   External Vendor Assignment                     1\n",
       "13     Incident                     Resolved                     1\n",
       "14     Incident           Description Update                     1\n",
       "15     Incident         Update from customer                     1\n",
       "16     Incident        Quality Indicator Set                     1\n",
       "17     Incident  Communication with customer                     1\n",
       "18     Incident             Notify By Change                     1\n",
       "19  Interaction                        Close                146553"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>label</th>\n",
       "      <th>end_activity</th>\n",
       "      <th>number_of_end_events</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Change</td>\n",
       "      <td>End</td>\n",
       "      <td>16607</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Change</td>\n",
       "      <td>Start</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Closed</td>\n",
       "      <td>27515</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Caused By CI</td>\n",
       "      <td>15524</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Quality Indicator Fixed</td>\n",
       "      <td>2654</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Quality Indicator</td>\n",
       "      <td>675</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Update</td>\n",
       "      <td>20</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Assignment</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Status Change</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Open</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Operator Update</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Reassignment</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Incident</td>\n",
       "      <td>External Vendor Assignment</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Resolved</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Description Update</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Update from customer</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Quality Indicator Set</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Communication with customer</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Notify By Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>Close</td>\n",
       "      <td>146553</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 9
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T11:44:56.294071300Z",
     "start_time": "2025-11-05T11:44:56.077707600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# CHECK the cardinality between incident and interaction\n",
    "\n",
    "query = '''\n",
    "MATCH (int:Interaction)\n",
    "OPTIONAL MATCH (int) - [:RELATED_INCIDENT] -> (inc:Incident)\n",
    "WITH int, count(inc) as number_of_related_incidents\n",
    "RETURN number_of_related_incidents, count(int) ORDER BY number_of_related_incidents\n",
    "'''\n",
    "pd.DataFrame(db_connection.exec_query(query))"
   ],
   "id": "317c0852dbe41b78",
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01G11', status_description='warn: null value eliminated in set function', position=None, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH (int:Interaction)\\nOPTIONAL MATCH (int) - [:RELATED_INCIDENT] -> (inc:Incident)\\nWITH int, count(inc) as number_of_related_incidents\\nRETURN number_of_related_incidents, count(int) ORDER BY number_of_related_incidents\\n'\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "   number_of_related_incidents  count(int)\n",
       "0                            0       95250\n",
       "1                            1       51303"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>number_of_related_incidents</th>\n",
       "      <th>count(int)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>95250</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>51303</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 10
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "All Interactions have at most one incident",
   "id": "c51b5323c5c362af"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T11:44:59.460947800Z",
     "start_time": "2025-11-05T11:44:59.303445800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# CHECK the cardinality between incident and interaction\n",
    "\n",
    "query = '''\n",
    "MATCH (inc:Incident)\n",
    "OPTIONAL MATCH (int:Interaction) - [:RELATED_INCIDENT] -> (inc)\n",
    "WITH inc, count(int) as number_of_related_interactions\n",
    "RETURN number_of_related_interactions, count(inc) ORDER BY number_of_related_interactions\n",
    "'''\n",
    "pd.DataFrame(db_connection.exec_query(query))"
   ],
   "id": "b6983d3229c5da92",
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01G11', status_description='warn: null value eliminated in set function', position=None, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\nMATCH (inc:Incident)\\nOPTIONAL MATCH (int:Interaction) - [:RELATED_INCIDENT] -> (inc)\\nWITH inc, count(int) as number_of_related_interactions\\nRETURN number_of_related_interactions, count(inc) ORDER BY number_of_related_interactions\\n'\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "    number_of_related_interactions  count(inc)\n",
       "0                                0        1008\n",
       "1                                1       42532\n",
       "2                                2        2625\n",
       "3                                3         422\n",
       "4                                4         110\n",
       "5                                5          31\n",
       "6                                6          17\n",
       "7                                7           7\n",
       "8                                8           5\n",
       "9                                9           8\n",
       "10                              10           2\n",
       "11                              11           3\n",
       "12                              12           5\n",
       "13                              13           4\n",
       "14                              15           2\n",
       "15                              16           2\n",
       "16                              17           2\n",
       "17                              18           1\n",
       "18                              19           1\n",
       "19                              20           4\n",
       "20                              21           1\n",
       "21                              22           2\n",
       "22                              24           1\n",
       "23                              25           3\n",
       "24                              26           1\n",
       "25                              27           1\n",
       "26                              29           2\n",
       "27                              30           1\n",
       "28                              32           1\n",
       "29                              33           1\n",
       "30                              35           2\n",
       "31                              36           1\n",
       "32                              37           1\n",
       "33                              39           2\n",
       "34                              41           1\n",
       "35                              43           1\n",
       "36                              44           1\n",
       "37                              45           1\n",
       "38                              47           1\n",
       "39                              54           1\n",
       "40                              69           1\n",
       "41                              85           1"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>number_of_related_interactions</th>\n",
       "      <th>count(inc)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>1008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>42532</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>2625</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>422</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>110</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5</td>\n",
       "      <td>31</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>6</td>\n",
       "      <td>17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>7</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>8</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>9</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>10</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>11</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>12</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>13</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>15</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>16</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>17</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>18</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>19</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>20</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>21</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>22</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>24</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>25</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>26</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>27</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>29</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>30</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>32</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>33</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>35</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>36</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>37</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>39</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>41</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>43</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>44</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>45</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>47</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>54</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>69</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>85</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 11
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T11:45:00.384797600Z",
     "start_time": "2025-11-05T11:45:00.256615600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "    MATCH (sc:CI_SC)\n",
    "    RETURN  EXISTS ((sc) <- [:AFFECTED_CI_SC] - (:Interaction)) as has_interaction,\n",
    "            EXISTS ((sc) <- [:AFFECTED_CI_SC] - (:Change)) as has_change,\n",
    "            EXISTS ((sc) <- [:AFFECTED_CI_SC] - (:Incident)) as has_incident,\n",
    "    count(sc) as count ORDER BY has_interaction, has_change, has_incident\n",
    "'''\n",
    "\n",
    "result = pd.DataFrame(db_connection.exec_query(query))\n",
    "result"
   ],
   "id": "106e77c74f4c09a2",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   has_interaction  has_change  has_incident  count\n",
       "0            False       False         False   1025\n",
       "1            False       False          True    472\n",
       "2            False        True         False   9584\n",
       "3            False        True          True     32\n",
       "4             True       False         False   1542\n",
       "5             True       False          True   2001\n",
       "6             True        True         False     83\n",
       "7             True        True          True    568"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>has_interaction</th>\n",
       "      <th>has_change</th>\n",
       "      <th>has_incident</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>1025</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>472</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>9584</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>1542</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>2001</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>83</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>568</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 12
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T11:43:01.112175800Z",
     "start_time": "2025-11-05T11:42:19.622441600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "\n",
    "import plotly.express as px\n",
    "\n",
    "fig = px.treemap(\n",
    "    result,\n",
    "    path = [px.Constant(\"all\"), \"has_change\", \"has_interaction\", \"has_incident\"],\n",
    "    values = \"count\"\n",
    ")\n",
    "fig.update_traces(root_color=\"lightgrey\")\n",
    "fig.update_layout(margin = dict(t=50, l=25, r=25, b=25))\n",
    "fig.show();"
   ],
   "id": "f7b67cd0cc8e0ce",
   "outputs": [
    {
     "data": {
      "application/vnd.plotly.v1+json": {
       "data": [
        {
         "branchvalues": "total",
         "domain": {
          "x": [
           0.0,
           1.0
          ],
          "y": [
           0.0,
           1.0
          ]
         },
         "hovertemplate": "labels=%{label}<br>count=%{value}<br>parent=%{parent}<br>id=%{id}<extra></extra>",
         "ids": [
          "all/False/False/False",
          "all/False/False/True",
          "all/True/False/False",
          "all/True/False/True",
          "all/False/True/False",
          "all/False/True/True",
          "all/True/True/False",
          "all/True/True/True",
          "all/False/False",
          "all/True/False",
          "all/False/True",
          "all/True/True",
          "all/False",
          "all/True",
          "all"
         ],
         "labels": [
          "False",
          "True",
          "False",
          "True",
          "False",
          "True",
          "False",
          "True",
          "False",
          "False",
          "True",
          "True",
          "False",
          "True",
          "all"
         ],
         "name": "",
         "parents": [
          "all/False/False",
          "all/False/False",
          "all/True/False",
          "all/True/False",
          "all/False/True",
          "all/False/True",
          "all/True/True",
          "all/True/True",
          "all/False",
          "all/True",
          "all/False",
          "all/True",
          "all",
          "all",
          ""
         ],
         "values": {
          "dtype": "f8",
          "bdata": "AAAAAAAEkEAAAAAAAIB9QAAAAAAAuMJAAAAAAAAAQEAAAAAAABiYQAAAAAAARJ9AAAAAAADAVEAAAAAAAMCBQAAAAAAAZJdAAAAAAADIwkAAAAAAAK6rQAAAAAAAWIRAAAAAAACws0AAAAAAgA3EQAAAAACA5c1A"
         },
         "type": "treemap",
         "root": {
          "color": "lightgrey"
         }
        }
       ],
       "layout": {
        "template": {
         "data": {
          "histogram2dcontour": [
           {
            "type": "histogram2dcontour",
            "colorbar": {
             "outlinewidth": 0,
             "ticks": ""
            },
            "colorscale": [
             [
              0.0,
              "#0d0887"
             ],
             [
              0.1111111111111111,
              "#46039f"
             ],
             [
              0.2222222222222222,
              "#7201a8"
             ],
             [
              0.3333333333333333,
              "#9c179e"
             ],
             [
              0.4444444444444444,
              "#bd3786"
             ],
             [
              0.5555555555555556,
              "#d8576b"
             ],
             [
              0.6666666666666666,
              "#ed7953"
             ],
             [
              0.7777777777777778,
              "#fb9f3a"
             ],
             [
              0.8888888888888888,
              "#fdca26"
             ],
             [
              1.0,
              "#f0f921"
             ]
            ]
           }
          ],
          "choropleth": [
           {
            "type": "choropleth",
            "colorbar": {
             "outlinewidth": 0,
             "ticks": ""
            }
           }
          ],
          "histogram2d": [
           {
            "type": "histogram2d",
            "colorbar": {
             "outlinewidth": 0,
             "ticks": ""
            },
            "colorscale": [
             [
              0.0,
              "#0d0887"
             ],
             [
              0.1111111111111111,
              "#46039f"
             ],
             [
              0.2222222222222222,
              "#7201a8"
             ],
             [
              0.3333333333333333,
              "#9c179e"
             ],
             [
              0.4444444444444444,
              "#bd3786"
             ],
             [
              0.5555555555555556,
              "#d8576b"
             ],
             [
              0.6666666666666666,
              "#ed7953"
             ],
             [
              0.7777777777777778,
              "#fb9f3a"
             ],
             [
              0.8888888888888888,
              "#fdca26"
             ],
             [
              1.0,
              "#f0f921"
             ]
            ]
           }
          ],
          "heatmap": [
           {
            "type": "heatmap",
            "colorbar": {
             "outlinewidth": 0,
             "ticks": ""
            },
            "colorscale": [
             [
              0.0,
              "#0d0887"
             ],
             [
              0.1111111111111111,
              "#46039f"
             ],
             [
              0.2222222222222222,
              "#7201a8"
             ],
             [
              0.3333333333333333,
              "#9c179e"
             ],
             [
              0.4444444444444444,
              "#bd3786"
             ],
             [
              0.5555555555555556,
              "#d8576b"
             ],
             [
              0.6666666666666666,
              "#ed7953"
             ],
             [
              0.7777777777777778,
              "#fb9f3a"
             ],
             [
              0.8888888888888888,
              "#fdca26"
             ],
             [
              1.0,
              "#f0f921"
             ]
            ]
           }
          ],
          "contourcarpet": [
           {
            "type": "contourcarpet",
            "colorbar": {
             "outlinewidth": 0,
             "ticks": ""
            }
           }
          ],
          "contour": [
           {
            "type": "contour",
            "colorbar": {
             "outlinewidth": 0,
             "ticks": ""
            },
            "colorscale": [
             [
              0.0,
              "#0d0887"
             ],
             [
              0.1111111111111111,
              "#46039f"
             ],
             [
              0.2222222222222222,
              "#7201a8"
             ],
             [
              0.3333333333333333,
              "#9c179e"
             ],
             [
              0.4444444444444444,
              "#bd3786"
             ],
             [
              0.5555555555555556,
              "#d8576b"
             ],
             [
              0.6666666666666666,
              "#ed7953"
             ],
             [
              0.7777777777777778,
              "#fb9f3a"
             ],
             [
              0.8888888888888888,
              "#fdca26"
             ],
             [
              1.0,
              "#f0f921"
             ]
            ]
           }
          ],
          "surface": [
           {
            "type": "surface",
            "colorbar": {
             "outlinewidth": 0,
             "ticks": ""
            },
            "colorscale": [
             [
              0.0,
              "#0d0887"
             ],
             [
              0.1111111111111111,
              "#46039f"
             ],
             [
              0.2222222222222222,
              "#7201a8"
             ],
             [
              0.3333333333333333,
              "#9c179e"
             ],
             [
              0.4444444444444444,
              "#bd3786"
             ],
             [
              0.5555555555555556,
              "#d8576b"
             ],
             [
              0.6666666666666666,
              "#ed7953"
             ],
             [
              0.7777777777777778,
              "#fb9f3a"
             ],
             [
              0.8888888888888888,
              "#fdca26"
             ],
             [
              1.0,
              "#f0f921"
             ]
            ]
           }
          ],
          "mesh3d": [
           {
            "type": "mesh3d",
            "colorbar": {
             "outlinewidth": 0,
             "ticks": ""
            }
           }
          ],
          "scatter": [
           {
            "fillpattern": {
             "fillmode": "overlay",
             "size": 10,
             "solidity": 0.2
            },
            "type": "scatter"
           }
          ],
          "parcoords": [
           {
            "type": "parcoords",
            "line": {
             "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
             }
            }
           }
          ],
          "scatterpolargl": [
           {
            "type": "scatterpolargl",
            "marker": {
             "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
             }
            }
           }
          ],
          "bar": [
           {
            "error_x": {
             "color": "#2a3f5f"
            },
            "error_y": {
             "color": "#2a3f5f"
            },
            "marker": {
             "line": {
              "color": "#E5ECF6",
              "width": 0.5
             },
             "pattern": {
              "fillmode": "overlay",
              "size": 10,
              "solidity": 0.2
             }
            },
            "type": "bar"
           }
          ],
          "scattergeo": [
           {
            "type": "scattergeo",
            "marker": {
             "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
             }
            }
           }
          ],
          "scatterpolar": [
           {
            "type": "scatterpolar",
            "marker": {
             "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
             }
            }
           }
          ],
          "histogram": [
           {
            "marker": {
             "pattern": {
              "fillmode": "overlay",
              "size": 10,
              "solidity": 0.2
             }
            },
            "type": "histogram"
           }
          ],
          "scattergl": [
           {
            "type": "scattergl",
            "marker": {
             "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
             }
            }
           }
          ],
          "scatter3d": [
           {
            "type": "scatter3d",
            "line": {
             "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
             }
            },
            "marker": {
             "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
             }
            }
           }
          ],
          "scattermap": [
           {
            "type": "scattermap",
            "marker": {
             "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
             }
            }
           }
          ],
          "scattermapbox": [
           {
            "type": "scattermapbox",
            "marker": {
             "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
             }
            }
           }
          ],
          "scatterternary": [
           {
            "type": "scatterternary",
            "marker": {
             "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
             }
            }
           }
          ],
          "scattercarpet": [
           {
            "type": "scattercarpet",
            "marker": {
             "colorbar": {
              "outlinewidth": 0,
              "ticks": ""
             }
            }
           }
          ],
          "carpet": [
           {
            "aaxis": {
             "endlinecolor": "#2a3f5f",
             "gridcolor": "white",
             "linecolor": "white",
             "minorgridcolor": "white",
             "startlinecolor": "#2a3f5f"
            },
            "baxis": {
             "endlinecolor": "#2a3f5f",
             "gridcolor": "white",
             "linecolor": "white",
             "minorgridcolor": "white",
             "startlinecolor": "#2a3f5f"
            },
            "type": "carpet"
           }
          ],
          "table": [
           {
            "cells": {
             "fill": {
              "color": "#EBF0F8"
             },
             "line": {
              "color": "white"
             }
            },
            "header": {
             "fill": {
              "color": "#C8D4E3"
             },
             "line": {
              "color": "white"
             }
            },
            "type": "table"
           }
          ],
          "barpolar": [
           {
            "marker": {
             "line": {
              "color": "#E5ECF6",
              "width": 0.5
             },
             "pattern": {
              "fillmode": "overlay",
              "size": 10,
              "solidity": 0.2
             }
            },
            "type": "barpolar"
           }
          ],
          "pie": [
           {
            "automargin": true,
            "type": "pie"
           }
          ]
         },
         "layout": {
          "autotypenumbers": "strict",
          "colorway": [
           "#636efa",
           "#EF553B",
           "#00cc96",
           "#ab63fa",
           "#FFA15A",
           "#19d3f3",
           "#FF6692",
           "#B6E880",
           "#FF97FF",
           "#FECB52"
          ],
          "font": {
           "color": "#2a3f5f"
          },
          "hovermode": "closest",
          "hoverlabel": {
           "align": "left"
          },
          "paper_bgcolor": "white",
          "plot_bgcolor": "#E5ECF6",
          "polar": {
           "bgcolor": "#E5ECF6",
           "angularaxis": {
            "gridcolor": "white",
            "linecolor": "white",
            "ticks": ""
           },
           "radialaxis": {
            "gridcolor": "white",
            "linecolor": "white",
            "ticks": ""
           }
          },
          "ternary": {
           "bgcolor": "#E5ECF6",
           "aaxis": {
            "gridcolor": "white",
            "linecolor": "white",
            "ticks": ""
           },
           "baxis": {
            "gridcolor": "white",
            "linecolor": "white",
            "ticks": ""
           },
           "caxis": {
            "gridcolor": "white",
            "linecolor": "white",
            "ticks": ""
           }
          },
          "coloraxis": {
           "colorbar": {
            "outlinewidth": 0,
            "ticks": ""
           }
          },
          "colorscale": {
           "sequential": [
            [
             0.0,
             "#0d0887"
            ],
            [
             0.1111111111111111,
             "#46039f"
            ],
            [
             0.2222222222222222,
             "#7201a8"
            ],
            [
             0.3333333333333333,
             "#9c179e"
            ],
            [
             0.4444444444444444,
             "#bd3786"
            ],
            [
             0.5555555555555556,
             "#d8576b"
            ],
            [
             0.6666666666666666,
             "#ed7953"
            ],
            [
             0.7777777777777778,
             "#fb9f3a"
            ],
            [
             0.8888888888888888,
             "#fdca26"
            ],
            [
             1.0,
             "#f0f921"
            ]
           ],
           "sequentialminus": [
            [
             0.0,
             "#0d0887"
            ],
            [
             0.1111111111111111,
             "#46039f"
            ],
            [
             0.2222222222222222,
             "#7201a8"
            ],
            [
             0.3333333333333333,
             "#9c179e"
            ],
            [
             0.4444444444444444,
             "#bd3786"
            ],
            [
             0.5555555555555556,
             "#d8576b"
            ],
            [
             0.6666666666666666,
             "#ed7953"
            ],
            [
             0.7777777777777778,
             "#fb9f3a"
            ],
            [
             0.8888888888888888,
             "#fdca26"
            ],
            [
             1.0,
             "#f0f921"
            ]
           ],
           "diverging": [
            [
             0,
             "#8e0152"
            ],
            [
             0.1,
             "#c51b7d"
            ],
            [
             0.2,
             "#de77ae"
            ],
            [
             0.3,
             "#f1b6da"
            ],
            [
             0.4,
             "#fde0ef"
            ],
            [
             0.5,
             "#f7f7f7"
            ],
            [
             0.6,
             "#e6f5d0"
            ],
            [
             0.7,
             "#b8e186"
            ],
            [
             0.8,
             "#7fbc41"
            ],
            [
             0.9,
             "#4d9221"
            ],
            [
             1,
             "#276419"
            ]
           ]
          },
          "xaxis": {
           "gridcolor": "white",
           "linecolor": "white",
           "ticks": "",
           "title": {
            "standoff": 15
           },
           "zerolinecolor": "white",
           "automargin": true,
           "zerolinewidth": 2
          },
          "yaxis": {
           "gridcolor": "white",
           "linecolor": "white",
           "ticks": "",
           "title": {
            "standoff": 15
           },
           "zerolinecolor": "white",
           "automargin": true,
           "zerolinewidth": 2
          },
          "scene": {
           "xaxis": {
            "backgroundcolor": "#E5ECF6",
            "gridcolor": "white",
            "linecolor": "white",
            "showbackground": true,
            "ticks": "",
            "zerolinecolor": "white",
            "gridwidth": 2
           },
           "yaxis": {
            "backgroundcolor": "#E5ECF6",
            "gridcolor": "white",
            "linecolor": "white",
            "showbackground": true,
            "ticks": "",
            "zerolinecolor": "white",
            "gridwidth": 2
           },
           "zaxis": {
            "backgroundcolor": "#E5ECF6",
            "gridcolor": "white",
            "linecolor": "white",
            "showbackground": true,
            "ticks": "",
            "zerolinecolor": "white",
            "gridwidth": 2
           }
          },
          "shapedefaults": {
           "line": {
            "color": "#2a3f5f"
           }
          },
          "annotationdefaults": {
           "arrowcolor": "#2a3f5f",
           "arrowhead": 0,
           "arrowwidth": 1
          },
          "geo": {
           "bgcolor": "white",
           "landcolor": "#E5ECF6",
           "subunitcolor": "white",
           "showland": true,
           "showlakes": true,
           "lakecolor": "white"
          },
          "title": {
           "x": 0.05
          },
          "mapbox": {
           "style": "light"
          }
         }
        },
        "legend": {
         "tracegroupgap": 0
        },
        "margin": {
         "t": 50,
         "l": 25,
         "r": 25,
         "b": 25
        }
       },
       "config": {
        "plotlyServerURL": "https://plot.ly"
       }
      }
     },
     "metadata": {},
     "output_type": "display_data",
     "jetTransient": {
      "display_id": null
     }
    }
   ],
   "execution_count": 23
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T12:09:05.928065500Z",
     "start_time": "2025-11-05T12:09:05.449855700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "    MATCH (sc:CI_SC) - [:RELATED_CI] - (ci:ConfigurationItem)\n",
    "    RETURN  collect(distinct ci.ciType + ' ' + ci.ciSubtype) as types,\n",
    "            size(collect(distinct ci.ciType + ' ' + ci.ciSubtype)) as size,\n",
    "            EXISTS ((sc) <- [:AFFECTED_CI_SC] - (:Interaction)) as has_interaction,\n",
    "            EXISTS ((sc) <- [:AFFECTED_CI_SC] - (:Change)) as has_change,\n",
    "            EXISTS ((sc) <- [:AFFECTED_CI_SC] - (:Incident)) as has_incident,\n",
    "    count(sc) as count ORDER BY has_interaction, has_change, has_incident\n",
    "'''\n",
    "\n",
    "result = pd.DataFrame(db_connection.exec_query(query))\n",
    "result"
   ],
   "id": "361d57de21805ad9",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                                               types  size  has_interaction  has_change  has_incident  count\n",
       "0  [application Standard Application, subapplicat...    40            False       False         False   1024\n",
       "1  [computer VDI, application Server Based Applic...    24            False       False          True    472\n",
       "2  [subapplication Web Based Application, applica...    77            False        True         False   9584\n",
       "3  [storage Controller, application Server Based ...    13            False        True          True     32\n",
       "4  [application Server Based Application, compute...    37             True       False         False   1542\n",
       "5  [application Server Based Application, subappl...    54             True       False          True   2001\n",
       "6  [storage Controller, application Server Based ...    17             True        True         False     83\n",
       "7  [hardware MigratieDummy, software Automation S...    47             True        True          True    568"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>types</th>\n",
       "      <th>size</th>\n",
       "      <th>has_interaction</th>\n",
       "      <th>has_change</th>\n",
       "      <th>has_incident</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[application Standard Application, subapplicat...</td>\n",
       "      <td>40</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>1024</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[computer VDI, application Server Based Applic...</td>\n",
       "      <td>24</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>472</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[subapplication Web Based Application, applica...</td>\n",
       "      <td>77</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>9584</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[storage Controller, application Server Based ...</td>\n",
       "      <td>13</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>32</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[application Server Based Application, compute...</td>\n",
       "      <td>37</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>1542</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[application Server Based Application, subappl...</td>\n",
       "      <td>54</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>2001</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>[storage Controller, application Server Based ...</td>\n",
       "      <td>17</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>83</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>[hardware MigratieDummy, software Automation S...</td>\n",
       "      <td>47</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>568</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 41
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T08:31:19.585142Z",
     "start_time": "2025-11-05T08:31:15.274321900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# ARE INCIDENT + INTERACTION on the same CI_SC\n",
    "# Look at timeline CI_SC!!\n",
    "# Push into sequence, from one change to another.\n",
    "# ORDERING OR SET (dependent on perspective CHANGE/INCIDENT).\n",
    "# is there always one CI_SC picked or is a random distribution.\n",
    "# changes over multiple CI_SC, Incident/Interaction on multiple CI_SC.\n",
    "\n",
    "query = '''MATCH (int:Interaction) - [:RELATED_INCIDENT] -> (inc:Incident)\n",
    "CALL (inc) {\n",
    "    MATCH (e:Event) - [:CORR] -> (all_int:Interaction) - [:RELATED_INCIDENT] -> (inc)\n",
    "    RETURN e as first_int_event ORDER BY e.timestamp LIMIT 1\n",
    "}\n",
    "\n",
    "CALL (inc) {\n",
    "    MATCH (e:Event) - [:CORR] -> (inc)\n",
    "    RETURN e as first_inc_event ORDER BY e.timestamp LIMIT 1\n",
    "}\n",
    "\n",
    "RETURN count(distinct inc) as number_of_inc, first_int_event.timestamp <= first_inc_event.timestamp as int_before_inc'''\n",
    "pd.DataFrame(db_connection.exec_query(query))"
   ],
   "id": "4a9f2e002d526c9f",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   number_of_inc  int_before_inc\n",
       "0          45291            True\n",
       "1            126           False"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>number_of_inc</th>\n",
       "      <th>int_before_inc</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>45291</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>126</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 47,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 47
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Most Incidents (99.7%) have a preceding Interaction.\n",
    "Hypothesis, these incidents were caused by an interaction preceding the event collection."
   ],
   "id": "38bd61f198d99034"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "\n",
    "Incidents are CAUSED by an interaction if there was no incident yet, but otherwise we refer to an already opened incident.\n"
   ],
   "id": "e276c41317fd26c3"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T07:42:52.664523Z",
     "start_time": "2025-11-05T07:42:52.561820200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "\n",
    "query = '''MATCH (int:Interaction) - [:RELATED_INCIDENT] -> (inc:Incident)\n",
    "CALL (inc) {\n",
    "    MATCH (e:Event) - [:CORR] -> (first_int:Interaction) - [:RELATED_INCIDENT] -> (inc)\n",
    "    RETURN first_int, e as first_int_event ORDER BY e.timestamp LIMIT 1\n",
    "}\n",
    "RETURN inc.sysId, first_int.sysId, first_int_event LIMIT 10\n",
    "\n",
    "'''\n",
    "pd.DataFrame(db_connection.exec_query(query))"
   ],
   "id": "25e2912a22f51847",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   inc.sysId first_int.sysId                                    first_int_event\n",
       "0  IM0000299       SD0000456  {'interactionId': 'SD0000456', 'activity': 'Op...\n",
       "1  IM0000301       SD0000459  {'interactionId': 'SD0000459', 'activity': 'Op...\n",
       "2  IM0000303       SD0000458  {'interactionId': 'SD0000458', 'activity': 'Op...\n",
       "3  IM0000304       SD0000462  {'interactionId': 'SD0000462', 'activity': 'Op...\n",
       "4  IM0000305       SD0000466  {'interactionId': 'SD0000466', 'activity': 'Op...\n",
       "5  IM0000306       SD0000467  {'interactionId': 'SD0000467', 'activity': 'Op...\n",
       "6  IM0000307       SD0000471  {'interactionId': 'SD0000471', 'activity': 'Op...\n",
       "7  IM0000308       SD0000477  {'interactionId': 'SD0000477', 'activity': 'Op...\n",
       "8  IM0000308       SD0000477  {'interactionId': 'SD0000477', 'activity': 'Op...\n",
       "9  IM0000309       SD0000481  {'interactionId': 'SD0000481', 'activity': 'Op..."
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>inc.sysId</th>\n",
       "      <th>first_int.sysId</th>\n",
       "      <th>first_int_event</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>IM0000299</td>\n",
       "      <td>SD0000456</td>\n",
       "      <td>{'interactionId': 'SD0000456', 'activity': 'Op...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>IM0000301</td>\n",
       "      <td>SD0000459</td>\n",
       "      <td>{'interactionId': 'SD0000459', 'activity': 'Op...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>IM0000303</td>\n",
       "      <td>SD0000458</td>\n",
       "      <td>{'interactionId': 'SD0000458', 'activity': 'Op...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>IM0000304</td>\n",
       "      <td>SD0000462</td>\n",
       "      <td>{'interactionId': 'SD0000462', 'activity': 'Op...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>IM0000305</td>\n",
       "      <td>SD0000466</td>\n",
       "      <td>{'interactionId': 'SD0000466', 'activity': 'Op...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>IM0000306</td>\n",
       "      <td>SD0000467</td>\n",
       "      <td>{'interactionId': 'SD0000467', 'activity': 'Op...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>IM0000307</td>\n",
       "      <td>SD0000471</td>\n",
       "      <td>{'interactionId': 'SD0000471', 'activity': 'Op...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>IM0000308</td>\n",
       "      <td>SD0000477</td>\n",
       "      <td>{'interactionId': 'SD0000477', 'activity': 'Op...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>IM0000308</td>\n",
       "      <td>SD0000477</td>\n",
       "      <td>{'interactionId': 'SD0000477', 'activity': 'Op...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>IM0000309</td>\n",
       "      <td>SD0000481</td>\n",
       "      <td>{'interactionId': 'SD0000481', 'activity': 'Op...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 46
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-05T07:26:21.253198900Z",
     "start_time": "2025-11-05T07:26:20.283090800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''MATCH (int:Interaction) - [:RELATED_INCIDENT] -> (inc:Incident)\n",
    "CALL (inc) {\n",
    "    MATCH (e:Event) - [:CORR] -> (int:Interaction) - [:RELATED_INCIDENT] -> (inc)\n",
    "    RETURN e as first_int_event ORDER BY e.timestamp LIMIT 1\n",
    "}\n",
    "\n",
    "CALL (inc) {\n",
    "    MATCH (e:Event) - [:CORR] -> (inc)\n",
    "    RETURN e as first_inc_event ORDER BY e.timestamp LIMIT 1\n",
    "}\n",
    "WITH int, inc, first_int_event, first_inc_event\n",
    "WHERE first_int_event.timestamp > first_inc_event.timestamp\n",
    "RETURN inc.sysId, duration.inSeconds(first_inc_event.timestamp, first_int_event.timestamp).minutes as dif_minutes'''\n",
    "\n",
    "pd.DataFrame(db_connection.exec_query(query))"
   ],
   "id": "94cf61165367da7e",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "     inc.sysId  dif_minutes\n",
       "0    IM0000320        35828\n",
       "1    IM0000321        47362\n",
       "2    IM0000321        47362\n",
       "3    IM0000321        47362\n",
       "4    IM0000322        38678\n",
       "..         ...          ...\n",
       "225  IM0046889           67\n",
       "226  IM0046889           67\n",
       "227  IM0046889           67\n",
       "228  IM0046889           67\n",
       "229  IM0046889           67\n",
       "\n",
       "[230 rows x 2 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>inc.sysId</th>\n",
       "      <th>dif_minutes</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>IM0000320</td>\n",
       "      <td>35828</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>IM0000321</td>\n",
       "      <td>47362</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>IM0000321</td>\n",
       "      <td>47362</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>IM0000321</td>\n",
       "      <td>47362</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>IM0000322</td>\n",
       "      <td>38678</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>225</th>\n",
       "      <td>IM0046889</td>\n",
       "      <td>67</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>226</th>\n",
       "      <td>IM0046889</td>\n",
       "      <td>67</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>227</th>\n",
       "      <td>IM0046889</td>\n",
       "      <td>67</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>228</th>\n",
       "      <td>IM0046889</td>\n",
       "      <td>67</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>229</th>\n",
       "      <td>IM0046889</td>\n",
       "      <td>67</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>230 rows  2 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 31
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
