{
 "cells": [
  {
   "cell_type": "code",
   "id": "initial_id",
   "metadata": {
    "collapsed": true,
    "ExecuteTime": {
     "end_time": "2025-11-06T14:17:23.718380900Z",
     "start_time": "2025-11-06T14:17:23.667499400Z"
    }
   },
   "source": [
    "import matplotlib.pyplot as plt\n",
    "\n",
    "from pathlib import Path\n",
    "\n",
    "from promg.modules.db_management import DBManagement\n",
    "from tabulate import tabulate\n",
    "import yaml\n",
    "\n",
    "from promg import Configuration, DatabaseConnection, Performance, SemanticHeader, DatasetDescriptions, OcedPg, Query\n",
    "\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "import seaborn as sns\n",
    "\n",
    "pd.set_option('display.width', 2000)\n",
    "%matplotlib inline\n"
   ],
   "outputs": [],
   "execution_count": 49
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:17:23.783054100Z",
     "start_time": "2025-11-06T14:17:23.734084100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "case_study = 'bpic14'\n",
    "load = False\n",
    "infer_high_level_events = False\n"
   ],
   "id": "137f9a5f884a4e25",
   "outputs": [],
   "execution_count": 50
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:17:23.874879500Z",
     "start_time": "2025-11-06T14:17:23.796261100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "conf_path = Path(case_study, 'config.yaml')\n",
    "config = yaml.safe_load(open(conf_path))\n",
    "\n",
    "print(f\"These are the credentials that I expect to be set for the database.\")\n",
    "print(f\"db_name: {config['db_name']}\")\n",
    "print(f\"uri: {config['uri']}\")\n",
    "print(f\"password: {config['password']}\")\n",
    "print(\"----------------------\")\n",
    "print(f\"If you have other credentials, please change them at: {conf_path}\")"
   ],
   "id": "d721abed68aed975",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "These are the credentials that I expect to be set for the database.\n",
      "db_name: neo4j\n",
      "uri: bolt://localhost:7687\n",
      "password: bpic2014\n",
      "----------------------\n",
      "If you have other credentials, please change them at: bpic14\\config.yaml\n"
     ]
    }
   ],
   "execution_count": 51
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:17:23.937683300Z",
     "start_time": "2025-11-06T14:17:23.874879500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "config = Configuration.init_conf_with_config_file(conf_path)\n",
    "db_connection = DatabaseConnection.set_up_connection(config=config)"
   ],
   "id": "78013a03e5232f09",
   "outputs": [],
   "execution_count": 52
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "# Check whether the RELATED_INCIDENT has CI_SC as foreign key.\n",
    "Be more precise, Ava!"
   ],
   "id": "2874a0ca6e1f4e92"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:17:26.180918500Z",
     "start_time": "2025-11-06T14:17:23.954178600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query_check_related = '''\n",
    "    MATCH (int:Interaction) - [:RELATED_INCIDENT] -> (inc:Incident)\n",
    "    MATCH (int) - [:AFFECTED_CI_SC] -> (ci_sc_int:CI_SC)\n",
    "    MATCH (inc) - [:AFFECTED_CI_SC] -> (ci_sc_inc:CI_SC)\n",
    "    RETURN ci_sc_int = ci_sc_inc, count(inc)\n",
    "'''\n",
    "\n",
    "pd.DataFrame(db_connection.exec_query(query_check_related))"
   ],
   "id": "8ce6524b0bbd0c3f",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   ci_sc_int = ci_sc_inc  count(inc)\n",
       "0                   True       49006\n",
       "1                  False        1733"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ci_sc_int = ci_sc_inc</th>\n",
       "      <th>count(inc)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>True</td>\n",
       "      <td>49006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>False</td>\n",
       "      <td>1733</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 53,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 53
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:17:26.596192800Z",
     "start_time": "2025-11-06T14:17:26.265980300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query_check_related = '''\n",
    "    MATCH (int:Interaction) - [:RELATED_INCIDENT] -> (inc:Incident)\n",
    "    MATCH (int) - [:AFFECTED_CI_SC] -> (ci_sc_int:CI_SC)\n",
    "    MATCH (inc) - [:AFFECTED_CI_SC] -> (ci_sc_inc:CI_SC)\n",
    "    WHERE ci_sc_int <> ci_sc_inc\n",
    "    RETURN int.sysId, inc.sysId order by inc.sysId\n",
    "'''\n",
    "\n",
    "pd.DataFrame(db_connection.exec_query(query_check_related))"
   ],
   "id": "9f5afb83c58a4d2c",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "      int.sysId  inc.sysId\n",
       "0     SD0000479  IM0000310\n",
       "1     SD0000504  IM0000328\n",
       "2     SD0000584  IM0000391\n",
       "3     SD0004713  IM0000391\n",
       "4     SD0025853  IM0000393\n",
       "...         ...        ...\n",
       "1728  SD0145941  IM0046710\n",
       "1729  SD0145961  IM0046710\n",
       "1730  SD0146005  IM0046805\n",
       "1731  SD0146833  IM0046857\n",
       "1732  SD0146305  IM0046932\n",
       "\n",
       "[1733 rows x 2 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>int.sysId</th>\n",
       "      <th>inc.sysId</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>SD0000479</td>\n",
       "      <td>IM0000310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>SD0000504</td>\n",
       "      <td>IM0000328</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>SD0000584</td>\n",
       "      <td>IM0000391</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>SD0004713</td>\n",
       "      <td>IM0000391</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>SD0025853</td>\n",
       "      <td>IM0000393</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1728</th>\n",
       "      <td>SD0145941</td>\n",
       "      <td>IM0046710</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1729</th>\n",
       "      <td>SD0145961</td>\n",
       "      <td>IM0046710</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1730</th>\n",
       "      <td>SD0146005</td>\n",
       "      <td>IM0046805</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1731</th>\n",
       "      <td>SD0146833</td>\n",
       "      <td>IM0046857</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1732</th>\n",
       "      <td>SD0146305</td>\n",
       "      <td>IM0046932</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1733 rows × 2 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 54
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "Not all are related",
   "id": "1fac9375dc0397ee"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# Check for PATTERNS",
   "id": "bf725a3ba5d723cf"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Self-contained objects\n",
    "e.g. (Change Start) -> (Change End) for the same Change for single CI_SC"
   ],
   "id": "4dfd1e176b51ca73"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:17:30.002626300Z",
     "start_time": "2025-11-06T14:17:26.856172900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "MATCH (hle) - [:DF {objectType: hle.activity}] -> (hle1)\n",
    "MATCH (hle) - [:CORR] -> (ci_sc:CI_SC)\n",
    "MATCH (hle) - [:DF {objectType: 'CI_SC', id: ci_sc.sysId}] -> (hle1)\n",
    "RETURN ci_sc.sysId as sysId, hle.activity as activity, count(hle) as contained ORDER BY sysId\n",
    "\n",
    "'''\n",
    "\n",
    "result = pd.DataFrame(db_connection.exec_query(query))\n",
    "result"
   ],
   "id": "ef7268df6d8f23a5",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                     sysId     activity  contained\n",
       "0           #N/B_WBS000284  Interaction         12\n",
       "1      ACS000001_WBS000252     Incident          1\n",
       "2      ADB000003_WBS000253       Change          1\n",
       "3      ADB000004_WBS000253       Change          3\n",
       "4      ADB000006_WBS000253       Change          8\n",
       "...                    ...          ...        ...\n",
       "11786  ZOS000029_WBS000199       Change          1\n",
       "11787  ZOS000030_WBS000199       Change          1\n",
       "11788  ZOS000031_WBS000199       Change          1\n",
       "11789  ZOS000032_WBS000199       Change          1\n",
       "11790  ZOS000033_WBS000199       Change          1\n",
       "\n",
       "[11791 rows x 3 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>sysId</th>\n",
       "      <th>activity</th>\n",
       "      <th>contained</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>#N/B_WBS000284</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ACS000001_WBS000252</td>\n",
       "      <td>Incident</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ADB000003_WBS000253</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ADB000004_WBS000253</td>\n",
       "      <td>Change</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ADB000006_WBS000253</td>\n",
       "      <td>Change</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11786</th>\n",
       "      <td>ZOS000029_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11787</th>\n",
       "      <td>ZOS000030_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11788</th>\n",
       "      <td>ZOS000031_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11789</th>\n",
       "      <td>ZOS000032_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11790</th>\n",
       "      <td>ZOS000033_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>11791 rows × 3 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 55,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 55
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:17:34.333892100Z",
     "start_time": "2025-11-06T14:17:31.098278700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "MATCH (hle) - [:DF {objectType: hle.activity}] -> (hle1)\n",
    "MATCH (hle) - [:CORR] -> (ci_sc:CI_SC)\n",
    "RETURN ci_sc.sysId as sysId, hle.activity as activity, count(hle) as events ORDER BY sysId\n",
    "\n",
    "'''\n",
    "\n",
    "result_events = pd.DataFrame(db_connection.exec_query(query))\n",
    "result_events"
   ],
   "id": "ba76c59709a56bd9",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                     sysId     activity  events\n",
       "0           #N/B_WBS000284  Interaction      16\n",
       "1      ACS000001_WBS000252     Incident       1\n",
       "2      ACS000001_WBS000252  Interaction       1\n",
       "3      ADB000001_WBS000253       Change       2\n",
       "4      ADB000002_WBS000253       Change       1\n",
       "...                    ...          ...     ...\n",
       "16108  ZOS000029_WBS000199       Change       1\n",
       "16109  ZOS000030_WBS000199       Change       1\n",
       "16110  ZOS000031_WBS000199       Change       1\n",
       "16111  ZOS000032_WBS000199       Change       1\n",
       "16112  ZOS000033_WBS000199       Change       1\n",
       "\n",
       "[16113 rows x 3 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>sysId</th>\n",
       "      <th>activity</th>\n",
       "      <th>events</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>#N/B_WBS000284</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ACS000001_WBS000252</td>\n",
       "      <td>Incident</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ACS000001_WBS000252</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ADB000001_WBS000253</td>\n",
       "      <td>Change</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ADB000002_WBS000253</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16108</th>\n",
       "      <td>ZOS000029_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16109</th>\n",
       "      <td>ZOS000030_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16110</th>\n",
       "      <td>ZOS000031_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16111</th>\n",
       "      <td>ZOS000032_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16112</th>\n",
       "      <td>ZOS000033_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>16113 rows × 3 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 56,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 56
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:17:34.563156700Z",
     "start_time": "2025-11-06T14:17:34.445354500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "combined_result = result.merge(result_events, on=['sysId', 'activity'])\n",
    "combined_result['%'] = round(combined_result['contained']/combined_result['events']*100, 2)\n",
    "combined_result"
   ],
   "id": "4c1989a3f74314f8",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                     sysId     activity  contained  events       %\n",
       "0           #N/B_WBS000284  Interaction         12      16   75.00\n",
       "1      ACS000001_WBS000252     Incident          1       1  100.00\n",
       "2      ADB000003_WBS000253       Change          1       2   50.00\n",
       "3      ADB000004_WBS000253       Change          3       5   60.00\n",
       "4      ADB000006_WBS000253       Change          8      12   66.67\n",
       "...                    ...          ...        ...     ...     ...\n",
       "11786  ZOS000029_WBS000199       Change          1       1  100.00\n",
       "11787  ZOS000030_WBS000199       Change          1       1  100.00\n",
       "11788  ZOS000031_WBS000199       Change          1       1  100.00\n",
       "11789  ZOS000032_WBS000199       Change          1       1  100.00\n",
       "11790  ZOS000033_WBS000199       Change          1       1  100.00\n",
       "\n",
       "[11791 rows x 5 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>sysId</th>\n",
       "      <th>activity</th>\n",
       "      <th>contained</th>\n",
       "      <th>events</th>\n",
       "      <th>%</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>#N/B_WBS000284</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>12</td>\n",
       "      <td>16</td>\n",
       "      <td>75.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ACS000001_WBS000252</td>\n",
       "      <td>Incident</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>100.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ADB000003_WBS000253</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "      <td>50.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ADB000004_WBS000253</td>\n",
       "      <td>Change</td>\n",
       "      <td>3</td>\n",
       "      <td>5</td>\n",
       "      <td>60.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ADB000006_WBS000253</td>\n",
       "      <td>Change</td>\n",
       "      <td>8</td>\n",
       "      <td>12</td>\n",
       "      <td>66.67</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11786</th>\n",
       "      <td>ZOS000029_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>100.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11787</th>\n",
       "      <td>ZOS000030_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>100.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11788</th>\n",
       "      <td>ZOS000031_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>100.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11789</th>\n",
       "      <td>ZOS000032_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>100.00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11790</th>\n",
       "      <td>ZOS000033_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>100.00</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>11791 rows × 5 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 57,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 57
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:22:45.967980400Z",
     "start_time": "2025-11-06T14:22:45.913630700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Pivot the DataFrame\n",
    "pivot_df = combined_result.pivot(\n",
    "    index=['sysId'],\n",
    "    columns='activity',\n",
    "    values=['contained', 'events', '%']\n",
    ").reset_index()\n",
    "\n",
    "columns = [pivot_df.columns[0]]\n",
    "for object_type in ['Change', 'Incident', 'Interaction']:\n",
    "    columns.extend([('contained', object_type), ('events', object_type), ('%', object_type)])\n",
    "\n",
    "pivot_df = pivot_df[columns]\n",
    "pivot_df = pivot_df.fillna(0)\n",
    "pivot_df"
   ],
   "id": "8e9d7f6d2ae559e7",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                        sysId contained events       % contained   events        %   contained      events           %\n",
       "activity                         Change Change  Change  Incident Incident Incident Interaction Interaction Interaction\n",
       "0              #N/B_WBS000284       0.0    0.0    0.00       0.0      0.0      0.0        12.0        16.0        75.0\n",
       "1         ACS000001_WBS000252       0.0    0.0    0.00       1.0      1.0    100.0         0.0         0.0         0.0\n",
       "2         ADB000003_WBS000253       1.0    2.0   50.00       0.0      0.0      0.0         0.0         0.0         0.0\n",
       "3         ADB000004_WBS000253       3.0    5.0   60.00       0.0      0.0      0.0         0.0         0.0         0.0\n",
       "4         ADB000006_WBS000253       8.0   12.0   66.67       0.0      0.0      0.0         0.0         0.0         0.0\n",
       "...                       ...       ...    ...     ...       ...      ...      ...         ...         ...         ...\n",
       "10757     ZOS000029_WBS000199       1.0    1.0  100.00       0.0      0.0      0.0         0.0         0.0         0.0\n",
       "10758     ZOS000030_WBS000199       1.0    1.0  100.00       0.0      0.0      0.0         0.0         0.0         0.0\n",
       "10759     ZOS000031_WBS000199       1.0    1.0  100.00       0.0      0.0      0.0         0.0         0.0         0.0\n",
       "10760     ZOS000032_WBS000199       1.0    1.0  100.00       0.0      0.0      0.0         0.0         0.0         0.0\n",
       "10761     ZOS000033_WBS000199       1.0    1.0  100.00       0.0      0.0      0.0         0.0         0.0         0.0\n",
       "\n",
       "[10762 rows x 10 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead tr th {\n",
       "        text-align: left;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr>\n",
       "      <th></th>\n",
       "      <th>sysId</th>\n",
       "      <th>contained</th>\n",
       "      <th>events</th>\n",
       "      <th>%</th>\n",
       "      <th>contained</th>\n",
       "      <th>events</th>\n",
       "      <th>%</th>\n",
       "      <th>contained</th>\n",
       "      <th>events</th>\n",
       "      <th>%</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>activity</th>\n",
       "      <th></th>\n",
       "      <th>Change</th>\n",
       "      <th>Change</th>\n",
       "      <th>Change</th>\n",
       "      <th>Incident</th>\n",
       "      <th>Incident</th>\n",
       "      <th>Incident</th>\n",
       "      <th>Interaction</th>\n",
       "      <th>Interaction</th>\n",
       "      <th>Interaction</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>#N/B_WBS000284</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>12.0</td>\n",
       "      <td>16.0</td>\n",
       "      <td>75.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ACS000001_WBS000252</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.00</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>100.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ADB000003_WBS000253</td>\n",
       "      <td>1.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>50.00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ADB000004_WBS000253</td>\n",
       "      <td>3.0</td>\n",
       "      <td>5.0</td>\n",
       "      <td>60.00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ADB000006_WBS000253</td>\n",
       "      <td>8.0</td>\n",
       "      <td>12.0</td>\n",
       "      <td>66.67</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10757</th>\n",
       "      <td>ZOS000029_WBS000199</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>100.00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10758</th>\n",
       "      <td>ZOS000030_WBS000199</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>100.00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10759</th>\n",
       "      <td>ZOS000031_WBS000199</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>100.00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10760</th>\n",
       "      <td>ZOS000032_WBS000199</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>100.00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10761</th>\n",
       "      <td>ZOS000033_WBS000199</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>100.00</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>10762 rows × 10 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 64,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 64
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:36:30.823607600Z",
     "start_time": "2025-11-06T14:36:27.233965300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "MATCH (hle:HighLevelEvent) - [:DF {objectType: hle.activity}] -> (activity_hle:HighLevelEvent)\n",
    "MATCH (hle) - [:DF {objectType: 'CI_SC'}] -> (other_hle)\n",
    "MATCH (hle) - [:CORR] -> (n) - [:IS_OF_TYPE] - (ot:ObjectType {objectType: hle.activity})\n",
    "WHERE activity_hle <> other_hle\n",
    "SET n.self_contained = False\n",
    "RETURN hle.activity as activity, count(distinct n) as not_self_contained\n",
    "'''\n",
    "\n",
    "result_not_contained_objects = pd.DataFrame(db_connection.exec_query(query))\n",
    "result_not_contained_objects"
   ],
   "id": "22d6f1ab316516af",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "      activity  not_self_contained\n",
       "0     Incident               40396\n",
       "1  Interaction               79423\n",
       "2       Change                6233"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>activity</th>\n",
       "      <th>not_self_contained</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Incident</td>\n",
       "      <td>40396</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>79423</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Change</td>\n",
       "      <td>6233</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 81,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 81
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:36:31.758623200Z",
     "start_time": "2025-11-06T14:36:30.881682500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "MATCH (hle:HighLevelEvent) - [:CORR] -> (n) - [:IS_OF_TYPE] - (ot:ObjectType {objectType: hle.activity})\n",
    "WHERE n.self_contained IS NULL OR n.self_contained = True\n",
    "SET n.self_contained = True\n",
    "RETURN hle.activity as activity, count(distinct n) as self_contained\n",
    "'''\n",
    "\n",
    "result_contained_objects = pd.DataFrame(db_connection.exec_query(query))\n",
    "result_contained_objects"
   ],
   "id": "c32241fa5831ba78",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "      activity  self_contained\n",
       "0     Incident            5972\n",
       "1  Interaction           67130\n",
       "2       Change           10378"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>activity</th>\n",
       "      <th>self_contained</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Incident</td>\n",
       "      <td>5972</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>67130</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Change</td>\n",
       "      <td>10378</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 82,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 82
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:37:29.584138800Z",
     "start_time": "2025-11-06T14:37:29.556575600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "result_objects = result_contained_objects.merge(result_not_contained_objects, on='activity')\n",
    "result_objects['sum_total'] = result_objects['self_contained'] + result_objects['not_self_contained']\n",
    "result_objects['% contained'] = round(result_objects['self_contained']/result_objects['sum_total']*100,2)\n",
    "result_objects"
   ],
   "id": "9ad723034285dffc",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "      activity  self_contained  not_self_contained  sum_total  % contained\n",
       "0     Incident            5972               40396      46368        12.88\n",
       "1  Interaction           67130               79423     146553        45.81\n",
       "2       Change           10378                6233      16611        62.48"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>activity</th>\n",
       "      <th>self_contained</th>\n",
       "      <th>not_self_contained</th>\n",
       "      <th>sum_total</th>\n",
       "      <th>% contained</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Incident</td>\n",
       "      <td>5972</td>\n",
       "      <td>40396</td>\n",
       "      <td>46368</td>\n",
       "      <td>12.88</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>67130</td>\n",
       "      <td>79423</td>\n",
       "      <td>146553</td>\n",
       "      <td>45.81</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Change</td>\n",
       "      <td>10378</td>\n",
       "      <td>6233</td>\n",
       "      <td>16611</td>\n",
       "      <td>62.48</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 85,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 85
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "# Overlapping activities\n",
    "e.g. (Start Incident) -> (Start Interaction) -> (End Incident) -> (End Interaction)\n",
    "for single CI_SC"
   ],
   "id": "cfee0b0df6da7f96"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:48:59.421889400Z",
     "start_time": "2025-11-06T14:48:55.166741200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "MATCH (hle) - [:DF {objectType: hle.activity}] -> (hle3)\n",
    "MATCH (hle2) - [:DF {objectType: hle2.activity}] -> (hle4)\n",
    "MATCH (hle:HighLevelEvent) - [df:DF  {objectType: 'CI_SC'}] -> (hle2:HighLevelEvent)\n",
    "- [:DF  {objectType: 'CI_SC', id:df.id}] -> (hle3:HighLevelEvent)\n",
    "- [:DF  {objectType: 'CI_SC', id:df.id}] -> (hle4:HighLevelEvent)\n",
    "MATCH (hle) - [:CORR] -> (n) - [:IS_OF_TYPE] - (:ObjectType {objectType: hle.activity})\n",
    "MATCH (hle2) - [:CORR] -> (n2) - [:IS_OF_TYPE] - (:ObjectType {objectType: hle2.activity})\n",
    "SET n.overlapped = True\n",
    "SET n2.overlapped = True\n",
    "RETURN hle.activity as activity, hle2.activity as second_activity, count(distinct n) as overlapped\n",
    "'''\n",
    "\n",
    "overlapped_objects = pd.DataFrame(db_connection.exec_query(query))\n",
    "overlapped_objects"
   ],
   "id": "c9e13719a91c60a4",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "      activity second_activity  overlapped\n",
       "0  Interaction        Incident        3863\n",
       "1     Incident        Incident          14\n",
       "2       Change        Incident           1\n",
       "3     Incident     Interaction          14\n",
       "4  Interaction     Interaction        2241\n",
       "5       Change     Interaction           2\n",
       "6       Change          Change         131\n",
       "7  Interaction          Change           5"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>activity</th>\n",
       "      <th>second_activity</th>\n",
       "      <th>overlapped</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>Incident</td>\n",
       "      <td>3863</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Incident</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Change</td>\n",
       "      <td>Incident</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>2241</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Change</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Change</td>\n",
       "      <td>Change</td>\n",
       "      <td>131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>Change</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 88,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 88
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:52:10.059486700Z",
     "start_time": "2025-11-06T14:52:07.889682700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "MATCH (hle:HighLevelEvent) - [:CORR] -> (n) - [:IS_OF_TYPE] - (ot:ObjectType {objectType: hle.activity})\n",
    "WHERE n.overlapped IS NULL OR n.overlapped = False\n",
    "SET n.overlapped = False\n",
    "RETURN hle.activity as activity, count(distinct n) as not_overlapped\n",
    "'''\n",
    "\n",
    "pd.DataFrame(db_connection.exec_query(query))"
   ],
   "id": "24e06d75f91b2dcf",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "      activity  not_overlapped\n",
       "0     Incident           42462\n",
       "1  Interaction          138187\n",
       "2       Change           16344"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>activity</th>\n",
       "      <th>not_overlapped</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Incident</td>\n",
       "      <td>42462</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>138187</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Change</td>\n",
       "      <td>16344</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 89,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 89
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:53:04.623638200Z",
     "start_time": "2025-11-06T14:53:03.959930100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "MATCH (n) <- [:CORR] - (:HighLevelEvent)\n",
    "MATCH (n) - [:IS_OF_TYPE] - (ot:ObjectType)\n",
    "WHERE ot.objectType IN ['Change', 'Incident', 'Interaction']\n",
    "RETURN  ot.objectType as objectType, n.self_contained as self_contained, n.overlapped as overlapped, count(n) as count ORDER BY objectType, self_contained, overlapped\n",
    "'''\n",
    "pd.DataFrame(db_connection.exec_query(query))"
   ],
   "id": "eb73cc1e21c4d9ce",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "    objectType  self_contained  overlapped   count\n",
       "0       Change           False       False   11932\n",
       "1       Change           False        True     534\n",
       "2       Change            True       False   20751\n",
       "3     Incident           False       False   72980\n",
       "4     Incident           False        True    7812\n",
       "5     Incident            True       False   11944\n",
       "6  Interaction           False       False  142114\n",
       "7  Interaction           False        True   16732\n",
       "8  Interaction            True       False  134260"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>objectType</th>\n",
       "      <th>self_contained</th>\n",
       "      <th>overlapped</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Change</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>11932</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Change</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>534</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Change</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>20751</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Incident</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>72980</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Incident</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>7812</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Incident</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>11944</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>142114</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>16732</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>134260</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 92,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 92
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "# Enclosing objects\n",
    "e.g. (Start Incident) -> (Start Interaction) -> (End Interaction) -> (End Incident)\n",
    "for single CI_SC"
   ],
   "id": "5c7427044846866d"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T15:11:59.302958100Z",
     "start_time": "2025-11-06T15:09:25.986108300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "enclosing_objects = []\n",
    "\n",
    "for i in range(1, 20):\n",
    "    query = '''\n",
    "    MATCH (hle) - [:DF {objectType: hle.activity}] -> (hle4)\n",
    "    MATCH (hle2) - [:DF {objectType: hle2.activity}] -> (hle3)\n",
    "    MATCH (hle:HighLevelEvent) - [df:DF  {objectType: 'CI_SC'}] -> (hle2:HighLevelEvent)\n",
    "    - [:DF*$i  {objectType: 'CI_SC', id:df.id}] -> (hle3:HighLevelEvent)\n",
    "    - [:DF  {objectType: 'CI_SC', id:df.id}] -> (hle4:HighLevelEvent)\n",
    "    MATCH (hle) - [:CORR] -> (n) - [:IS_OF_TYPE] - (:ObjectType {objectType: hle.activity})\n",
    "    SET n.enclosing = True\n",
    "    RETURN hle.activity as activity, hle2.activity as second_activity, count(distinct n) as enclosing\n",
    "    '''\n",
    "\n",
    "    query = Query(\n",
    "        query_str=query,\n",
    "        template_string_parameters={'i': i}\n",
    "    )\n",
    "\n",
    "    enclosing_object = db_connection.exec_query(query)\n",
    "    enclosing_objects.extend(enclosing_object)\n",
    "    print(f\"Fixed {i} iteration, found {sum([object['enclosing'] for object in enclosing_object])} objects\")\n",
    "\n",
    "result = pd.DataFrame(enclosing_objects)\n"
   ],
   "id": "3e413384279a46c8",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Fixed 1 iteration, found 8804 objects\n",
      "Fixed 2 iteration, found 807 objects\n",
      "Fixed 3 iteration, found 1755 objects\n",
      "Fixed 4 iteration, found 322 objects\n",
      "Fixed 5 iteration, found 921 objects\n",
      "Fixed 6 iteration, found 226 objects\n",
      "Fixed 7 iteration, found 603 objects\n",
      "Fixed 8 iteration, found 172 objects\n",
      "Fixed 9 iteration, found 434 objects\n",
      "Fixed 10 iteration, found 128 objects\n",
      "Fixed 11 iteration, found 351 objects\n",
      "Fixed 12 iteration, found 152 objects\n",
      "Fixed 13 iteration, found 276 objects\n",
      "Fixed 14 iteration, found 115 objects\n",
      "Fixed 15 iteration, found 251 objects\n",
      "Fixed 16 iteration, found 100 objects\n",
      "Fixed 17 iteration, found 204 objects\n",
      "Fixed 18 iteration, found 81 objects\n",
      "Fixed 19 iteration, found 164 objects\n"
     ]
    }
   ],
   "execution_count": 109
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T15:12:09.935724200Z",
     "start_time": "2025-11-06T15:12:09.885860Z"
    }
   },
   "cell_type": "code",
   "source": [
    "result = pd.pivot_table(\n",
    "    result,\n",
    "    index=['activity', 'second_activity'],\n",
    "    aggfunc='sum'\n",
    ")\n",
    "result"
   ],
   "id": "35941dbc0d3dd4ca",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                             enclosing\n",
       "activity    second_activity           \n",
       "Change      Change                 379\n",
       "            Incident                 1\n",
       "            Interaction             41\n",
       "Incident    Change                  31\n",
       "            Incident                86\n",
       "            Interaction            858\n",
       "Interaction Change                   7\n",
       "            Incident             10655\n",
       "            Interaction           3808"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th>enclosing</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>activity</th>\n",
       "      <th>second_activity</th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th rowspan=\"3\" valign=\"top\">Change</th>\n",
       "      <th>Change</th>\n",
       "      <td>379</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Incident</th>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Interaction</th>\n",
       "      <td>41</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"3\" valign=\"top\">Incident</th>\n",
       "      <th>Change</th>\n",
       "      <td>31</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Incident</th>\n",
       "      <td>86</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Interaction</th>\n",
       "      <td>858</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"3\" valign=\"top\">Interaction</th>\n",
       "      <th>Change</th>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Incident</th>\n",
       "      <td>10655</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Interaction</th>\n",
       "      <td>3808</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 110,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 110
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T15:12:38.890461200Z",
     "start_time": "2025-11-06T15:12:38.216998500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "MATCH (n) <- [:CORR] - (:HighLevelEvent)\n",
    "MATCH (n) - [:IS_OF_TYPE] - (ot:ObjectType)\n",
    "WHERE ot.objectType IN ['Change', 'Incident', 'Interaction']\n",
    "RETURN  ot.objectType as objectType, n.self_contained as self_contained, n.overlapped as overlapped, n.enclosing as enclosing, count(n) as count ORDER BY objectType, self_contained, overlapped\n",
    "'''\n",
    "pd.DataFrame(db_connection.exec_query(query))"
   ],
   "id": "c30dc5606c9a302a",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "     objectType  self_contained  overlapped enclosing   count\n",
       "0        Change           False       False      None   11102\n",
       "1        Change           False       False      True     830\n",
       "2        Change           False        True      None     528\n",
       "3        Change           False        True      True       6\n",
       "4        Change            True       False      None   20751\n",
       "5      Incident           False       False      None   71030\n",
       "6      Incident           False       False      True    1950\n",
       "7      Incident           False        True      None    7812\n",
       "8      Incident            True       False      None   11944\n",
       "9   Interaction           False       False      None  113174\n",
       "10  Interaction           False       False      True   28940\n",
       "11  Interaction           False        True      None   16732\n",
       "12  Interaction            True       False      None  134260"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>objectType</th>\n",
       "      <th>self_contained</th>\n",
       "      <th>overlapped</th>\n",
       "      <th>enclosing</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Change</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>None</td>\n",
       "      <td>11102</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Change</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>830</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Change</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>None</td>\n",
       "      <td>528</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Change</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Change</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>None</td>\n",
       "      <td>20751</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Incident</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>None</td>\n",
       "      <td>71030</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Incident</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>1950</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Incident</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>None</td>\n",
       "      <td>7812</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Incident</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>None</td>\n",
       "      <td>11944</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>None</td>\n",
       "      <td>113174</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>28940</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>None</td>\n",
       "      <td>16732</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>None</td>\n",
       "      <td>134260</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 111,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 111
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# CREATE CONTAINMENT GRAPH",
   "id": "d2202675d0030df0"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "# build index for high-level events\n",
    "qCreateIndexHLE_sys = f'''\n",
    "    CREATE INDEX higherLevelEventSysIdIndex IF NOT EXISTS FOR (h:HigherLevelEvent) ON (h.sysId);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_sys)\n",
    "\n",
    "qCreateIndexHLE_start = f'''\n",
    "    CREATE INDEX higherLevelEventStartTimeIndex IF NOT EXISTS FOR (h:HigherLevelEvent) ON (h.startTime);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_start)\n",
    "qCreateIndexHLE_end = f'''\n",
    "    CREATE INDEX higherLevelEventEndTimeIndex IF NOT EXISTS FOR (h:HigherLevelEvent) ON (h.endTime);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_end)\n"
   ],
   "id": "c9f5e845e1a60b35"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T15:28:08.742581900Z",
     "start_time": "2025-11-06T15:27:59.807004500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    ":auto\n",
    "    MATCH (hle_start:HighLevelEvent) - [:DF {objectType: hle_start.activity}] -> (hle_end:HighLevelEvent)\n",
    "    WHERE NOT EXISTS ((hle_start) <- [:CONTAINS] - (:HigherLevelEvent))\n",
    "    CALL (hle_start, hle_end) {\n",
    "        CREATE (hler:HigherLevelEvent {sysId: \"HLE_\" + hle_start.sysId + \"_\" + hle_end.sysId, activity: hle_start.activity, startTime: hle_start.timestamp, endTime: hle_end.timestamp})\n",
    "        CREATE (hler) - [:CONTAINS] -> (hle_start)\n",
    "        CREATE (hler) - [:CONTAINS] -> (hle_end)\n",
    "    } IN TRANSACTIONS\n",
    "    RETURN hle_start.activity, count(hle_start)\n",
    "'''\n",
    "db_connection.exec_query(query)"
   ],
   "id": "1bf386089ad06a64",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'hle_start.activity': 'Change', 'count(hle_start)': 7190},\n",
       " {'hle_start.activity': 'Incident', 'count(hle_start)': 55608},\n",
       " {'hle_start.activity': 'Interaction', 'count(hle_start)': 176121}]"
      ]
     },
     "execution_count": 117,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 117
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "query = '''\n",
    "MATCH (hler:HigherLevelEvent) - [:CONTAINS] -> (hle_start) - [df_act:DF {objectType: hle_start.activity}] -> (hle_end:HighLevelEvent)\n",
    "MATCH (hle_start) - [df:DF {objectType: 'CI_SC'}] -> (hle_end) - [df2:DF {objectType: 'CI_SC', id: df.id}] -> (new_hle_start:HighLevelEvent)\n",
    "MATCH (new_hle_start)  - [new_df:DF {objectType: new_hle_start.activity}] -> (new_hle_end:HighLevelEvent)\n",
    "MATCH (next_hler) - [:CONTAINS] -> (new_hle_start)\n",
    "CALL (hler, next_hler, df) {\n",
    "    MERGE (hler) - [:DF {type: 'subsequent', objectType: 'CI_SC', id: df.id}] -> (next_hler)\n",
    "} IN TRANSACTIONS\n",
    "\n",
    "'''\n",
    "db_connection.exec_query(query)"
   ],
   "id": "e8e3f10eeb9dabb1"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T15:56:56.208604Z",
     "start_time": "2025-11-06T15:56:50.923474600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    ":auto\n",
    "MATCH (hler:HigherLevelEvent) - [:CONTAINS] -> (hle_start) - [df_act:DF {objectType: hle_start.activity}] -> (hle_end:HighLevelEvent)\n",
    "MATCH (hle_start) - [df:DF {objectType: 'CI_SC'}] -> (hle_other_start) WHERE hle_end <> hle_other_start\n",
    "MATCH (hle_other_start) - [df_act_other {objectType: hle_other_start.activity}] -> (hle_other_end)\n",
    "WITH hler, hle_start, hle_end, hle_other_start, hle_other_end, df_act, df, df_act_other, CASE\n",
    "WHEN hle_other_end.timestamp <= hle_end.timestamp THEN 'contains'\n",
    "ELSE 'overlaps' END AS type\n",
    "MATCH (next_hler:HigherLevelEvent) - [:CONTAINS] -> (hle_other_start)\n",
    "CALL (hler, next_hler, df, type) {\n",
    "    MERGE (hler) - [new_df:DF {objectType: 'CI_SC', id: df.id}] -> (next_hler)\n",
    "    SET new_df.type = type\n",
    "} IN TRANSACTIONS\n",
    "\n",
    "'''\n",
    "db_connection.exec_query(query)"
   ],
   "id": "e70b0cd1bf6403ba",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 120,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 120
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T16:00:12.240301500Z",
     "start_time": "2025-11-06T16:00:09.079463600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    ":auto\n",
    "MATCH (hler:HigherLevelEvent) - [:CONTAINS] -> (hle_start) - [df_act:DF {objectType: hle_start.activity}] -> (hle_end:HighLevelEvent)\n",
    "MATCH (hle_end) - [df:DF {objectType: 'CI_SC'}] -> (hle_other_end)\n",
    "MATCH (hle_other_start) - [df_act_other {objectType: hle_other_start.activity}] -> (hle_other_end)\n",
    "WITH hler, hle_start, hle_end, hle_other_start, hle_other_end, df_act, df, df_act_other, CASE\n",
    "WHEN hle_other_start.timestamp <= hle_start.timestamp THEN 'contains'\n",
    "ELSE 'overlaps' END AS type\n",
    "MATCH (next_hler:HigherLevelEvent) - [:CONTAINS] -> (hle_other_start)\n",
    "CALL (hler, next_hler, df, type) {\n",
    "    MERGE (hler) - [new_df:DF {objectType: 'CI_SC', id: df.id}] -> (next_hler)\n",
    "    SET new_df.type = type\n",
    "} IN TRANSACTIONS\n",
    "\n",
    "'''\n",
    "db_connection.exec_query(query)"
   ],
   "id": "2a2ae1c91997d715",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 121,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 121
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T16:04:29.376650200Z",
     "start_time": "2025-11-06T16:04:25.712283500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    ":auto\n",
    "MATCH (hler:HigherLevelEvent) - [:CONTAINS] -> (hle_start) - [df_act:DF {objectType: hle_start.activity}] -> (hle_end:HighLevelEvent)\n",
    "MATCH (hle_end) - [df:DF {objectType: 'CI_SC'}] -> (hle_other_start)\n",
    "MATCH (hle_other_start) - [df_act_other {objectType: hle_other_start.activity}] -> (hle_other_end)\n",
    "MATCH (next_hler:HigherLevelEvent) - [:CONTAINS] -> (hle_other_start)\n",
    "CALL (hler, next_hler, df) {\n",
    "    MERGE (hler) - [new_df:DF {objectType: 'CI_SC', id: df.id}] -> (next_hler)\n",
    "    SET new_df.type = 'subsequent'\n",
    "} IN TRANSACTIONS\n",
    "\n",
    "'''\n",
    "db_connection.exec_query(query)"
   ],
   "id": "b9d21a88bfb5c1a6",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 123,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 123
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
