{
 "cells": [
  {
   "cell_type": "code",
   "id": "initial_id",
   "metadata": {
    "collapsed": true,
    "ExecuteTime": {
     "end_time": "2025-11-07T15:24:34.300487400Z",
     "start_time": "2025-11-07T15:24:34.041720800Z"
    }
   },
   "source": [
    "import matplotlib.pyplot as plt\n",
    "\n",
    "from pathlib import Path\n",
    "\n",
    "from promg.modules.db_management import DBManagement\n",
    "from tabulate import tabulate\n",
    "import yaml\n",
    "\n",
    "from promg import Configuration, DatabaseConnection, Performance, SemanticHeader, DatasetDescriptions, OcedPg, Query\n",
    "\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "import seaborn as sns\n",
    "\n",
    "pd.set_option('display.width', 2000)\n",
    "%matplotlib inline\n"
   ],
   "outputs": [],
   "execution_count": 1
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T15:24:34.305476500Z",
     "start_time": "2025-11-07T15:24:34.301485100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "case_study = 'bpic14'\n",
    "load = False\n",
    "infer_high_level_events = False\n"
   ],
   "id": "137f9a5f884a4e25",
   "outputs": [],
   "execution_count": 2
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T15:24:34.327782800Z",
     "start_time": "2025-11-07T15:24:34.306477100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "conf_path = Path(case_study, 'config.yaml')\n",
    "config = yaml.safe_load(open(conf_path))\n",
    "\n",
    "print(f\"These are the credentials that I expect to be set for the database.\")\n",
    "print(f\"db_name: {config['db_name']}\")\n",
    "print(f\"uri: {config['uri']}\")\n",
    "print(f\"password: {config['password']}\")\n",
    "print(\"----------------------\")\n",
    "print(f\"If you have other credentials, please change them at: {conf_path}\")"
   ],
   "id": "d721abed68aed975",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "These are the credentials that I expect to be set for the database.\n",
      "db_name: neo4j\n",
      "uri: bolt://localhost:7687\n",
      "password: bpic2014\n",
      "----------------------\n",
      "If you have other credentials, please change them at: bpic14\\config.yaml\n"
     ]
    }
   ],
   "execution_count": 3
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T15:24:34.367443300Z",
     "start_time": "2025-11-07T15:24:34.327782800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "config = Configuration.init_conf_with_config_file(conf_path)\n",
    "db_connection = DatabaseConnection.set_up_connection(config=config)"
   ],
   "id": "78013a03e5232f09",
   "outputs": [],
   "execution_count": 4
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "# Check whether the RELATED_INCIDENT has CI_SC as foreign key.\n",
    "Be more precise, Ava!"
   ],
   "id": "2874a0ca6e1f4e92"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T15:32:27.475063900Z",
     "start_time": "2025-11-07T15:32:24.553848100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query_check_related = '''\n",
    "    MATCH (int:Interaction) - [:RELATED_INCIDENT] -> (inc:Incident)\n",
    "    MATCH (int) - [:AFFECTED_CI_SC] -> (ci_sc_int:CI_SC)\n",
    "    MATCH (inc) - [:AFFECTED_CI_SC] -> (ci_sc_inc:CI_SC)\n",
    "    RETURN ci_sc_int = ci_sc_inc, count(inc)\n",
    "'''\n",
    "\n",
    "pd.DataFrame(db_connection.exec_query(query_check_related))"
   ],
   "id": "8ce6524b0bbd0c3f",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   ci_sc_int = ci_sc_inc  count(inc)\n",
       "0                   True       49006\n",
       "1                  False        1733"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ci_sc_int = ci_sc_inc</th>\n",
       "      <th>count(inc)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>True</td>\n",
       "      <td>49006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>False</td>\n",
       "      <td>1733</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 5
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T15:32:30.247697300Z",
     "start_time": "2025-11-07T15:32:29.857090600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query_check_related = '''\n",
    "    MATCH (int:Interaction) - [:RELATED_INCIDENT] -> (inc:Incident)\n",
    "    MATCH (int) - [:AFFECTED_CI_SC] -> (ci_sc_int:CI_SC)\n",
    "    MATCH (inc) - [:AFFECTED_CI_SC] -> (ci_sc_inc:CI_SC)\n",
    "    WHERE ci_sc_int <> ci_sc_inc\n",
    "    RETURN int.sysId, inc.sysId order by inc.sysId\n",
    "'''\n",
    "\n",
    "pd.DataFrame(db_connection.exec_query(query_check_related))"
   ],
   "id": "9f5afb83c58a4d2c",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "      int.sysId  inc.sysId\n",
       "0     SD0000479  IM0000310\n",
       "1     SD0000504  IM0000328\n",
       "2     SD0000584  IM0000391\n",
       "3     SD0004713  IM0000391\n",
       "4     SD0025853  IM0000393\n",
       "...         ...        ...\n",
       "1728  SD0145941  IM0046710\n",
       "1729  SD0145961  IM0046710\n",
       "1730  SD0146005  IM0046805\n",
       "1731  SD0146833  IM0046857\n",
       "1732  SD0146305  IM0046932\n",
       "\n",
       "[1733 rows x 2 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>int.sysId</th>\n",
       "      <th>inc.sysId</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>SD0000479</td>\n",
       "      <td>IM0000310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>SD0000504</td>\n",
       "      <td>IM0000328</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>SD0000584</td>\n",
       "      <td>IM0000391</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>SD0004713</td>\n",
       "      <td>IM0000391</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>SD0025853</td>\n",
       "      <td>IM0000393</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1728</th>\n",
       "      <td>SD0145941</td>\n",
       "      <td>IM0046710</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1729</th>\n",
       "      <td>SD0145961</td>\n",
       "      <td>IM0046710</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1730</th>\n",
       "      <td>SD0146005</td>\n",
       "      <td>IM0046805</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1731</th>\n",
       "      <td>SD0146833</td>\n",
       "      <td>IM0046857</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1732</th>\n",
       "      <td>SD0146305</td>\n",
       "      <td>IM0046932</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1733 rows × 2 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 6
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "Not all are related",
   "id": "1fac9375dc0397ee"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# Check for PATTERNS",
   "id": "bf725a3ba5d723cf"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Self-contained objects\n",
    "e.g. (Change Start) -> (Change End) for the same Change for single CI_SC"
   ],
   "id": "4dfd1e176b51ca73"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T15:32:49.608481800Z",
     "start_time": "2025-11-07T15:32:34.132187300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "MATCH (hle) - [:DF {objectType: hle.activity}] -> (hle1)\n",
    "MATCH (hle) - [:CORR] -> (ci_sc:CI_SC)\n",
    "MATCH (hle) - [:DF {objectType: 'CI_SC', id: ci_sc.sysId}] -> (hle1)\n",
    "RETURN ci_sc.sysId as sysId, hle.activity as activity, count(hle) as contained ORDER BY sysId\n",
    "\n",
    "'''\n",
    "\n",
    "result = pd.DataFrame(db_connection.exec_query(query))\n",
    "result"
   ],
   "id": "ef7268df6d8f23a5",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                     sysId     activity  contained\n",
       "0           #N/B_WBS000284  Interaction         12\n",
       "1      ACS000001_WBS000252     Incident          1\n",
       "2      ADB000001_WBS000253       Change          2\n",
       "3      ADB000002_WBS000253       Change          1\n",
       "4      ADB000003_WBS000253       Change          2\n",
       "...                    ...          ...        ...\n",
       "13376  ZOS000029_WBS000199       Change          1\n",
       "13377  ZOS000030_WBS000199       Change          1\n",
       "13378  ZOS000031_WBS000199       Change          1\n",
       "13379  ZOS000032_WBS000199       Change          1\n",
       "13380  ZOS000033_WBS000199       Change          1\n",
       "\n",
       "[13381 rows x 3 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>sysId</th>\n",
       "      <th>activity</th>\n",
       "      <th>contained</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>#N/B_WBS000284</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ACS000001_WBS000252</td>\n",
       "      <td>Incident</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ADB000001_WBS000253</td>\n",
       "      <td>Change</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ADB000002_WBS000253</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ADB000003_WBS000253</td>\n",
       "      <td>Change</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13376</th>\n",
       "      <td>ZOS000029_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13377</th>\n",
       "      <td>ZOS000030_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13378</th>\n",
       "      <td>ZOS000031_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13379</th>\n",
       "      <td>ZOS000032_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13380</th>\n",
       "      <td>ZOS000033_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>13381 rows × 3 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 7
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T15:32:52.295020900Z",
     "start_time": "2025-11-07T15:32:49.641882Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "MATCH (hle) - [:DF {objectType: hle.activity}] -> (hle1)\n",
    "MATCH (hle) - [:CORR] -> (ci_sc:CI_SC)\n",
    "RETURN ci_sc.sysId as sysId, hle.activity as activity, count(hle) as events ORDER BY sysId\n",
    "\n",
    "'''\n",
    "\n",
    "result_events = pd.DataFrame(db_connection.exec_query(query))\n",
    "result_events"
   ],
   "id": "ba76c59709a56bd9",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                     sysId     activity  events\n",
       "0           #N/B_WBS000284  Interaction      16\n",
       "1      ACS000001_WBS000252     Incident       1\n",
       "2      ACS000001_WBS000252  Interaction       1\n",
       "3      ADB000001_WBS000253       Change       2\n",
       "4      ADB000002_WBS000253       Change       1\n",
       "...                    ...          ...     ...\n",
       "16108  ZOS000029_WBS000199       Change       1\n",
       "16109  ZOS000030_WBS000199       Change       1\n",
       "16110  ZOS000031_WBS000199       Change       1\n",
       "16111  ZOS000032_WBS000199       Change       1\n",
       "16112  ZOS000033_WBS000199       Change       1\n",
       "\n",
       "[16113 rows x 3 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>sysId</th>\n",
       "      <th>activity</th>\n",
       "      <th>events</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>#N/B_WBS000284</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>16</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ACS000001_WBS000252</td>\n",
       "      <td>Incident</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ACS000001_WBS000252</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ADB000001_WBS000253</td>\n",
       "      <td>Change</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ADB000002_WBS000253</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16108</th>\n",
       "      <td>ZOS000029_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16109</th>\n",
       "      <td>ZOS000030_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16110</th>\n",
       "      <td>ZOS000031_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16111</th>\n",
       "      <td>ZOS000032_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16112</th>\n",
       "      <td>ZOS000033_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>16113 rows × 3 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 8
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T15:32:53.012267500Z",
     "start_time": "2025-11-07T15:32:52.992746900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "combined_result = result.merge(result_events, on=['sysId', 'activity'])\n",
    "combined_result['%'] = round(combined_result['contained']/combined_result['events']*100, 2)\n",
    "combined_result"
   ],
   "id": "4c1989a3f74314f8",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                     sysId     activity  contained  events      %\n",
       "0           #N/B_WBS000284  Interaction         12      16   75.0\n",
       "1      ACS000001_WBS000252     Incident          1       1  100.0\n",
       "2      ADB000001_WBS000253       Change          2       2  100.0\n",
       "3      ADB000002_WBS000253       Change          1       1  100.0\n",
       "4      ADB000003_WBS000253       Change          2       2  100.0\n",
       "...                    ...          ...        ...     ...    ...\n",
       "13376  ZOS000029_WBS000199       Change          1       1  100.0\n",
       "13377  ZOS000030_WBS000199       Change          1       1  100.0\n",
       "13378  ZOS000031_WBS000199       Change          1       1  100.0\n",
       "13379  ZOS000032_WBS000199       Change          1       1  100.0\n",
       "13380  ZOS000033_WBS000199       Change          1       1  100.0\n",
       "\n",
       "[13381 rows x 5 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>sysId</th>\n",
       "      <th>activity</th>\n",
       "      <th>contained</th>\n",
       "      <th>events</th>\n",
       "      <th>%</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>#N/B_WBS000284</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>12</td>\n",
       "      <td>16</td>\n",
       "      <td>75.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ACS000001_WBS000252</td>\n",
       "      <td>Incident</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>100.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ADB000001_WBS000253</td>\n",
       "      <td>Change</td>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>100.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ADB000002_WBS000253</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>100.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ADB000003_WBS000253</td>\n",
       "      <td>Change</td>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>100.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13376</th>\n",
       "      <td>ZOS000029_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>100.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13377</th>\n",
       "      <td>ZOS000030_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>100.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13378</th>\n",
       "      <td>ZOS000031_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>100.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13379</th>\n",
       "      <td>ZOS000032_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>100.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13380</th>\n",
       "      <td>ZOS000033_WBS000199</td>\n",
       "      <td>Change</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>100.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>13381 rows × 5 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 9
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T15:32:53.138329800Z",
     "start_time": "2025-11-07T15:32:53.052569500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Pivot the DataFrame\n",
    "pivot_df = combined_result.pivot(\n",
    "    index=['sysId'],\n",
    "    columns='activity',\n",
    "    values=['contained', 'events', '%']\n",
    ").reset_index()\n",
    "\n",
    "columns = [pivot_df.columns[0]]\n",
    "for object_type in ['Change', 'Incident', 'Interaction']:\n",
    "    columns.extend([('contained', object_type), ('events', object_type), ('%', object_type)])\n",
    "\n",
    "pivot_df = pivot_df[columns]\n",
    "pivot_df = pivot_df.fillna(0)\n",
    "pivot_df"
   ],
   "id": "8e9d7f6d2ae559e7",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                        sysId contained events      % contained   events        %   contained      events           %\n",
       "activity                         Change Change Change  Incident Incident Incident Interaction Interaction Interaction\n",
       "0              #N/B_WBS000284       0.0    0.0    0.0       0.0      0.0      0.0        12.0        16.0        75.0\n",
       "1         ACS000001_WBS000252       0.0    0.0    0.0       1.0      1.0    100.0         0.0         0.0         0.0\n",
       "2         ADB000001_WBS000253       2.0    2.0  100.0       0.0      0.0      0.0         0.0         0.0         0.0\n",
       "3         ADB000002_WBS000253       1.0    1.0  100.0       0.0      0.0      0.0         0.0         0.0         0.0\n",
       "4         ADB000003_WBS000253       2.0    2.0  100.0       0.0      0.0      0.0         0.0         0.0         0.0\n",
       "...                       ...       ...    ...    ...       ...      ...      ...         ...         ...         ...\n",
       "12267     ZOS000029_WBS000199       1.0    1.0  100.0       0.0      0.0      0.0         0.0         0.0         0.0\n",
       "12268     ZOS000030_WBS000199       1.0    1.0  100.0       0.0      0.0      0.0         0.0         0.0         0.0\n",
       "12269     ZOS000031_WBS000199       1.0    1.0  100.0       0.0      0.0      0.0         0.0         0.0         0.0\n",
       "12270     ZOS000032_WBS000199       1.0    1.0  100.0       0.0      0.0      0.0         0.0         0.0         0.0\n",
       "12271     ZOS000033_WBS000199       1.0    1.0  100.0       0.0      0.0      0.0         0.0         0.0         0.0\n",
       "\n",
       "[12272 rows x 10 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead tr th {\n",
       "        text-align: left;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr>\n",
       "      <th></th>\n",
       "      <th>sysId</th>\n",
       "      <th>contained</th>\n",
       "      <th>events</th>\n",
       "      <th>%</th>\n",
       "      <th>contained</th>\n",
       "      <th>events</th>\n",
       "      <th>%</th>\n",
       "      <th>contained</th>\n",
       "      <th>events</th>\n",
       "      <th>%</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>activity</th>\n",
       "      <th></th>\n",
       "      <th>Change</th>\n",
       "      <th>Change</th>\n",
       "      <th>Change</th>\n",
       "      <th>Incident</th>\n",
       "      <th>Incident</th>\n",
       "      <th>Incident</th>\n",
       "      <th>Interaction</th>\n",
       "      <th>Interaction</th>\n",
       "      <th>Interaction</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>#N/B_WBS000284</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>12.0</td>\n",
       "      <td>16.0</td>\n",
       "      <td>75.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ACS000001_WBS000252</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>100.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>ADB000001_WBS000253</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>100.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>ADB000002_WBS000253</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>100.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>ADB000003_WBS000253</td>\n",
       "      <td>2.0</td>\n",
       "      <td>2.0</td>\n",
       "      <td>100.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12267</th>\n",
       "      <td>ZOS000029_WBS000199</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>100.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12268</th>\n",
       "      <td>ZOS000030_WBS000199</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>100.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12269</th>\n",
       "      <td>ZOS000031_WBS000199</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>100.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12270</th>\n",
       "      <td>ZOS000032_WBS000199</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>100.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12271</th>\n",
       "      <td>ZOS000033_WBS000199</td>\n",
       "      <td>1.0</td>\n",
       "      <td>1.0</td>\n",
       "      <td>100.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "      <td>0.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>12272 rows × 10 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 10
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:36:30.823607600Z",
     "start_time": "2025-11-06T14:36:27.233965300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "MATCH (hle:HighLevelEvent) - [:DF {objectType: hle.activity}] -> (activity_hle:HighLevelEvent)\n",
    "MATCH (hle) - [:DF {objectType: 'CI_SC'}] -> (other_hle)\n",
    "MATCH (hle) - [:CORR] -> (n) - [:IS_OF_TYPE] - (ot:ObjectType {objectType: hle.activity})\n",
    "WHERE activity_hle <> other_hle\n",
    "SET n.self_contained = False\n",
    "RETURN hle.activity as activity, count(distinct n) as not_self_contained\n",
    "'''\n",
    "\n",
    "result_not_contained_objects = pd.DataFrame(db_connection.exec_query(query))\n",
    "result_not_contained_objects"
   ],
   "id": "22d6f1ab316516af",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "      activity  not_self_contained\n",
       "0     Incident               40396\n",
       "1  Interaction               79423\n",
       "2       Change                6233"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>activity</th>\n",
       "      <th>not_self_contained</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Incident</td>\n",
       "      <td>40396</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>79423</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Change</td>\n",
       "      <td>6233</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 81,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 81
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:36:31.758623200Z",
     "start_time": "2025-11-06T14:36:30.881682500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "MATCH (hle:HighLevelEvent) - [:CORR] -> (n) - [:IS_OF_TYPE] - (ot:ObjectType {objectType: hle.activity})\n",
    "WHERE n.self_contained IS NULL OR n.self_contained = True\n",
    "SET n.self_contained = True\n",
    "RETURN hle.activity as activity, count(distinct n) as self_contained\n",
    "'''\n",
    "\n",
    "result_contained_objects = pd.DataFrame(db_connection.exec_query(query))\n",
    "result_contained_objects"
   ],
   "id": "c32241fa5831ba78",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "      activity  self_contained\n",
       "0     Incident            5972\n",
       "1  Interaction           67130\n",
       "2       Change           10378"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>activity</th>\n",
       "      <th>self_contained</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Incident</td>\n",
       "      <td>5972</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>67130</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Change</td>\n",
       "      <td>10378</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 82,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 82
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:37:29.584138800Z",
     "start_time": "2025-11-06T14:37:29.556575600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "result_objects = result_contained_objects.merge(result_not_contained_objects, on='activity')\n",
    "result_objects['sum_total'] = result_objects['self_contained'] + result_objects['not_self_contained']\n",
    "result_objects['% contained'] = round(result_objects['self_contained']/result_objects['sum_total']*100,2)\n",
    "result_objects"
   ],
   "id": "9ad723034285dffc",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "      activity  self_contained  not_self_contained  sum_total  % contained\n",
       "0     Incident            5972               40396      46368        12.88\n",
       "1  Interaction           67130               79423     146553        45.81\n",
       "2       Change           10378                6233      16611        62.48"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>activity</th>\n",
       "      <th>self_contained</th>\n",
       "      <th>not_self_contained</th>\n",
       "      <th>sum_total</th>\n",
       "      <th>% contained</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Incident</td>\n",
       "      <td>5972</td>\n",
       "      <td>40396</td>\n",
       "      <td>46368</td>\n",
       "      <td>12.88</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>67130</td>\n",
       "      <td>79423</td>\n",
       "      <td>146553</td>\n",
       "      <td>45.81</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Change</td>\n",
       "      <td>10378</td>\n",
       "      <td>6233</td>\n",
       "      <td>16611</td>\n",
       "      <td>62.48</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 85,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 85
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "# Overlapping activities\n",
    "e.g. (Start Incident) -> (Start Interaction) -> (End Incident) -> (End Interaction)\n",
    "for single CI_SC"
   ],
   "id": "cfee0b0df6da7f96"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:48:59.421889400Z",
     "start_time": "2025-11-06T14:48:55.166741200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "MATCH (hle) - [:DF {objectType: hle.activity}] -> (hle3)\n",
    "MATCH (hle2) - [:DF {objectType: hle2.activity}] -> (hle4)\n",
    "MATCH (hle:HighLevelEvent) - [df:DF  {objectType: 'CI_SC'}] -> (hle2:HighLevelEvent)\n",
    "- [:DF  {objectType: 'CI_SC', id:df.id}] -> (hle3:HighLevelEvent)\n",
    "- [:DF  {objectType: 'CI_SC', id:df.id}] -> (hle4:HighLevelEvent)\n",
    "MATCH (hle) - [:CORR] -> (n) - [:IS_OF_TYPE] - (:ObjectType {objectType: hle.activity})\n",
    "MATCH (hle2) - [:CORR] -> (n2) - [:IS_OF_TYPE] - (:ObjectType {objectType: hle2.activity})\n",
    "SET n.overlapped = True\n",
    "SET n2.overlapped = True\n",
    "RETURN hle.activity as activity, hle2.activity as second_activity, count(distinct n) as overlapped\n",
    "'''\n",
    "\n",
    "overlapped_objects = pd.DataFrame(db_connection.exec_query(query))\n",
    "overlapped_objects"
   ],
   "id": "c9e13719a91c60a4",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "      activity second_activity  overlapped\n",
       "0  Interaction        Incident        3863\n",
       "1     Incident        Incident          14\n",
       "2       Change        Incident           1\n",
       "3     Incident     Interaction          14\n",
       "4  Interaction     Interaction        2241\n",
       "5       Change     Interaction           2\n",
       "6       Change          Change         131\n",
       "7  Interaction          Change           5"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>activity</th>\n",
       "      <th>second_activity</th>\n",
       "      <th>overlapped</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>Incident</td>\n",
       "      <td>3863</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Incident</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Change</td>\n",
       "      <td>Incident</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>2241</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Change</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Change</td>\n",
       "      <td>Change</td>\n",
       "      <td>131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>Change</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 88,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 88
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:52:10.059486700Z",
     "start_time": "2025-11-06T14:52:07.889682700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "MATCH (hle:HighLevelEvent) - [:CORR] -> (n) - [:IS_OF_TYPE] - (ot:ObjectType {objectType: hle.activity})\n",
    "WHERE n.overlapped IS NULL OR n.overlapped = False\n",
    "SET n.overlapped = False\n",
    "RETURN hle.activity as activity, count(distinct n) as not_overlapped\n",
    "'''\n",
    "\n",
    "pd.DataFrame(db_connection.exec_query(query))"
   ],
   "id": "24e06d75f91b2dcf",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "      activity  not_overlapped\n",
       "0     Incident           42462\n",
       "1  Interaction          138187\n",
       "2       Change           16344"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>activity</th>\n",
       "      <th>not_overlapped</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Incident</td>\n",
       "      <td>42462</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>138187</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Change</td>\n",
       "      <td>16344</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 89,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 89
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T14:53:04.623638200Z",
     "start_time": "2025-11-06T14:53:03.959930100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "MATCH (n) <- [:CORR] - (:HighLevelEvent)\n",
    "MATCH (n) - [:IS_OF_TYPE] - (ot:ObjectType)\n",
    "WHERE ot.objectType IN ['Change', 'Incident', 'Interaction']\n",
    "RETURN  ot.objectType as objectType, n.self_contained as self_contained, n.overlapped as overlapped, count(n) as count ORDER BY objectType, self_contained, overlapped\n",
    "'''\n",
    "pd.DataFrame(db_connection.exec_query(query))"
   ],
   "id": "eb73cc1e21c4d9ce",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "    objectType  self_contained  overlapped   count\n",
       "0       Change           False       False   11932\n",
       "1       Change           False        True     534\n",
       "2       Change            True       False   20751\n",
       "3     Incident           False       False   72980\n",
       "4     Incident           False        True    7812\n",
       "5     Incident            True       False   11944\n",
       "6  Interaction           False       False  142114\n",
       "7  Interaction           False        True   16732\n",
       "8  Interaction            True       False  134260"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>objectType</th>\n",
       "      <th>self_contained</th>\n",
       "      <th>overlapped</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Change</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>11932</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Change</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>534</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Change</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>20751</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Incident</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>72980</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Incident</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>7812</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Incident</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>11944</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>142114</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>16732</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>134260</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 92,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 92
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "# Enclosing objects\n",
    "e.g. (Start Incident) -> (Start Interaction) -> (End Interaction) -> (End Incident)\n",
    "for single CI_SC"
   ],
   "id": "5c7427044846866d"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T15:11:59.302958100Z",
     "start_time": "2025-11-06T15:09:25.986108300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "enclosing_objects = []\n",
    "\n",
    "for i in range(1, 20):\n",
    "    query = '''\n",
    "    MATCH (hle) - [:DF {objectType: hle.activity}] -> (hle4)\n",
    "    MATCH (hle2) - [:DF {objectType: hle2.activity}] -> (hle3)\n",
    "    MATCH (hle:HighLevelEvent) - [df:DF  {objectType: 'CI_SC'}] -> (hle2:HighLevelEvent)\n",
    "    - [:DF*$i  {objectType: 'CI_SC', id:df.id}] -> (hle3:HighLevelEvent)\n",
    "    - [:DF  {objectType: 'CI_SC', id:df.id}] -> (hle4:HighLevelEvent)\n",
    "    MATCH (hle) - [:CORR] -> (n) - [:IS_OF_TYPE] - (:ObjectType {objectType: hle.activity})\n",
    "    SET n.enclosing = True\n",
    "    RETURN hle.activity as activity, hle2.activity as second_activity, count(distinct n) as enclosing\n",
    "    '''\n",
    "\n",
    "    query = Query(\n",
    "        query_str=query,\n",
    "        template_string_parameters={'i': i}\n",
    "    )\n",
    "\n",
    "    enclosing_object = db_connection.exec_query(query)\n",
    "    enclosing_objects.extend(enclosing_object)\n",
    "    print(f\"Fixed {i} iteration, found {sum([object['enclosing'] for object in enclosing_object])} objects\")\n",
    "\n",
    "result = pd.DataFrame(enclosing_objects)\n"
   ],
   "id": "3e413384279a46c8",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Fixed 1 iteration, found 8804 objects\n",
      "Fixed 2 iteration, found 807 objects\n",
      "Fixed 3 iteration, found 1755 objects\n",
      "Fixed 4 iteration, found 322 objects\n",
      "Fixed 5 iteration, found 921 objects\n",
      "Fixed 6 iteration, found 226 objects\n",
      "Fixed 7 iteration, found 603 objects\n",
      "Fixed 8 iteration, found 172 objects\n",
      "Fixed 9 iteration, found 434 objects\n",
      "Fixed 10 iteration, found 128 objects\n",
      "Fixed 11 iteration, found 351 objects\n",
      "Fixed 12 iteration, found 152 objects\n",
      "Fixed 13 iteration, found 276 objects\n",
      "Fixed 14 iteration, found 115 objects\n",
      "Fixed 15 iteration, found 251 objects\n",
      "Fixed 16 iteration, found 100 objects\n",
      "Fixed 17 iteration, found 204 objects\n",
      "Fixed 18 iteration, found 81 objects\n",
      "Fixed 19 iteration, found 164 objects\n"
     ]
    }
   ],
   "execution_count": 109
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T15:12:09.935724200Z",
     "start_time": "2025-11-06T15:12:09.885860Z"
    }
   },
   "cell_type": "code",
   "source": [
    "result = pd.pivot_table(\n",
    "    result,\n",
    "    index=['activity', 'second_activity'],\n",
    "    aggfunc='sum'\n",
    ")\n",
    "result"
   ],
   "id": "35941dbc0d3dd4ca",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                             enclosing\n",
       "activity    second_activity           \n",
       "Change      Change                 379\n",
       "            Incident                 1\n",
       "            Interaction             41\n",
       "Incident    Change                  31\n",
       "            Incident                86\n",
       "            Interaction            858\n",
       "Interaction Change                   7\n",
       "            Incident             10655\n",
       "            Interaction           3808"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th>enclosing</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>activity</th>\n",
       "      <th>second_activity</th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th rowspan=\"3\" valign=\"top\">Change</th>\n",
       "      <th>Change</th>\n",
       "      <td>379</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Incident</th>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Interaction</th>\n",
       "      <td>41</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"3\" valign=\"top\">Incident</th>\n",
       "      <th>Change</th>\n",
       "      <td>31</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Incident</th>\n",
       "      <td>86</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Interaction</th>\n",
       "      <td>858</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"3\" valign=\"top\">Interaction</th>\n",
       "      <th>Change</th>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Incident</th>\n",
       "      <td>10655</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Interaction</th>\n",
       "      <td>3808</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 110,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 110
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T15:12:38.890461200Z",
     "start_time": "2025-11-06T15:12:38.216998500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "MATCH (n) <- [:CORR] - (:HighLevelEvent)\n",
    "MATCH (n) - [:IS_OF_TYPE] - (ot:ObjectType)\n",
    "WHERE ot.objectType IN ['Change', 'Incident', 'Interaction']\n",
    "RETURN  ot.objectType as objectType, n.self_contained as self_contained, n.overlapped as overlapped, n.enclosing as enclosing, count(n) as count ORDER BY objectType, self_contained, overlapped\n",
    "'''\n",
    "pd.DataFrame(db_connection.exec_query(query))"
   ],
   "id": "c30dc5606c9a302a",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "     objectType  self_contained  overlapped enclosing   count\n",
       "0        Change           False       False      None   11102\n",
       "1        Change           False       False      True     830\n",
       "2        Change           False        True      None     528\n",
       "3        Change           False        True      True       6\n",
       "4        Change            True       False      None   20751\n",
       "5      Incident           False       False      None   71030\n",
       "6      Incident           False       False      True    1950\n",
       "7      Incident           False        True      None    7812\n",
       "8      Incident            True       False      None   11944\n",
       "9   Interaction           False       False      None  113174\n",
       "10  Interaction           False       False      True   28940\n",
       "11  Interaction           False        True      None   16732\n",
       "12  Interaction            True       False      None  134260"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>objectType</th>\n",
       "      <th>self_contained</th>\n",
       "      <th>overlapped</th>\n",
       "      <th>enclosing</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Change</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>None</td>\n",
       "      <td>11102</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Change</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>830</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Change</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>None</td>\n",
       "      <td>528</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Change</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Change</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>None</td>\n",
       "      <td>20751</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Incident</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>None</td>\n",
       "      <td>71030</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Incident</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>1950</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Incident</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>None</td>\n",
       "      <td>7812</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Incident</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>None</td>\n",
       "      <td>11944</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>None</td>\n",
       "      <td>113174</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>False</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>28940</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>False</td>\n",
       "      <td>True</td>\n",
       "      <td>None</td>\n",
       "      <td>16732</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>True</td>\n",
       "      <td>False</td>\n",
       "      <td>None</td>\n",
       "      <td>134260</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 111,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 111
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# CREATE CONTAINMENT GRAPH",
   "id": "d2202675d0030df0"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "# build index for high-level events\n",
    "qCreateIndexHLE_sys = f'''\n",
    "    CREATE INDEX higherLevelEventSysIdIndex IF NOT EXISTS FOR (h:HigherLevelEvent) ON (h.sysId);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_sys)\n",
    "\n",
    "qCreateIndexHLE_start = f'''\n",
    "    CREATE INDEX higherLevelEventStartTimeIndex IF NOT EXISTS FOR (h:HigherLevelEvent) ON (h.startTime);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_start)\n",
    "qCreateIndexHLE_end = f'''\n",
    "    CREATE INDEX higherLevelEventEndTimeIndex IF NOT EXISTS FOR (h:HigherLevelEvent) ON (h.endTime);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_end)\n"
   ],
   "id": "c9f5e845e1a60b35"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T15:48:37.732547500Z",
     "start_time": "2025-11-07T15:48:31.220203200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    ":auto\n",
    "    MATCH (hle_start:HighLevelEvent) - [:DF {objectType: hle_start.activity}] -> (hle_end:HighLevelEvent)\n",
    "    WHERE NOT EXISTS ((hle_start) <- [:CONTAINS] - (:HigherLevelEvent))\n",
    "    CALL (hle_start, hle_end) {\n",
    "        CREATE (hler:HigherLevelEvent {sysId: \"HLE_\" + hle_start.sysId + \"_\" + hle_end.sysId, activity: hle_start.activity, startTime: hle_start.timestamp, endTime: hle_end.timestamp})\n",
    "        CREATE (hler) - [:CONTAINS] -> (hle_start)\n",
    "        CREATE (hler) - [:CONTAINS] -> (hle_end)\n",
    "    } IN TRANSACTIONS\n",
    "    RETURN hle_start.activity, count(hle_start)\n",
    "'''\n",
    "db_connection.exec_query(query)"
   ],
   "id": "1bf386089ad06a64",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'hle_start.activity': 'Change', 'count(hle_start)': 16606},\n",
       " {'hle_start.activity': 'Incident', 'count(hle_start)': 46368},\n",
       " {'hle_start.activity': 'Interaction', 'count(hle_start)': 146553}]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 16
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T19:36:07.985616400Z",
     "start_time": "2025-11-07T19:36:00.205586Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    ":auto\n",
    "MATCH (hler:HigherLevelEvent) - [:CONTAINS] -> (hle_start) - [df_act:DF {objectType: hle_start.activity}] -> (hle_end:HighLevelEvent)\n",
    "MATCH (hle_prev) - [df:DF {objectType: 'CI_SC'}] -> (hle_start)\n",
    "MATCH (hle_prev) - [df_act_other {objectType: hle_prev.activity}] - (hle_prev2)\n",
    "WITH hler, hle_start, hle_end, hle_prev, hle_prev2, df, CASE\n",
    "// hle_prev.timestamp <= hle_start.timestamp per definition (and hle_prev2 cannot be between hle_prev and hle_start, so no hle_prev < hle_prev2 < hle_start)\n",
    "WHEN hle_prev2.timestamp <= hle_prev.timestamp THEN 'precedes' // both events happen before hle: hle_prev2 < hle_prev < hle_start < hle_end\n",
    "// hle_prev_2 happens after hle_prev, and therefore after hle_start\n",
    "WHEN hle_end.timestamp <= hle_prev2.timestamp THEN 'contains' // hle is contained in hle_prev: hle_prev < hle_start < hle_end < hle_prev2\n",
    "WHEN hle_prev2.timestamp < hle_end.timestamp THEN 'overlaps' // hle overlaps with hle_prev: hle_prev < hle_start < hle_prev2 < hle_end\n",
    "ELSE 'undefined'\n",
    "END AS transition_type\n",
    "MATCH (prev_hler:HigherLevelEvent) - [:CONTAINS] -> (hle_prev)\n",
    "CALL (prev_hler, hler, df, transition_type) {\n",
    "    MERGE (prev_hler) - [new_df:DF {objectType: 'CI_SC', id: df.id}] -> (hler)\n",
    "    SET new_df.type = transition_type\n",
    "} IN TRANSACTIONS\n",
    "RETURN transition_type, count(prev_hler)\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(query)"
   ],
   "id": "138df2e5c55aefa",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'transition_type': 'precedes', 'count(prev_hler)': 117323},\n",
       " {'transition_type': 'contains', 'count(prev_hler)': 51146},\n",
       " {'transition_type': 'overlaps', 'count(prev_hler)': 38219}]"
      ]
     },
     "execution_count": 98,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 98
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T16:25:21.965182400Z",
     "start_time": "2025-11-07T16:25:16.741289700Z"
    }
   },
   "cell_type": "code",
   "source": "",
   "id": "b2a550c52b5c6994",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'transition_type': 'contains', 'count(next_hler)': 67049},\n",
       " {'transition_type': 'overlaps', 'count(next_hler)': 30161}]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 26
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T15:56:56.208604Z",
     "start_time": "2025-11-06T15:56:50.923474600Z"
    }
   },
   "cell_type": "code",
   "source": "",
   "id": "e70b0cd1bf6403ba",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 120,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 120
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T18:39:45.719161600Z",
     "start_time": "2025-11-07T18:39:43.298865500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    ":auto\n",
    "MATCH (hler1:HigherLevelEvent) - [df:DF {objectType: 'CI_SC'}] -> (hler2:HigherLevelEvent)\n",
    "RETURN hler1.activity as first_activity, hler2.activity as second_activity, df.type as type, count(df) as count order by type, count desc\n",
    "'''\n",
    "pd.DataFrame(db_connection.exec_query(query))"
   ],
   "id": "e0eb83a83fc250a5",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "   first_activity second_activity      type  count\n",
       "0     Interaction        Incident  contains  18329\n",
       "1        Incident     Interaction  contains  15302\n",
       "2     Interaction     Interaction  contains  14254\n",
       "3        Incident        Incident  contains   1552\n",
       "4          Change          Change  contains   1058\n",
       "5        Incident          Change  contains    348\n",
       "6          Change     Interaction  contains    207\n",
       "7     Interaction          Change  contains     87\n",
       "8          Change        Incident  contains      9\n",
       "9     Interaction        Incident  overlaps  18059\n",
       "10    Interaction     Interaction  overlaps  11720\n",
       "11       Incident     Interaction  overlaps   6026\n",
       "12       Incident        Incident  overlaps   1912\n",
       "13         Change          Change  overlaps    353\n",
       "14         Change     Interaction  overlaps     66\n",
       "15       Incident          Change  overlaps     48\n",
       "16    Interaction          Change  overlaps     22\n",
       "17         Change        Incident  overlaps     13\n",
       "18    Interaction     Interaction  precedes  82398\n",
       "19         Change          Change  precedes  14679\n",
       "20       Incident     Interaction  precedes  11201\n",
       "21    Interaction        Incident  precedes   4698\n",
       "22         Change     Interaction  precedes   1543\n",
       "23       Incident        Incident  precedes   1144\n",
       "24    Interaction          Change  precedes   1133\n",
       "25       Incident          Change  precedes    440\n",
       "26         Change        Incident  precedes     87"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>first_activity</th>\n",
       "      <th>second_activity</th>\n",
       "      <th>type</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>Incident</td>\n",
       "      <td>contains</td>\n",
       "      <td>18329</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>contains</td>\n",
       "      <td>15302</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>contains</td>\n",
       "      <td>14254</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Incident</td>\n",
       "      <td>contains</td>\n",
       "      <td>1552</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Change</td>\n",
       "      <td>Change</td>\n",
       "      <td>contains</td>\n",
       "      <td>1058</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Change</td>\n",
       "      <td>contains</td>\n",
       "      <td>348</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Change</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>contains</td>\n",
       "      <td>207</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>Change</td>\n",
       "      <td>contains</td>\n",
       "      <td>87</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Change</td>\n",
       "      <td>Incident</td>\n",
       "      <td>contains</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>Incident</td>\n",
       "      <td>overlaps</td>\n",
       "      <td>18059</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>overlaps</td>\n",
       "      <td>11720</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>overlaps</td>\n",
       "      <td>6026</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Incident</td>\n",
       "      <td>overlaps</td>\n",
       "      <td>1912</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Change</td>\n",
       "      <td>Change</td>\n",
       "      <td>overlaps</td>\n",
       "      <td>353</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Change</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>overlaps</td>\n",
       "      <td>66</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Change</td>\n",
       "      <td>overlaps</td>\n",
       "      <td>48</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>Change</td>\n",
       "      <td>overlaps</td>\n",
       "      <td>22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Change</td>\n",
       "      <td>Incident</td>\n",
       "      <td>overlaps</td>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>precedes</td>\n",
       "      <td>82398</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Change</td>\n",
       "      <td>Change</td>\n",
       "      <td>precedes</td>\n",
       "      <td>14679</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>precedes</td>\n",
       "      <td>11201</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>Incident</td>\n",
       "      <td>precedes</td>\n",
       "      <td>4698</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Change</td>\n",
       "      <td>Interaction</td>\n",
       "      <td>precedes</td>\n",
       "      <td>1543</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Incident</td>\n",
       "      <td>precedes</td>\n",
       "      <td>1144</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>Change</td>\n",
       "      <td>precedes</td>\n",
       "      <td>1133</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Incident</td>\n",
       "      <td>Change</td>\n",
       "      <td>precedes</td>\n",
       "      <td>440</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Change</td>\n",
       "      <td>Incident</td>\n",
       "      <td>precedes</td>\n",
       "      <td>87</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 33
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T19:08:38.302833500Z",
     "start_time": "2025-11-07T19:08:37.521106200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    ":auto\n",
    "MATCH (hler1:HigherLevelEvent) - [df:DF {objectType: 'CI_SC'}] -> (hler2:HigherLevelEvent)\n",
    "MATCH (ci_sc:CI_SC {sysId:df.id})\n",
    "RETURN ci_sc.type as type, ci_sc.subtype as subtype, count(distinct ci_sc) as num_ci\n",
    "'''\n",
    "total_result = pd.DataFrame(db_connection.exec_query(query))\n",
    "total_result"
   ],
   "id": "661a7dbe82da853",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                 type                   subtype  num_ci\n",
       "0   networkcomponents                    Switch     225\n",
       "1         application  Server Based Application     592\n",
       "2            software           System Software     223\n",
       "3            database               RAC Service      80\n",
       "4            computer              Linux Server     602\n",
       "..                ...                       ...     ...\n",
       "82            storage       Virtual Tape Server       1\n",
       "83           computer          NonStop Harddisk       2\n",
       "84           computer           NonStop Storage       1\n",
       "85               #N/B                      #N/B       1\n",
       "86           software          Sealbag Software       1\n",
       "\n",
       "[87 rows x 3 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>type</th>\n",
       "      <th>subtype</th>\n",
       "      <th>num_ci</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>networkcomponents</td>\n",
       "      <td>Switch</td>\n",
       "      <td>225</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>application</td>\n",
       "      <td>Server Based Application</td>\n",
       "      <td>592</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>software</td>\n",
       "      <td>System Software</td>\n",
       "      <td>223</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>database</td>\n",
       "      <td>RAC Service</td>\n",
       "      <td>80</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>computer</td>\n",
       "      <td>Linux Server</td>\n",
       "      <td>602</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>82</th>\n",
       "      <td>storage</td>\n",
       "      <td>Virtual Tape Server</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>83</th>\n",
       "      <td>computer</td>\n",
       "      <td>NonStop Harddisk</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>84</th>\n",
       "      <td>computer</td>\n",
       "      <td>NonStop Storage</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>85</th>\n",
       "      <td>#N/B</td>\n",
       "      <td>#N/B</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>86</th>\n",
       "      <td>software</td>\n",
       "      <td>Sealbag Software</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>87 rows × 3 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 80,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 80
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T19:08:40.279284800Z",
     "start_time": "2025-11-07T19:08:40.220351400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    ":auto\n",
    "MATCH (hler1:HigherLevelEvent) - [df:DF {objectType: 'CI_SC'}] -> (hler2:HigherLevelEvent)\n",
    "WHERE hler1.activity <> 'Change' AND hler2.activity = 'Change' AND df.type = 'contains'\n",
    "WITH hler1, df, hler2\n",
    "MATCH (ci_sc:CI_SC {sysId: df.id})\n",
    "RETURN ci_sc.type as type, ci_sc.subtype as subtype, count(distinct ci_sc) as contained\n",
    "'''\n",
    "result = pd.DataFrame(db_connection.exec_query(query))\n",
    "# result\n",
    "total_result = total_result.merge(result, on=['type', 'subtype'])\n",
    "total_result"
   ],
   "id": "d343df48550c5b62",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                 type                   subtype  num_ci  contained\n",
       "0         application  Server Based Application     592         70\n",
       "1            software           System Software     223          2\n",
       "2            computer              Linux Server     602          1\n",
       "3            software       Automation Software      22          2\n",
       "4         application     Web Based Application     112         25\n",
       "5            computer            Windows Server     907          5\n",
       "6         application       Desktop Application     273          8\n",
       "7   networkcomponents         Network Component     176          1\n",
       "8            hardware       DataCenterEquipment      95          4\n",
       "9   networkcomponents                  Protocol       2          1\n",
       "10        application                    Citrix      10          2\n",
       "11           computer               Unix Server     245          1\n",
       "12     subapplication  Server Based Application     186          6\n",
       "13  networkcomponents                Net Device      18          1\n",
       "14     subapplication     Web Based Application      75          5\n",
       "15           computer            NonStop Server      20          1\n",
       "16        application                       SAP       6          2\n",
       "17            storage                Controller      64          1\n",
       "18        application           SharePoint Farm      16          1\n",
       "19           computer               ESX Cluster      56          2\n",
       "20        application                  Exchange       4          1\n",
       "21     subapplication                    Citrix       4          1\n",
       "22           computer                    Laptop     685          8\n",
       "23           computer                   Desktop     195          1\n",
       "24           computer                zOS Server      23          1\n",
       "25        application  Client Based Application      10          1\n",
       "26            no type                no subtype      17          1"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>type</th>\n",
       "      <th>subtype</th>\n",
       "      <th>num_ci</th>\n",
       "      <th>contained</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>application</td>\n",
       "      <td>Server Based Application</td>\n",
       "      <td>592</td>\n",
       "      <td>70</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>software</td>\n",
       "      <td>System Software</td>\n",
       "      <td>223</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>computer</td>\n",
       "      <td>Linux Server</td>\n",
       "      <td>602</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>software</td>\n",
       "      <td>Automation Software</td>\n",
       "      <td>22</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>application</td>\n",
       "      <td>Web Based Application</td>\n",
       "      <td>112</td>\n",
       "      <td>25</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>computer</td>\n",
       "      <td>Windows Server</td>\n",
       "      <td>907</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>application</td>\n",
       "      <td>Desktop Application</td>\n",
       "      <td>273</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>networkcomponents</td>\n",
       "      <td>Network Component</td>\n",
       "      <td>176</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>hardware</td>\n",
       "      <td>DataCenterEquipment</td>\n",
       "      <td>95</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>networkcomponents</td>\n",
       "      <td>Protocol</td>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>application</td>\n",
       "      <td>Citrix</td>\n",
       "      <td>10</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>computer</td>\n",
       "      <td>Unix Server</td>\n",
       "      <td>245</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>subapplication</td>\n",
       "      <td>Server Based Application</td>\n",
       "      <td>186</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>networkcomponents</td>\n",
       "      <td>Net Device</td>\n",
       "      <td>18</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>subapplication</td>\n",
       "      <td>Web Based Application</td>\n",
       "      <td>75</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>computer</td>\n",
       "      <td>NonStop Server</td>\n",
       "      <td>20</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>application</td>\n",
       "      <td>SAP</td>\n",
       "      <td>6</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>storage</td>\n",
       "      <td>Controller</td>\n",
       "      <td>64</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>application</td>\n",
       "      <td>SharePoint Farm</td>\n",
       "      <td>16</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>computer</td>\n",
       "      <td>ESX Cluster</td>\n",
       "      <td>56</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>application</td>\n",
       "      <td>Exchange</td>\n",
       "      <td>4</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>subapplication</td>\n",
       "      <td>Citrix</td>\n",
       "      <td>4</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>computer</td>\n",
       "      <td>Laptop</td>\n",
       "      <td>685</td>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>computer</td>\n",
       "      <td>Desktop</td>\n",
       "      <td>195</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>computer</td>\n",
       "      <td>zOS Server</td>\n",
       "      <td>23</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>application</td>\n",
       "      <td>Client Based Application</td>\n",
       "      <td>10</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>no type</td>\n",
       "      <td>no subtype</td>\n",
       "      <td>17</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 81,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 81
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T18:52:18.759099400Z",
     "start_time": "2025-11-07T18:52:18.722646200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    ":auto\n",
    "MATCH (ci_sc:CI_SC )\n",
    "RETURN count(ci_sc)\n",
    "'''\n",
    "db_connection.exec_query(query)"
   ],
   "id": "ac50474678d7ae25",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'count(ci_sc)': 15307}]"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 40
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T19:05:48.436776Z",
     "start_time": "2025-11-07T19:05:47.708976Z"
    }
   },
   "cell_type": "code",
   "source": "",
   "id": "a7264d93fc247be4",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                 type                   subtype  num_ci\n",
       "0   networkcomponents                    Switch     225\n",
       "1         application  Server Based Application     592\n",
       "2            software           System Software     223\n",
       "3            database               RAC Service      80\n",
       "4            computer              Linux Server     602\n",
       "..                ...                       ...     ...\n",
       "82            storage       Virtual Tape Server       1\n",
       "83           computer          NonStop Harddisk       2\n",
       "84           computer           NonStop Storage       1\n",
       "85               #N/B                      #N/B       1\n",
       "86           software          Sealbag Software       1\n",
       "\n",
       "[87 rows x 3 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>type</th>\n",
       "      <th>subtype</th>\n",
       "      <th>num_ci</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>networkcomponents</td>\n",
       "      <td>Switch</td>\n",
       "      <td>225</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>application</td>\n",
       "      <td>Server Based Application</td>\n",
       "      <td>592</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>software</td>\n",
       "      <td>System Software</td>\n",
       "      <td>223</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>database</td>\n",
       "      <td>RAC Service</td>\n",
       "      <td>80</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>computer</td>\n",
       "      <td>Linux Server</td>\n",
       "      <td>602</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>82</th>\n",
       "      <td>storage</td>\n",
       "      <td>Virtual Tape Server</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>83</th>\n",
       "      <td>computer</td>\n",
       "      <td>NonStop Harddisk</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>84</th>\n",
       "      <td>computer</td>\n",
       "      <td>NonStop Storage</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>85</th>\n",
       "      <td>#N/B</td>\n",
       "      <td>#N/B</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>86</th>\n",
       "      <td>software</td>\n",
       "      <td>Sealbag Software</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>87 rows × 3 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 71,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 71
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T19:08:42.946543300Z",
     "start_time": "2025-11-07T19:08:42.878614800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    ":auto\n",
    "MATCH (hler1:HigherLevelEvent) - [df:DF {objectType: 'CI_SC'}] -> (hler2:HigherLevelEvent)\n",
    "WHERE hler1.activity = 'Change' AND hler2.activity <> 'Change' AND df.type = 'precedes'\n",
    "WITH hler1, df, hler2\n",
    "MATCH (ci_sc:CI_SC {sysId: df.id})\n",
    "RETURN ci_sc.type as type, ci_sc.subtype as subtype, count(distinct ci_sc) as precedes\n",
    "'''\n",
    "result = pd.DataFrame(db_connection.exec_query(query))\n",
    "\n",
    "# result\n",
    "total_result = total_result.merge(result, on=['type', 'subtype'])\n",
    "\n"
   ],
   "id": "f54bdb802c7326dc",
   "outputs": [],
   "execution_count": 82
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T19:09:59.184075100Z",
     "start_time": "2025-11-07T19:09:59.168718900Z"
    }
   },
   "cell_type": "code",
   "source": "total_result",
   "id": "fc6db0c76c6ccb91",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                 type                   subtype  num_ci  contained  precedes\n",
       "0         application  Server Based Application     592         70       179\n",
       "1            software           System Software     223          2         6\n",
       "2            computer              Linux Server     602          1        12\n",
       "3            software       Automation Software      22          2         2\n",
       "4         application     Web Based Application     112         25        40\n",
       "5            computer            Windows Server     907          5        58\n",
       "6         application       Desktop Application     273          8        34\n",
       "7   networkcomponents         Network Component     176          1         4\n",
       "8            hardware       DataCenterEquipment      95          4        11\n",
       "9   networkcomponents                  Protocol       2          1         2\n",
       "10        application                    Citrix      10          2         6\n",
       "11           computer               Unix Server     245          1         4\n",
       "12     subapplication  Server Based Application     186          6        21\n",
       "13  networkcomponents                Net Device      18          1         4\n",
       "14     subapplication     Web Based Application      75          5        14\n",
       "15           computer            NonStop Server      20          1        11\n",
       "16        application                       SAP       6          2         3\n",
       "17            storage                Controller      64          1        24\n",
       "18        application           SharePoint Farm      16          1         2\n",
       "19           computer               ESX Cluster      56          2         3\n",
       "20        application                  Exchange       4          1         1\n",
       "21     subapplication                    Citrix       4          1         1\n",
       "22           computer                    Laptop     685          8        13\n",
       "23           computer                   Desktop     195          1         5\n",
       "24        application  Client Based Application      10          1         3\n",
       "25            no type                no subtype      17          1         4"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>type</th>\n",
       "      <th>subtype</th>\n",
       "      <th>num_ci</th>\n",
       "      <th>contained</th>\n",
       "      <th>precedes</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>application</td>\n",
       "      <td>Server Based Application</td>\n",
       "      <td>592</td>\n",
       "      <td>70</td>\n",
       "      <td>179</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>software</td>\n",
       "      <td>System Software</td>\n",
       "      <td>223</td>\n",
       "      <td>2</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>computer</td>\n",
       "      <td>Linux Server</td>\n",
       "      <td>602</td>\n",
       "      <td>1</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>software</td>\n",
       "      <td>Automation Software</td>\n",
       "      <td>22</td>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>application</td>\n",
       "      <td>Web Based Application</td>\n",
       "      <td>112</td>\n",
       "      <td>25</td>\n",
       "      <td>40</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>computer</td>\n",
       "      <td>Windows Server</td>\n",
       "      <td>907</td>\n",
       "      <td>5</td>\n",
       "      <td>58</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>application</td>\n",
       "      <td>Desktop Application</td>\n",
       "      <td>273</td>\n",
       "      <td>8</td>\n",
       "      <td>34</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>networkcomponents</td>\n",
       "      <td>Network Component</td>\n",
       "      <td>176</td>\n",
       "      <td>1</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>hardware</td>\n",
       "      <td>DataCenterEquipment</td>\n",
       "      <td>95</td>\n",
       "      <td>4</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>networkcomponents</td>\n",
       "      <td>Protocol</td>\n",
       "      <td>2</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>application</td>\n",
       "      <td>Citrix</td>\n",
       "      <td>10</td>\n",
       "      <td>2</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>computer</td>\n",
       "      <td>Unix Server</td>\n",
       "      <td>245</td>\n",
       "      <td>1</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>subapplication</td>\n",
       "      <td>Server Based Application</td>\n",
       "      <td>186</td>\n",
       "      <td>6</td>\n",
       "      <td>21</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>networkcomponents</td>\n",
       "      <td>Net Device</td>\n",
       "      <td>18</td>\n",
       "      <td>1</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>subapplication</td>\n",
       "      <td>Web Based Application</td>\n",
       "      <td>75</td>\n",
       "      <td>5</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>computer</td>\n",
       "      <td>NonStop Server</td>\n",
       "      <td>20</td>\n",
       "      <td>1</td>\n",
       "      <td>11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>application</td>\n",
       "      <td>SAP</td>\n",
       "      <td>6</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>storage</td>\n",
       "      <td>Controller</td>\n",
       "      <td>64</td>\n",
       "      <td>1</td>\n",
       "      <td>24</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>application</td>\n",
       "      <td>SharePoint Farm</td>\n",
       "      <td>16</td>\n",
       "      <td>1</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>computer</td>\n",
       "      <td>ESX Cluster</td>\n",
       "      <td>56</td>\n",
       "      <td>2</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>application</td>\n",
       "      <td>Exchange</td>\n",
       "      <td>4</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>subapplication</td>\n",
       "      <td>Citrix</td>\n",
       "      <td>4</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>computer</td>\n",
       "      <td>Laptop</td>\n",
       "      <td>685</td>\n",
       "      <td>8</td>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>computer</td>\n",
       "      <td>Desktop</td>\n",
       "      <td>195</td>\n",
       "      <td>1</td>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>application</td>\n",
       "      <td>Client Based Application</td>\n",
       "      <td>10</td>\n",
       "      <td>1</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>no type</td>\n",
       "      <td>no subtype</td>\n",
       "      <td>17</td>\n",
       "      <td>1</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 85,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 85
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T19:16:00.399148600Z",
     "start_time": "2025-11-07T19:15:57.607452500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    ":auto\n",
    "MATCH (hler1:HigherLevelEvent) - [df:DF {objectType: 'CI_SC'}] -> (hler2:HigherLevelEvent)\n",
    "WHERE hler1.activity <> 'Change' AND hler2.activity = 'Change' AND df.type = 'contains'\n",
    "WITH hler1, df, hler2\n",
    "MATCH (ci_sc:CI_SC {sysId: df.id})\n",
    "MATCH (ci_sc) <- [:CORR] - (hle:HighLevelEvent)\n",
    "RETURN ci_sc.type as type, ci_sc.subtype as subtype, ci_sc.sysId as id, count(distinct hle) as event_count, count(distinct df) as contains\n",
    "'''\n",
    "contains_result = pd.DataFrame(db_connection.exec_query(query))\n",
    "contains_result"
   ],
   "id": "1a9fff3fbaaeb102",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "            type                   subtype                   id  event_count  contains\n",
       "0       software       Automation Software  ASW000010_WBS000284          206         9\n",
       "1    application     Web Based Application  WBA000133_WBS000073        16764        21\n",
       "2    application     Web Based Application  WBA000017_WBS000138          324         2\n",
       "3    application  Server Based Application  SBA000678_WBS000255           46         1\n",
       "4    application  Server Based Application  SBA000296_WBS000053          126         2\n",
       "..           ...                       ...                  ...          ...       ...\n",
       "150  application     Web Based Application  WBA000126_WBS000148          232         1\n",
       "151  application     Web Based Application  WBA000092_WBS000073          474         1\n",
       "152     computer            Windows Server  WSR000834_WBS000102           10         1\n",
       "153  application     Web Based Application  WBA000005_WBS000302           28         1\n",
       "154     computer               Unix Server  UIX000107_WBS000206           10         1\n",
       "\n",
       "[155 rows x 5 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>type</th>\n",
       "      <th>subtype</th>\n",
       "      <th>id</th>\n",
       "      <th>event_count</th>\n",
       "      <th>contains</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>software</td>\n",
       "      <td>Automation Software</td>\n",
       "      <td>ASW000010_WBS000284</td>\n",
       "      <td>206</td>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>application</td>\n",
       "      <td>Web Based Application</td>\n",
       "      <td>WBA000133_WBS000073</td>\n",
       "      <td>16764</td>\n",
       "      <td>21</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>application</td>\n",
       "      <td>Web Based Application</td>\n",
       "      <td>WBA000017_WBS000138</td>\n",
       "      <td>324</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>application</td>\n",
       "      <td>Server Based Application</td>\n",
       "      <td>SBA000678_WBS000255</td>\n",
       "      <td>46</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>application</td>\n",
       "      <td>Server Based Application</td>\n",
       "      <td>SBA000296_WBS000053</td>\n",
       "      <td>126</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>150</th>\n",
       "      <td>application</td>\n",
       "      <td>Web Based Application</td>\n",
       "      <td>WBA000126_WBS000148</td>\n",
       "      <td>232</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>151</th>\n",
       "      <td>application</td>\n",
       "      <td>Web Based Application</td>\n",
       "      <td>WBA000092_WBS000073</td>\n",
       "      <td>474</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>152</th>\n",
       "      <td>computer</td>\n",
       "      <td>Windows Server</td>\n",
       "      <td>WSR000834_WBS000102</td>\n",
       "      <td>10</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>153</th>\n",
       "      <td>application</td>\n",
       "      <td>Web Based Application</td>\n",
       "      <td>WBA000005_WBS000302</td>\n",
       "      <td>28</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>154</th>\n",
       "      <td>computer</td>\n",
       "      <td>Unix Server</td>\n",
       "      <td>UIX000107_WBS000206</td>\n",
       "      <td>10</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>155 rows × 5 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 94,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 94
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T19:16:03.902378600Z",
     "start_time": "2025-11-07T19:16:02.220187400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    ":auto\n",
    "MATCH (hler1:HigherLevelEvent) - [df:DF {objectType: 'CI_SC'}] -> (hler2:HigherLevelEvent)\n",
    "WHERE hler1.activity = 'Change' AND hler2.activity <> 'Change' AND df.type = 'precedes'\n",
    "WITH hler1, df, hler2\n",
    "MATCH (ci_sc:CI_SC {sysId: df.id})\n",
    "MATCH (ci_sc) <- [:CORR] - (hle:HighLevelEvent)\n",
    "RETURN ci_sc.type as type, ci_sc.subtype as subtype, ci_sc.sysId as id,  count(distinct hle) as event_count, count(distinct df) as precedes\n",
    "'''\n",
    "precedes_result = pd.DataFrame(db_connection.exec_query(query))\n",
    "merged_result = contains_result.merge(precedes_result, on=['type', 'subtype', 'id', 'event_count'])\n",
    "merged_result\n"
   ],
   "id": "dfa899d527cdf111",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "            type                   subtype                   id  event_count  contains  precedes\n",
       "0       software       Automation Software  ASW000010_WBS000284          206         9        10\n",
       "1    application     Web Based Application  WBA000133_WBS000073        16764        21        29\n",
       "2    application     Web Based Application  WBA000017_WBS000138          324         2         6\n",
       "3    application  Server Based Application  SBA000678_WBS000255           46         1         3\n",
       "4    application  Server Based Application  SBA000296_WBS000053          126         2         7\n",
       "..           ...                       ...                  ...          ...       ...       ...\n",
       "135  application     Web Based Application  WBA000126_WBS000148          232         1         7\n",
       "136  application     Web Based Application  WBA000092_WBS000073          474         1         3\n",
       "137     computer            Windows Server  WSR000834_WBS000102           10         1         1\n",
       "138  application     Web Based Application  WBA000005_WBS000302           28         1         1\n",
       "139     computer               Unix Server  UIX000107_WBS000206           10         1         1\n",
       "\n",
       "[140 rows x 6 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>type</th>\n",
       "      <th>subtype</th>\n",
       "      <th>id</th>\n",
       "      <th>event_count</th>\n",
       "      <th>contains</th>\n",
       "      <th>precedes</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>software</td>\n",
       "      <td>Automation Software</td>\n",
       "      <td>ASW000010_WBS000284</td>\n",
       "      <td>206</td>\n",
       "      <td>9</td>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>application</td>\n",
       "      <td>Web Based Application</td>\n",
       "      <td>WBA000133_WBS000073</td>\n",
       "      <td>16764</td>\n",
       "      <td>21</td>\n",
       "      <td>29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>application</td>\n",
       "      <td>Web Based Application</td>\n",
       "      <td>WBA000017_WBS000138</td>\n",
       "      <td>324</td>\n",
       "      <td>2</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>application</td>\n",
       "      <td>Server Based Application</td>\n",
       "      <td>SBA000678_WBS000255</td>\n",
       "      <td>46</td>\n",
       "      <td>1</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>application</td>\n",
       "      <td>Server Based Application</td>\n",
       "      <td>SBA000296_WBS000053</td>\n",
       "      <td>126</td>\n",
       "      <td>2</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>135</th>\n",
       "      <td>application</td>\n",
       "      <td>Web Based Application</td>\n",
       "      <td>WBA000126_WBS000148</td>\n",
       "      <td>232</td>\n",
       "      <td>1</td>\n",
       "      <td>7</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>136</th>\n",
       "      <td>application</td>\n",
       "      <td>Web Based Application</td>\n",
       "      <td>WBA000092_WBS000073</td>\n",
       "      <td>474</td>\n",
       "      <td>1</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>137</th>\n",
       "      <td>computer</td>\n",
       "      <td>Windows Server</td>\n",
       "      <td>WSR000834_WBS000102</td>\n",
       "      <td>10</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>138</th>\n",
       "      <td>application</td>\n",
       "      <td>Web Based Application</td>\n",
       "      <td>WBA000005_WBS000302</td>\n",
       "      <td>28</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>139</th>\n",
       "      <td>computer</td>\n",
       "      <td>Unix Server</td>\n",
       "      <td>UIX000107_WBS000206</td>\n",
       "      <td>10</td>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>140 rows × 6 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 95,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 95
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T19:54:31.437247400Z",
     "start_time": "2025-11-07T19:54:31.332067600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    ":auto\n",
    "MATCH (hle:HighLevelEvent) - [:CORR] -> (ci_sc:CI_SC {sysId: $sysId})\n",
    "WITH ci_sc, hle, EXISTS((hle) - [:DF {objectType: hle.activity} ] -> (:HighLevelEvent)) as is_open\n",
    " WITH ci_sc, hle, CASE is_open\n",
    "WHEN TRUE THEN hle.activity + ' OPEN'\n",
    "ELSE hle.activity + ' CLOSE' END AS activity\n",
    "RETURN ci_sc.sysId as `case:concept:name`, activity as `concept:name`, hle.timestamp as `time:timestamp` ORDER BY hle.timestamp\n",
    "'''\n",
    "\n",
    "event_log_query = Query(\n",
    "    query_str=query,\n",
    "    parameters={'sysId': 'WBA000082_WBS000055'}\n",
    ")\n",
    "\n",
    "result = pd.DataFrame(db_connection.exec_query(event_log_query))\n",
    "result"
   ],
   "id": "bac353eb5bd43c17",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "       case:concept:name       concept:name                       time:timestamp\n",
       "0    WBA000082_WBS000055   Interaction OPEN  2013-08-22T12:56:00.000000000+01:00\n",
       "1    WBA000082_WBS000055      Incident OPEN  2013-08-22T13:09:42.000000000+01:00\n",
       "2    WBA000082_WBS000055   Interaction OPEN  2013-08-26T15:13:00.000000000+01:00\n",
       "3    WBA000082_WBS000055      Incident OPEN  2013-08-26T15:38:26.000000000+01:00\n",
       "4    WBA000082_WBS000055   Interaction OPEN  2013-09-11T13:53:00.000000000+01:00\n",
       "..                   ...                ...                                  ...\n",
       "495  WBA000082_WBS000055     Incident CLOSE  2014-03-28T10:01:57.000000000+01:00\n",
       "496  WBA000082_WBS000055  Interaction CLOSE  2014-03-28T10:02:00.000000000+01:00\n",
       "497  WBA000082_WBS000055  Interaction CLOSE  2014-03-28T12:58:00.000000000+01:00\n",
       "498  WBA000082_WBS000055     Incident CLOSE  2014-03-28T12:58:36.000000000+01:00\n",
       "499  WBA000082_WBS000055  Interaction CLOSE  2014-03-28T14:20:00.000000000+01:00\n",
       "\n",
       "[500 rows x 3 columns]"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>case:concept:name</th>\n",
       "      <th>concept:name</th>\n",
       "      <th>time:timestamp</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>WBA000082_WBS000055</td>\n",
       "      <td>Interaction OPEN</td>\n",
       "      <td>2013-08-22T12:56:00.000000000+01:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>WBA000082_WBS000055</td>\n",
       "      <td>Incident OPEN</td>\n",
       "      <td>2013-08-22T13:09:42.000000000+01:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>WBA000082_WBS000055</td>\n",
       "      <td>Interaction OPEN</td>\n",
       "      <td>2013-08-26T15:13:00.000000000+01:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>WBA000082_WBS000055</td>\n",
       "      <td>Incident OPEN</td>\n",
       "      <td>2013-08-26T15:38:26.000000000+01:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>WBA000082_WBS000055</td>\n",
       "      <td>Interaction OPEN</td>\n",
       "      <td>2013-09-11T13:53:00.000000000+01:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>495</th>\n",
       "      <td>WBA000082_WBS000055</td>\n",
       "      <td>Incident CLOSE</td>\n",
       "      <td>2014-03-28T10:01:57.000000000+01:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>496</th>\n",
       "      <td>WBA000082_WBS000055</td>\n",
       "      <td>Interaction CLOSE</td>\n",
       "      <td>2014-03-28T10:02:00.000000000+01:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>497</th>\n",
       "      <td>WBA000082_WBS000055</td>\n",
       "      <td>Interaction CLOSE</td>\n",
       "      <td>2014-03-28T12:58:00.000000000+01:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>498</th>\n",
       "      <td>WBA000082_WBS000055</td>\n",
       "      <td>Incident CLOSE</td>\n",
       "      <td>2014-03-28T12:58:36.000000000+01:00</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>499</th>\n",
       "      <td>WBA000082_WBS000055</td>\n",
       "      <td>Interaction CLOSE</td>\n",
       "      <td>2014-03-28T14:20:00.000000000+01:00</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>500 rows × 3 columns</p>\n",
       "</div>"
      ]
     },
     "execution_count": 119,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 119
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T20:15:34.453002900Z",
     "start_time": "2025-11-07T20:15:29.579917700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    ":auto\n",
    "MATCH (hle:HighLevelEvent) - [:CORR] -> (ci_sc:CI_SC)\n",
    "WITH ci_sc, hle, EXISTS((hle) - [:DF {objectType: hle.activity} ] -> (:HighLevelEvent)) as is_open\n",
    " WITH ci_sc, hle, CASE is_open\n",
    "WHEN TRUE THEN 'OPEN'\n",
    "ELSE 'CLOSE' END AS open_type\n",
    "SET hle.open_type = open_type\n",
    "'''\n",
    "\n",
    "result = pd.DataFrame(db_connection.exec_query(query))\n",
    "result"
   ],
   "id": "90d33929762ae4b0",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 135,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 135
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "# TODO COUNT NUMBER OF OPEN ITEMS OVER TIME",
   "id": "ec41b16391cab3ca"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T20:13:57.979246100Z",
     "start_time": "2025-11-07T20:13:55.736821100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    ":auto\n",
    "MATCH (hle:HighLevelEvent) - [:CORR] -> (ci_sc:CI_SC {sysId: $sysId})\n",
    "MATCH (hle) - [:DF {objectType: hle.activity} ] -> (hle2:HighLevelEvent)\n",
    "WITH hle.activity as activity, duration.inSeconds(hle.timestamp, hle2.timestamp).seconds*1.0/60 as difference_minutes, count(hle) as count ORDER BY activity, difference_minutes\n",
    "RETURN activity, min(difference_minutes), avg(difference_minutes), max(difference_minutes)\n",
    "'''\n",
    "\n",
    "event_log_query = Query(\n",
    "    query_str=query,\n",
    "    parameters={'sysId': 'WBA000082_WBS000055'}\n",
    ")\n",
    "\n",
    "result = pd.DataFrame(db_connection.exec_query(event_log_query))\n",
    "result"
   ],
   "id": "66143f460cffe23c",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "      activity  min(difference_minutes)  avg(difference_minutes)  max(difference_minutes)\n",
       "0       Change                     0.00               483.333333              2880.000000\n",
       "1     Incident                     8.35             62638.191237            230599.883333\n",
       "2  Interaction                     1.00             56000.455357            230627.000000"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>activity</th>\n",
       "      <th>min(difference_minutes)</th>\n",
       "      <th>avg(difference_minutes)</th>\n",
       "      <th>max(difference_minutes)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Change</td>\n",
       "      <td>0.00</td>\n",
       "      <td>483.333333</td>\n",
       "      <td>2880.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Incident</td>\n",
       "      <td>8.35</td>\n",
       "      <td>62638.191237</td>\n",
       "      <td>230599.883333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>1.00</td>\n",
       "      <td>56000.455357</td>\n",
       "      <td>230627.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 132,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 132
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T20:13:59.856520600Z",
     "start_time": "2025-11-07T20:13:59.815790700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "event_log_query = Query(\n",
    "    query_str=query,\n",
    "    parameters={'sysId': 'ASW000010_WBS000235'}\n",
    ")\n",
    "\n",
    "result = pd.DataFrame(db_connection.exec_query(event_log_query))\n",
    "result"
   ],
   "id": "b3728bcbb5c3751b",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "      activity  min(difference_minutes)  avg(difference_minutes)  max(difference_minutes)\n",
       "0       Change                      0.0              1771.000000             11422.000000\n",
       "1     Incident                      6.8              5674.163636             60025.033333\n",
       "2  Interaction                      3.0              3688.028571             60028.000000"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>activity</th>\n",
       "      <th>min(difference_minutes)</th>\n",
       "      <th>avg(difference_minutes)</th>\n",
       "      <th>max(difference_minutes)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Change</td>\n",
       "      <td>0.0</td>\n",
       "      <td>1771.000000</td>\n",
       "      <td>11422.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Incident</td>\n",
       "      <td>6.8</td>\n",
       "      <td>5674.163636</td>\n",
       "      <td>60025.033333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Interaction</td>\n",
       "      <td>3.0</td>\n",
       "      <td>3688.028571</td>\n",
       "      <td>60028.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 133,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 133
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T20:10:18.129778600Z",
     "start_time": "2025-11-07T20:09:00.697784800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    ":auto\n",
    "MATCH (ci_sc:CI_SC)\n",
    "WITH distinct ci_sc\n",
    "CALL (ci_sc) {\n",
    "    MATCH (all_hle:HighLevelEvent) - [:CORR] -> (ci_sc)\n",
    "    RETURN count(all_hle) as count}\n",
    "MATCH (hle:HighLevelEvent) - [:CORR] -> (ci_sc:CI_SC)\n",
    "MATCH (hle) - [:DF {objectType: hle.activity} ] -> (hle2:HighLevelEvent)\n",
    "WITH ci_sc.sysId as id, hle.activity as activity, duration.inSeconds(hle.timestamp, hle2.timestamp).seconds*1.0/60 as difference_minutes, count ORDER BY activity, difference_minutes\n",
    "RETURN id, activity, min(difference_minutes), avg(difference_minutes), max(difference_minutes), count order by id, activity\n",
    "'''\n",
    "\n",
    "event_log_query = Query(\n",
    "    query_str=query,\n",
    "    parameters={'sysId': 'WBA000082_WBS000055'}\n",
    ")\n",
    "\n",
    "result = pd.DataFrame(db_connection.exec_query(event_log_query))\n",
    "result"
   ],
   "id": "2deffa659268996f",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Latest transaction was rolled back\n",
      "This was your latest query: \n",
      "\n",
      "MATCH (hle:HighLevelEvent) - [:CORR] -> (ci_sc:CI_SC)\n",
      "CALL (ci_sc) {\n",
      "    MATCH (all_hle:HighLevelEvent) - [:CORR] -> (ci_sc)\n",
      "    RETURN count(all_hle) as count}\n",
      "MATCH (hle) - [:DF {objectType: hle.activity} ] -> (hle2:HighLevelEvent)\n",
      "WITH ci_sc.sysId as id, hle.activity as activity, duration.inSeconds(hle.timestamp, hle2.timestamp).seconds*1.0/60 as difference_minutes, count ORDER BY activity, difference_minutes\n",
      "RETURN id, activity, min(difference_minutes), avg(difference_minutes), max(difference_minutes), count order by id, activity\n",
      "\n",
      "{neo4j_code: Neo.TransientError.General.DatabaseUnavailable} {message: The transaction has been terminated. Retry your operation in a new transaction, and you should see a successful result. The database is not currently available to serve your request, refer to the database logs for more details. Retrying your request at a later time may succeed. } {gql_status: 50N42} {gql_status_description: error: general processing exception - unexpected error. Unexpected error has occurred. See debug log for details.}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: []\n",
       "Index: []"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 131,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 131
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T19:52:03.537240800Z",
     "start_time": "2025-11-07T19:52:03.522488600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "import pandas as pd\n",
    "from pm4py.objects.conversion.log import converter as log_converter\n",
    "from pm4py.algo.discovery.dfg import algorithm as dfg_discovery\n",
    "from pm4py.visualization.dfg import visualizer as dfg_visualizer\n",
    "from pm4py.algo.discovery.inductive import algorithm as inductive_miner\n",
    "from pm4py.visualization.petri_net import visualizer as pn_visualizer\n",
    "import pm4py"
   ],
   "id": "104a6f3b4f6c6222",
   "outputs": [],
   "execution_count": 114
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T19:52:04.663831200Z",
     "start_time": "2025-11-07T19:52:04.648853200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "import pm4py\n",
    "log = log_converter.apply(result)"
   ],
   "id": "fd6dd0db37cb737d",
   "outputs": [],
   "execution_count": 115
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T19:53:06.289593200Z",
     "start_time": "2025-11-07T19:53:06.240579900Z"
    }
   },
   "cell_type": "code",
   "source": "pm4py.visualization.dotted_chart.visualizer.apply(log, attributes=['case:concept:name'])",
   "id": "618994614417396c",
   "outputs": [
    {
     "ename": "TypeError",
     "evalue": "list indices must be integers or slices, not list",
     "output_type": "error",
     "traceback": [
      "\u001B[31m---------------------------------------------------------------------------\u001B[39m",
      "\u001B[31mTypeError\u001B[39m                                 Traceback (most recent call last)",
      "\u001B[36mCell\u001B[39m\u001B[36m \u001B[39m\u001B[32mIn[118]\u001B[39m\u001B[32m, line 1\u001B[39m\n\u001B[32m----> \u001B[39m\u001B[32m1\u001B[39m \u001B[43mpm4py\u001B[49m\u001B[43m.\u001B[49m\u001B[43mvisualization\u001B[49m\u001B[43m.\u001B[49m\u001B[43mdotted_chart\u001B[49m\u001B[43m.\u001B[49m\u001B[43mvisualizer\u001B[49m\u001B[43m.\u001B[49m\u001B[43mapply\u001B[49m\u001B[43m(\u001B[49m\u001B[43mlog\u001B[49m\u001B[43m,\u001B[49m\u001B[43m \u001B[49m\u001B[43mattributes\u001B[49m\u001B[43m=\u001B[49m\u001B[43m[\u001B[49m\u001B[33;43m'\u001B[39;49m\u001B[33;43mcase:concept:name\u001B[39;49m\u001B[33;43m'\u001B[39;49m\u001B[43m]\u001B[49m\u001B[43m)\u001B[49m\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\EKG_BPIC2014_Notebook\\venv\\Lib\\site-packages\\pm4py\\visualization\\dotted_chart\\visualizer.py:73\u001B[39m, in \u001B[36mapply\u001B[39m\u001B[34m(log_obj, attributes, variant, parameters)\u001B[39m\n\u001B[32m     71\u001B[39m     log_obj = log_obj.select([pl.col(attr) \u001B[38;5;28;01mfor\u001B[39;00m attr \u001B[38;5;129;01min\u001B[39;00m available_cols])\n\u001B[32m     72\u001B[39m \u001B[38;5;28;01melse\u001B[39;00m:\n\u001B[32m---> \u001B[39m\u001B[32m73\u001B[39m     log_obj = \u001B[43mlog_obj\u001B[49m\u001B[43m[\u001B[49m\u001B[38;5;28;43mlist\u001B[39;49m\u001B[43m(\u001B[49m\u001B[38;5;28;43mset\u001B[39;49m\u001B[43m(\u001B[49m\u001B[43mattributes\u001B[49m\u001B[43m)\u001B[49m\u001B[43m)\u001B[49m\u001B[43m]\u001B[49m\n\u001B[32m     75\u001B[39m parameters[\u001B[33m\"\u001B[39m\u001B[33mdeepcopy\u001B[39m\u001B[33m\"\u001B[39m] = \u001B[38;5;28;01mFalse\u001B[39;00m\n\u001B[32m     76\u001B[39m stream = log_converter.apply(\n\u001B[32m     77\u001B[39m     log_obj,\n\u001B[32m     78\u001B[39m     variant=log_converter.Variants.TO_EVENT_STREAM,\n\u001B[32m     79\u001B[39m     parameters=parameters,\n\u001B[32m     80\u001B[39m )\n",
      "\u001B[36mFile \u001B[39m\u001B[32m~\\PycharmProjects\\EKG_BPIC2014_Notebook\\venv\\Lib\\site-packages\\pm4py\\objects\\log\\obj.py:188\u001B[39m, in \u001B[36mEventStream.__getitem__\u001B[39m\u001B[34m(self, key)\u001B[39m\n\u001B[32m    187\u001B[39m \u001B[38;5;28;01mdef\u001B[39;00m\u001B[38;5;250m \u001B[39m\u001B[34m__getitem__\u001B[39m(\u001B[38;5;28mself\u001B[39m, key):\n\u001B[32m--> \u001B[39m\u001B[32m188\u001B[39m     \u001B[38;5;28;01mreturn\u001B[39;00m \u001B[38;5;28;43mself\u001B[39;49m\u001B[43m.\u001B[49m\u001B[43m_list\u001B[49m\u001B[43m[\u001B[49m\u001B[43mkey\u001B[49m\u001B[43m]\u001B[49m\n",
      "\u001B[31mTypeError\u001B[39m: list indices must be integers or slices, not list"
     ]
    }
   ],
   "execution_count": 118
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-07T19:28:45.077725500Z",
     "start_time": "2025-11-07T19:28:41.205496500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    ":auto\n",
    "MATCH (hler:HigherLevelEvent) - [:CONTAINS] -> (hle_start) - [df_act:DF {objectType: hle_start.activity}] -> (hle_end:HighLevelEvent)\n",
    "MATCH  (hle_end) - [df:DF {objectType: 'CI_SC'}] -> (hle_next)\n",
    "MATCH (next_hler:HigherLevelEvent) - [:CONTAINS] -> (hle_next)\n",
    "WHERE NOT EXISTS ((hler) - [:DF] -> (next_hler))\n",
    "\n",
    "MATCH (hle_next) - [df_act_other {objectType: hle_next.activity}] - (hle_next2)\n",
    "WITH hler, next_hler, hle_start, hle_end, hle_next, hle_next2, df, CASE\n",
    "//  hle_end.timestamp <= hle_next.timestamp  per definition (and hle_next2 cannot be between hle_next and hle_end, so no hle_end < hle_next2 < hle_next)\n",
    "WHEN hle_next.timestamp <= hle_next2.timestamp THEN 'precedes' // both events happen after hle:  hle_start < hle_end < hle_next < hle_next2\n",
    "// hle_next2 happens before hle_next, and therefore after hle_end\n",
    "WHEN hle_next2.timestamp <= hle_start.timestamp THEN 'contains' // hle is contained in hle_next: hle_next_2 < hle_start < hle_end < hle_next\n",
    "WHEN hle_start.timestamp < hle_next2.timestamp THEN 'overlaps' // hle overlaps with hle_next: hle_start < hle_next2 < hle_end < hle_next\n",
    "ELSE 'undefined'\n",
    "END AS transition_type\n",
    "\n",
    "CALL (next_hler, hler, df, transition_type) {\n",
    "    MERGE (hler) - [new_df:DF {objectType: 'CI_SC', id: df.id}] -> (next_hler)\n",
    "    SET new_df.type = transition_type\n",
    "} IN TRANSACTIONS\n",
    "RETURN transition_type, count(next_hler)\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(query)"
   ],
   "id": "1831720370273693",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'transition_type': 'contains', 'count(next_hler)': 67049},\n",
       " {'transition_type': 'overlaps', 'count(next_hler)': 30161}]"
      ]
     },
     "execution_count": 97,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 97
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T16:00:12.240301500Z",
     "start_time": "2025-11-06T16:00:09.079463600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    ":auto\n",
    "MATCH (hler:HigherLevelEvent) - [:CONTAINS] -> (hle_start) - [df_act:DF {objectType: hle_start.activity}] -> (hle_end:HighLevelEvent)\n",
    "MATCH (hle_end) - [df:DF {objectType: 'CI_SC'}] -> (hle_prev_end)\n",
    "MATCH (hle_prev_start) - [df_act_other {objectType: hle_prev_start.activity}] -> (hle_prev_end)\n",
    "WITH hler, hle_start, hle_end, hle_prev_start, hle_prev_end, df_act, df, df_act_other, CASE\n",
    "WHEN hle_prev_start.timestamp <= hle_start.timestamp THEN 'contains'\n",
    "ELSE 'overlaps' END AS type\n",
    "MATCH (next_hler:HigherLevelEvent) - [:CONTAINS] -> (hle_prev_start)\n",
    "CALL (hler, next_hler, df, type) {\n",
    "    MERGE (hler) - [new_df:DF {objectType: 'CI_SC', id: df.id}] -> (next_hler)\n",
    "    SET new_df.type = type\n",
    "} IN TRANSACTIONS\n",
    "\n",
    "'''\n",
    "db_connection.exec_query(query)"
   ],
   "id": "2a2ae1c91997d715",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 121,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 121
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-06T16:04:29.376650200Z",
     "start_time": "2025-11-06T16:04:25.712283500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    ":auto\n",
    "MATCH (hler:HigherLevelEvent) - [:CONTAINS] -> (hle_start) - [df_act:DF {objectType: hle_start.activity}] -> (hle_end:HighLevelEvent)\n",
    "MATCH (hle_end) - [df:DF {objectType: 'CI_SC'}] -> (hle_prev_start)\n",
    "MATCH (hle_prev_start) - [df_act_other {objectType: hle_prev_start.activity}] -> (hle_prev_end)\n",
    "MATCH (next_hler:HigherLevelEvent) - [:CONTAINS] -> (hle_prev_start)\n",
    "CALL (hler, next_hler, df) {\n",
    "    MERGE (hler) - [new_df:DF {objectType: 'CI_SC', id: df.id}] -> (next_hler)\n",
    "    SET new_df.type = 'subsequent'\n",
    "} IN TRANSACTIONS\n",
    "\n",
    "'''\n",
    "db_connection.exec_query(query)"
   ],
   "id": "b9d21a88bfb5c1a6",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 123,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 123
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
