{
 "cells": [
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# 0. Prepare Project",
   "id": "c64b4305d3d23d83"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:11:46.199859500Z",
     "start_time": "2025-11-21T16:11:46.149611300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "%matplotlib inline\n",
    "import matplotlib.pyplot as plt\n",
    "\n",
    "from pathlib import Path\n",
    "\n",
    "from promg.modules.db_management import DBManagement\n",
    "from tabulate import tabulate\n",
    "import yaml\n",
    "\n",
    "from promg import Configuration, DatabaseConnection, Performance, SemanticHeader, DatasetDescriptions, OcedPg, Query\n",
    "\n",
    "from IPython.core.interactiveshell import InteractiveShell\n",
    "\n",
    "InteractiveShell.ast_node_interactivity = \"all\"\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "pd.set_option('display.width', 2000)"
   ],
   "id": "a83786237630755f",
   "outputs": [],
   "execution_count": 314
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### Define the project that you want to do analysis on",
   "id": "7621249a902ed231"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:11:46.266580200Z",
     "start_time": "2025-11-21T16:11:46.215225300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "case_study = 'bpic14'\n",
    "use_sample = False"
   ],
   "id": "9ff2c60b73bb0b11",
   "outputs": [],
   "execution_count": 315
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:11:46.350171800Z",
     "start_time": "2025-11-21T16:11:46.297085600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# retrieve configuration for case_study\n",
    "conf_path = Path(case_study, 'config.yaml')\n",
    "config = yaml.safe_load(open(conf_path))\n",
    "\n",
    "print(f\"These are the credentials that I expect to be set for the database.\")\n",
    "print(f\"db_name: {config['db_name']}\")\n",
    "print(f\"uri: {config['uri']}\")\n",
    "print(f\"password: {config['password']}\")\n",
    "print(\"----------------------\")\n",
    "print(f\"If you have other credentials, please change them at: {conf_path}\")"
   ],
   "id": "aa3387e167d67135",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "These are the credentials that I expect to be set for the database.\n",
      "db_name: neo4j\n",
      "uri: bolt://localhost:7687\n",
      "password: bpic2014\n",
      "----------------------\n",
      "If you have other credentials, please change them at: bpic14\\config.yaml\n"
     ]
    }
   ],
   "execution_count": 316
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "### Prepare so we can use PromG to load the data and execute queries"
   ],
   "id": "e8120ab6c716ab32"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:11:46.418449600Z",
     "start_time": "2025-11-21T16:11:46.373168200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "config = Configuration.init_conf_with_config_file(conf_path)\n",
    "db_connection = DatabaseConnection.set_up_connection(config=config)\n",
    "perf = Performance.set_up_performance(config=config)\n",
    "dataset_descriptions = DatasetDescriptions(config=config)"
   ],
   "id": "6a43b12f667191c7",
   "outputs": [],
   "execution_count": 317
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:11:46.491178200Z",
     "start_time": "2025-11-21T16:11:46.439984300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def reset_pbar(pbar=perf.pbar, total=None):\n",
    "    # clear db\n",
    "    pbar.reset()\n",
    "    # TODO update dragons in PromG, #update method to set total for pbar\n",
    "    pbar.total = total\n",
    "    pbar.set_postfix_str()"
   ],
   "id": "401c224950fa68e",
   "outputs": [],
   "execution_count": 318
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "#### Prepare the DB"
   ],
   "id": "6bb7df7ad87d2580"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:11:46.579586500Z",
     "start_time": "2025-11-21T16:11:46.509760300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# read the semantic header --> this details how the data should be structured\n",
    "semantic_header = SemanticHeader.create_semantic_header(config=config)"
   ],
   "id": "62c8f00ce4cfd71a",
   "outputs": [],
   "execution_count": 319
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:11:51.365023800Z",
     "start_time": "2025-11-21T16:11:46.581600300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Clear the DB (if use_sample = False, this should not take long on a loaded database)\n",
    "db_manager = DBManagement(db_connection=db_connection, semantic_header=None)\n",
    "db_manager.clear_db(\n",
    "    replace=True);  # in the community version of neo4j, replace is not allowed. In that case, set replace=False"
   ],
   "id": "60b3495572a9748b",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "13it [36:38, 430.76s/it, clear_db: took 2163.65 seconds]                                              "
     ]
    }
   ],
   "execution_count": 320
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### Statistics",
   "id": "9b9574f79a18bc22"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:11:51.387103300Z",
     "start_time": "2025-11-21T16:11:51.377659900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def get_graph_statistics(db_connection):\n",
    "    \"\"\"\n",
    "    Statistics about nodes and relations.\n",
    "    \"\"\"\n",
    "\n",
    "    with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "        print(\"\\n=== GRAPH STATISTICS ===\")\n",
    "\n",
    "        try:\n",
    "            node_query = \"\"\"\n",
    "            MATCH (n)\n",
    "            WITH n, labels(n) as labels\n",
    "            RETURN reduce(label_str = \"(\", l in labels | label_str + \":\" + l) + \")\" as label, count(n) as count ORDER BY count DESC\n",
    "            \"\"\"\n",
    "            node_counts = session.run(node_query)\n",
    "            print(\"\\n--- Node counts ---\")\n",
    "            for record in node_counts:\n",
    "                print(f\"{record['label']:<30} {record['count']}\")\n",
    "\n",
    "            rel_query = \"\"\"\n",
    "            MATCH (n) - [r] -> (n2)\n",
    "            RETURN \"[:\" + type(r) + \"]\" as  type, count(r) as count ORDER BY count DESC\n",
    "            \"\"\"\n",
    "            rel_counts = session.run(rel_query)\n",
    "            print(\"\\n--- Relationship counts ---\")\n",
    "            for record in rel_counts:\n",
    "                print(f\"{record['type']:<30} {record['count']}\")\n",
    "\n",
    "            total_nodes = session.run(\"MATCH (n) RETURN count(n) AS total\").single()[\"total\"]\n",
    "            total_rels = session.run(\"MATCH ()-[r]->() RETURN count(r) AS total\").single()[\"total\"]\n",
    "\n",
    "            print(\"\\n--- Totals ---\")\n",
    "            print(f\"Total nodes: {total_nodes}\")\n",
    "            print(f\"Total relationships: {total_rels}\")\n",
    "\n",
    "        except Exception as e:\n",
    "            print(f\"Failed to get graph statistics: {e}\")"
   ],
   "id": "61eb8964fed3fe33",
   "outputs": [],
   "execution_count": 321
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# 0. Load the data",
   "id": "c9f31d099aa6fa78"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:11:51.395171400Z",
     "start_time": "2025-11-21T16:11:51.388100900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "use_sample = False\n",
    "oced_pg = OcedPg(database_connection=db_connection,\n",
    "                 dataset_descriptions=dataset_descriptions,\n",
    "                 semantic_header=semantic_header,\n",
    "                 use_sample=use_sample)\n"
   ],
   "id": "dd32a54bd867f10e",
   "outputs": [],
   "execution_count": 322
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:12:25.763312Z",
     "start_time": "2025-11-21T16:11:51.395171400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# first, we load all records\n",
    "# (if use_sample = False, this should take less than 2 minutes)\n",
    "reset_pbar(total=11)\n",
    "oced_pg.load();"
   ],
   "id": "9d5ad1773dfada90",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "  0%|          | 0/11 [00:00<?, ?it/s]                                "
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N50', status_description='warn: label does not exist. The label `Log` does not exist. Verify that the spelling is correct.', position=<SummaryInputPosition line=2, column=22, offset=22>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 22, 'line': 2, 'column': 22}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n            MATCH (l:Log)\\n            RETURN COLLECT(DISTINCT l.name) AS logs\\n        '\n",
      "Received notification from DBMS server: <GqlStatusObject gql_status='01N52', status_description='warn: property key does not exist. The property `name` does not exist. Verify that the spelling is correct.', position=<SummaryInputPosition line=3, column=39, offset=65>, raw_classification='UNRECOGNIZED', classification=<NotificationClassification.UNRECOGNIZED: 'UNRECOGNIZED'>, raw_severity='WARNING', severity=<NotificationSeverity.WARNING: 'WARNING'>, diagnostic_record={'_classification': 'UNRECOGNIZED', '_severity': 'WARNING', '_position': {'offset': 65, 'line': 3, 'column': 39}, 'OPERATION': '', 'OPERATION_CODE': '0', 'CURRENT_SCHEMA': '/'}> for query: '\\n            MATCH (l:Log)\\n            RETURN COLLECT(DISTINCT l.name) AS logs\\n        '\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "100%|██████████| 11/11 [00:34<00:00,  3.12s/it, _filter_nodes for BPIC14Interaction: took 0.0 seconds]                      "
     ]
    }
   ],
   "execution_count": 323
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:12:26.581846800Z",
     "start_time": "2025-11-21T16:12:25.773239300Z"
    }
   },
   "cell_type": "code",
   "source": "get_graph_statistics(db_connection)",
   "id": "aa4f886c1450dae7",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "=== GRAPH STATISTICS ===\n",
      "\n",
      "--- Node counts ---\n",
      "(:Record)                      690622\n",
      "(:Log)                         4\n",
      "\n",
      "--- Relationship counts ---\n",
      "[:CONTAINS]                    690622\n",
      "\n",
      "--- Totals ---\n",
      "Total nodes: 690626\n",
      "Total relationships: 690622\n"
     ]
    }
   ],
   "execution_count": 324
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:12:26.595340300Z",
     "start_time": "2025-11-21T16:12:26.589979300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "bpic14_incident = \"BPIC14Incident.csv\"\n",
    "bpic14_interaction = \"BPIC14Interaction.csv\"\n",
    "bpic14_change = \"Detail_Change.csv\"\n",
    "bpic14_incident_activity = \"Detail_Incident_Activity.csv\""
   ],
   "id": "71f081fd8cac0dc",
   "outputs": [],
   "execution_count": 325
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# 1. Split Entities into Objects and Events",
   "id": "4ce7140e95b71b1e"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### Objects Nodes",
   "id": "a8cbbfafb58e0d72"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Create objects out of the Record nodes directly.\n",
    "Those are I\n",
    "- Incident\n",
    "- Interaction\n",
    "- Change\n",
    "- Knowledge Document\n",
    "- Resource."
   ],
   "id": "6c93482e299a4cf"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:12:26.612349800Z",
     "start_time": "2025-11-21T16:12:26.599635800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "objects = {\n",
    "    \"Incident\": [\n",
    "        {\n",
    "            \"log\": bpic14_incident,\n",
    "            \"sysId\": \"incidentId\",\n",
    "            \"attributes\": {\n",
    "                \"incidentId\": \"incidentId\",\n",
    "                \"status\": \"status\",\n",
    "                \"impact\": \"impact\",\n",
    "                \"priority\": \"priority\",\n",
    "                \"category\": \"category\",\n",
    "                \"handleTimeHours\": \"handleTimeHours\",\n",
    "                \"closureCode\": \"closureCode\",\n",
    "                \"alertStatus\": \"alertStatus\",\n",
    "                \"numReassignments\": \"numReassignments\",\n",
    "                \"numRelatedInteractions\": \"numRelatedInteractions\",\n",
    "                \"numRelatedIncidents\": \"numRelatedIncidents\",\n",
    "                \"numRelatedChanges\": \"numRelatedChanges\"\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            \"log\": bpic14_interaction,\n",
    "            \"sysId\": \"relatedIncident\",\n",
    "            \"attributes\": {\n",
    "                \"incidentId\": \"relatedIncident\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"derivedFromInteraction\": True\n",
    "            }\n",
    "        },\n",
    "\n",
    "        {\n",
    "            \"log\": bpic14_incident_activity,\n",
    "            \"sysId\": \"incidentId\",\n",
    "            \"attributes\": {\n",
    "                \"incidentId\": \"incidentId\"\n",
    "            }\n",
    "        }\n",
    "    ],\n",
    "    \"Interaction\": [\n",
    "        {\n",
    "            \"log\": bpic14_interaction,\n",
    "            \"sysId\": \"interactionId\",\n",
    "            \"attributes\": {\n",
    "                \"interactionId\": \"interactionId\",\n",
    "                \"status\": \"status\",\n",
    "                \"impact\": \"impact\",\n",
    "                \"priority\": \"priority\",\n",
    "                \"category\": \"category\",\n",
    "                \"handleTimeSecs\": \"handleTimeSecs\",\n",
    "                \"closureCode\": \"closureCode\",\n",
    "                \"firstCallResolution\": \"firstCallResolution\"\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            \"log\": bpic14_incident,\n",
    "            \"sysId\": \"relatedInteraction\",\n",
    "            \"attributes\": {\n",
    "                \"interactionId\": \"relatedInteraction\"\n",
    "            },\n",
    "        }\n",
    "    ],\n",
    "    \"Change\": [\n",
    "        {\n",
    "            \"log\": bpic14_change,\n",
    "            \"sysId\": \"changeId\",\n",
    "            \"attributes\": {\n",
    "                \"changeId\": \"changeId\",\n",
    "                \"type\": \"changeType\",\n",
    "                \"riskAssessment\": \"riskAssessment\",\n",
    "                \"cabApprovalNeeded\": \"cabApprovalNeeded\",\n",
    "                \"plannedStart\": \"plannedStart\",\n",
    "                \"plannedEnd\": \"plannedEnd\",\n",
    "                \"scheduledDowntimeStart\": \"scheduledDowntimeStart\",\n",
    "                \"scheduledDowntimeEnd\": \"scheduledDowntimeEnd\",\n",
    "                \"requestedEndDate\": \"requestedEndDate\",\n",
    "                \"originatedFrom\": \"originatedFrom\",\n",
    "                \"numRelatedInteractions\": \"numRelatedInteractions\",\n",
    "                \"numRelatedIncidents\": \"numRelatedIncidents\"\n",
    "            },\n",
    "        }, {\n",
    "            \"log\": bpic14_incident,\n",
    "            \"sysId\": \"relatedChange\",\n",
    "            \"attributes\": {\n",
    "                \"changeId\": \"relatedChange\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"derivedFromIncident\": True\n",
    "            }\n",
    "        }\n",
    "    ],\n",
    "    \"KnowledgeDocument\": [\n",
    "        {\n",
    "            \"log\": None,\n",
    "            \"sysId\": \"kmNumber\",\n",
    "            \"attributes\": {\"kmNumber\": \"kmNumber\"}\n",
    "        }\n",
    "    ],\n",
    "    \"Resource\": [\n",
    "        {\n",
    "            \"log\": bpic14_incident_activity,\n",
    "            \"sysId\": \"assignmentGroup\",\n",
    "            \"attributes\": {\"assignmentGroup\": \"assignmentGroup\"}\n",
    "        }\n",
    "    ],\n",
    "    \"ConfigurationItem\": [\n",
    "        {  # affected CIs\n",
    "            \"log\": None,\n",
    "            \"sysId\": \"ciNameAff\",\n",
    "            \"attributes\": {\n",
    "                \"ciName\": \"ciNameAff\",\n",
    "                \"ciType\": \"ciTypeAff\",\n",
    "                \"ciSubtype\": \"ciSubtypeAff\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"affected\": True\n",
    "            }\n",
    "        },\n",
    "        {  # caused by CIs\n",
    "            \"log\": bpic14_incident,\n",
    "            \"sysId\": \"ciNameCby\",\n",
    "            \"attributes\": {\n",
    "                \"ciName\": \"ciNameCby\",\n",
    "                \"ciType\": \"ciTypeCby\",\n",
    "                \"ciSubtype\": \"ciSubtypeCby\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"caused\": True\n",
    "            }\n",
    "\n",
    "        }\n",
    "\n",
    "    ],\n",
    "    \"ServiceComponent\": [\n",
    "        {  # affected SCs\n",
    "            \"log\": None,\n",
    "            \"sysId\": \"serviceComponentAff\",\n",
    "            \"attributes\": {\n",
    "                \"scName\": \"serviceComponentAff\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"affected\": True\n",
    "            }\n",
    "        },\n",
    "        {  # caused by SCs\n",
    "            \"log\": bpic14_incident,\n",
    "            \"sysId\": \"serviceComponentCBy\",\n",
    "            \"attributes\": {\n",
    "                \"scName\": \"serviceComponentCBy\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"caused\": True\n",
    "            }\n",
    "        },\n",
    "    ]\n",
    "}"
   ],
   "id": "c064003270b67a32",
   "outputs": [],
   "execution_count": 326
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:12:26.624532900Z",
     "start_time": "2025-11-21T16:12:26.614354900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def create_index(_db_connection, _label):\n",
    "    index_query_str = f\"\"\"\n",
    "        CREATE INDEX $index_name IF NOT EXISTS\n",
    "        FOR (n:$label)\n",
    "        ON (n.sysId)\n",
    "    \"\"\"\n",
    "\n",
    "    index_query = Query(query_str=index_query_str,\n",
    "                        parameters={\n",
    "                            \"index_name\": f\"{_label.lower()}_sysId_index\"\n",
    "                        },\n",
    "                        template_string_parameters={\n",
    "                            \"label\": _label\n",
    "                        })\n",
    "\n",
    "    _db_connection.exec_query(index_query)\n",
    "    print(f\"Index for :{_label}(sysId)\")\n",
    "\n",
    "\n",
    "def build_entity(_label, _config):\n",
    "    iterate_query = \"\"\"\n",
    "        :auto\n",
    "        MATCH (l:Log)-[:CONTAINS]->(r:Record)\n",
    "        WHERE r.$sysId_field IS NOT NULL $log_name_condition $time_field_condition\n",
    "        WITH r.$sysId_field $id_addition AS sysId, r\n",
    "        CALL (sysId, r) {\n",
    "             MERGE (n:$label {sysId: sysId})\n",
    "             MERGE (n)-[:EXTRACTED_FROM]->(r)\n",
    "             $attr_updates\n",
    "             $constants_updates\n",
    "        } IN TRANSACTIONS\n",
    "    \"\"\"\n",
    "    attr_updates = \"\"\n",
    "    time_field_condition = \"\"\n",
    "\n",
    "    if \"attributes\" in _config:\n",
    "        attr_updates += \"SET \"\n",
    "        attr_updates += \", \".join(\n",
    "            [f\"n.{key} = COALESCE(n.{key}, r.{attr})\" for key, attr in _config[\"attributes\"].items()])\n",
    "\n",
    "        if \"timestamp\" in _config[\"attributes\"]:\n",
    "            time_field_condition = f\"AND r.{_config[\"attributes\"][\"timestamp\"]} IS NOT NULL\"\n",
    "\n",
    "    constants_updates = \"\"\n",
    "    if \"constants\" in _config:\n",
    "        constants_updates += \"SET \"\n",
    "        constants_updates += \", \".join(\n",
    "            [f\"n.{key} = COALESCE(n.{key}, {attr})\" for key, attr in _config[\"constants\"].items()])\n",
    "\n",
    "    query = Query(\n",
    "        query_str=iterate_query,\n",
    "        parameters={\n",
    "            \"log_name\": _config[\"log\"],\n",
    "        },\n",
    "        template_string_parameters={\n",
    "            \"label\": _label,\n",
    "            \"sysId_field\": _config[\"sysId\"],\n",
    "            \"log_name_condition\": \"AND l.name = $log_name\" if _config[\"log\"] else \"\",\n",
    "            \"time_field_condition\": time_field_condition,\n",
    "            \"attr_updates\": attr_updates,\n",
    "            \"constants_updates\": constants_updates,\n",
    "            \"id_addition\": f\"+ '{_config['id_addition']}'\" if 'id_addition' in _config else \"\"\n",
    "        }\n",
    "    )\n",
    "    db_connection.exec_query(query)\n",
    "    print(f\"→ {_label} nodes created.\")\n",
    "\n",
    "\n",
    "def build_entities(_db_connection, entities):\n",
    "    \"\"\"\n",
    "    Create entities. Includes indexing.\n",
    "    \"\"\"\n",
    "    print(\"\\n=== INDEXES ===\")\n",
    "    for _label in entities.keys():\n",
    "        try:\n",
    "            create_index(_db_connection=_db_connection,\n",
    "                         _label=_label)\n",
    "        except Exception as e:\n",
    "            print(f\"Failed to create index for {_label}: {e}\")\n",
    "\n",
    "    print(f\"\\n=== Building ENTITY NODES ===\")\n",
    "\n",
    "    for _label, _configs in entities.items():\n",
    "        for _config in _configs:\n",
    "            try:\n",
    "                build_entity(_label=_label,\n",
    "                             _config=_config)\n",
    "            except Exception as e:\n",
    "                print(f\"Failed for {_label}: {e}\")\n"
   ],
   "id": "fe48b6a214dfb0ba",
   "outputs": [],
   "execution_count": 327
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:13:11.491072200Z",
     "start_time": "2025-11-21T16:12:26.627052800Z"
    }
   },
   "cell_type": "code",
   "source": "build_entities(db_connection, entities=objects)",
   "id": "586ed0a1377317f7",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "=== INDEXES ===\n",
      "Index for :Incident(sysId)\n",
      "Index for :Interaction(sysId)\n",
      "Index for :Change(sysId)\n",
      "Index for :KnowledgeDocument(sysId)\n",
      "Index for :Resource(sysId)\n",
      "Index for :ConfigurationItem(sysId)\n",
      "Index for :ServiceComponent(sysId)\n",
      "\n",
      "=== Building ENTITY NODES ===\n",
      "→ Incident nodes created.\n",
      "→ Incident nodes created.\n",
      "→ Incident nodes created.\n",
      "→ Interaction nodes created.\n",
      "→ Interaction nodes created.\n",
      "→ Change nodes created.\n",
      "→ Change nodes created.\n",
      "→ KnowledgeDocument nodes created.\n",
      "→ Resource nodes created.\n",
      "→ ConfigurationItem nodes created.\n",
      "→ ConfigurationItem nodes created.\n",
      "→ ServiceComponent nodes created.\n",
      "→ ServiceComponent nodes created.\n"
     ]
    }
   ],
   "execution_count": 328
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:13:12.593969800Z",
     "start_time": "2025-11-21T16:13:11.501725900Z"
    }
   },
   "cell_type": "code",
   "source": "get_graph_statistics(db_connection)",
   "id": "a6f16b1a2dda8e46",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "=== GRAPH STATISTICS ===\n",
      "\n",
      "--- Node counts ---\n",
      "(:Record)                      690622\n",
      "(:Interaction)                 147172\n",
      "(:Incident)                    47057\n",
      "(:Change)                      18026\n",
      "(:ConfigurationItem)           15134\n",
      "(:KnowledgeDocument)           2373\n",
      "(:ServiceComponent)            340\n",
      "(:Resource)                    242\n",
      "(:Log)                         4\n",
      "\n",
      "--- Relationship counts ---\n",
      "[:EXTRACTED_FROM]              2371470\n",
      "[:CONTAINS]                    690622\n",
      "\n",
      "--- Totals ---\n",
      "Total nodes: 920970\n",
      "Total relationships: 3062092\n"
     ]
    }
   ],
   "execution_count": 329
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "### O2O Relations\n",
    "\n",
    "- (Incident|Interaction)-[:USED_KM]->(KnowledgeDocument)\n",
    "- (Incident)-[:RELATED_CHANGE]->(Change)\n",
    "- (Interaction)-[:RELATED_INCIDENT]->(Incident)\n",
    "- (Incident|Interaction|Change)-[:AFFECTED_CI_SC]->(CI_SC)\n",
    "- (Incident|Interaction|Change)<-[:CAUSED_BY_CI_SC]-(CI_SC)"
   ],
   "id": "aa185bfdc92e05f1"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:13:12.613400800Z",
     "start_time": "2025-11-21T16:13:12.601849700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "o2o_relationships = {\n",
    "    \"USED_KM\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"Incident|Interaction\"\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"KnowledgeDocument\",\n",
    "            \"foreign_key\": \"kmNumber\"\n",
    "        }\n",
    "    }],\n",
    "    \"RELATED_CHANGE\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"Incident\"\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"Change\",\n",
    "            \"foreign_key\": \"relatedChange\"\n",
    "        }\n",
    "    }],\n",
    "    \"RELATED_INCIDENT\": [\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"Interaction\"\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"Incident\",\n",
    "                \"foreign_key\": \"relatedIncident\"\n",
    "            }\n",
    "        },\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"Interaction\",\n",
    "                \"foreign_key\": \"relatedInteraction\"\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"Incident\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"primary\": True\n",
    "            }\n",
    "        }],\n",
    "    \"AFFECTED_CI\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"Incident|Interaction|Change\"\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"ConfigurationItem\",\n",
    "            \"foreign_key\": \"ciNameAff\"\n",
    "        },\n",
    "    }],\n",
    "    \"AFFECTED_SC\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"Incident|Interaction|Change\"\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"ServiceComponent\",\n",
    "            \"foreign_key\": \"serviceComponentAff\"\n",
    "        },\n",
    "    }],\n",
    "    \"CAUSED_BY_CI\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"Incident\"\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"ConfigurationItem\",\n",
    "            \"foreign_key\": \"ciNameCby\"\n",
    "        },\n",
    "    }],\n",
    "    \"CAUSED_BY_SC\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"Incident\"\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"ServiceComponent\",\n",
    "            \"foreign_key\": \"serviceComponentCBy\"\n",
    "        },\n",
    "    }],\n",
    "    \"CONTAINS\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"ServiceComponent\",\n",
    "            \"foreign_key\": \"serviceComponentAff\"\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"ConfigurationItem\",\n",
    "            \"foreign_key\": \"ciNameAff\"\n",
    "        },\n",
    "    }, {\n",
    "        \"from_object\": {\n",
    "            \"label\": \"ServiceComponent\",\n",
    "            \"foreign_key\": \"serviceComponentCBy\"\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"ConfigurationItem\",\n",
    "            \"foreign_key\": \"ciNameCby\"\n",
    "        },\n",
    "    }]\n",
    "}"
   ],
   "id": "bb40d17ad93d6a4d",
   "outputs": [],
   "execution_count": 330
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:13:12.630898100Z",
     "start_time": "2025-11-21T16:13:12.616401500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def build_foreign_key_index(_db_connection, _config):\n",
    "    foreign_key_query_str = '''\n",
    "                            CREATE INDEX $index_name IF NOT EXISTS\n",
    "                                FOR (n:Record) ON (n.$foreign_key) \\\n",
    "                            '''\n",
    "\n",
    "    for _type in [\"from_object\", \"to_object\"]:\n",
    "        if \"foreign_key\" in _config[_type]:\n",
    "            foreign_key = _config[_type][\"foreign_key\"]\n",
    "\n",
    "            foreign_key_index_query = Query(\n",
    "                query_str=foreign_key_query_str,\n",
    "                parameters={\n",
    "                    \"index_name\": f\"record_{foreign_key}_index\"\n",
    "                },\n",
    "                template_string_parameters={\n",
    "                    \"foreign_key\": foreign_key\n",
    "                }\n",
    "            )\n",
    "\n",
    "            _db_connection.exec_query(foreign_key_index_query)\n",
    "            print(f\"Index ensured for :Record({foreign_key})\")\n",
    "\n",
    "\n",
    "def build_relationship(_db_connection, _type, _config):\n",
    "    o2o_query_str = '''\n",
    "        :auto\n",
    "         MATCH (from:$from_object) - [:EXTRACTED_FROM] -> (r:Record) <- [:EXTRACTED_FROM] - (to:$to_object)\n",
    "         WHERE $condition\n",
    "         CALL (from, to, r) {\n",
    "            MERGE (from) - [rel:$type] -> (to)\n",
    "            $attr_updates\n",
    "            $constants_updates\n",
    "        } IN TRANSACTIONS\n",
    "    '''\n",
    "\n",
    "    attr_updates = \"\"\n",
    "    if \"attributes\" in _config:\n",
    "        attr_updates = \"SET \"\n",
    "        attr_updates += \", \".join(\n",
    "            [f\"rel.{key} = COALESCE(rel.{key}, r.{attr})\" for key, attr in _config[\"attributes\"].items()])\n",
    "    constants_updates = \"\"\n",
    "    if \"constants\" in _config:\n",
    "        constants_updates += \"SET \"\n",
    "        constants_updates += \", \".join(\n",
    "            [f\"rel.{key} = COALESCE(rel.{key}, {attr})\" for key, attr in _config[\"constants\"].items()])\n",
    "\n",
    "    from_object = _config[\"from_object\"]\n",
    "    to_object = _config[\"to_object\"]\n",
    "\n",
    "    from_foreign_key = \"\"\n",
    "    to_foreign_key = \"\"\n",
    "    conditions = []\n",
    "\n",
    "    if \"foreign_key\" in from_object:\n",
    "        from_foreign_key = from_object[\"foreign_key\"]\n",
    "        conditions.append(\"r[$from_foreign_key] IS NOT NULL AND from.sysId = r[$from_foreign_key]\")\n",
    "    if \"foreign_key\" in to_object:\n",
    "        to_foreign_key = to_object[\"foreign_key\"]\n",
    "        conditions.append(\"r[$to_foreign_key] IS NOT NULL AND to.sysId = r[$to_foreign_key]\")\n",
    "\n",
    "    o2o_query = Query(\n",
    "        query_str=o2o_query_str,\n",
    "        parameters={\n",
    "            \"from_foreign_key\": from_foreign_key,\n",
    "            \"to_foreign_key\": to_foreign_key\n",
    "        },\n",
    "\n",
    "        template_string_parameters={\n",
    "            \"condition\": \" AND \".join(conditions),\n",
    "            \"from_object\": from_object[\"label\"],\n",
    "            \"to_object\": to_object[\"label\"],\n",
    "            \"type\": _type,\n",
    "            \"attr_updates\": attr_updates,\n",
    "            \"constants_updates\": constants_updates\n",
    "        }\n",
    "    )\n",
    "\n",
    "    db_connection.exec_query(o2o_query)\n",
    "    print(f\"→ (:{_config['from_object']}) - [:{_type}] -> (:{_config['to_object']}) Relationship built\")\n",
    "\n",
    "\n",
    "def build_relationships(_db_connection, _relationships):\n",
    "    print(\"\\n=== INDEXES ===\")\n",
    "    for _type, _configs in _relationships.items():\n",
    "        for _config in _configs:\n",
    "            build_foreign_key_index(_db_connection=_db_connection,\n",
    "                                    _config=_config)\n",
    "\n",
    "    print(\"\\n=== O2O RELATIONSHIPS ===\")\n",
    "    for _type, _configs in _relationships.items():\n",
    "        for _config in _configs:\n",
    "            build_relationship(_db_connection=_db_connection,\n",
    "                               _type=_type,\n",
    "                               _config=_config)"
   ],
   "id": "a1abec1046b69ea6",
   "outputs": [],
   "execution_count": 331
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:13:29.899656100Z",
     "start_time": "2025-11-21T16:13:12.632898Z"
    }
   },
   "cell_type": "code",
   "source": [
    "build_relationships(_db_connection=db_connection,\n",
    "                    _relationships=o2o_relationships)"
   ],
   "id": "38773cca85ccb078",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "=== INDEXES ===\n",
      "Index ensured for :Record(kmNumber)\n",
      "Index ensured for :Record(relatedChange)\n",
      "Index ensured for :Record(relatedIncident)\n",
      "Index ensured for :Record(relatedInteraction)\n",
      "Index ensured for :Record(ciNameAff)\n",
      "Index ensured for :Record(serviceComponentAff)\n",
      "Index ensured for :Record(ciNameCby)\n",
      "Index ensured for :Record(serviceComponentCBy)\n",
      "Index ensured for :Record(serviceComponentAff)\n",
      "Index ensured for :Record(ciNameAff)\n",
      "Index ensured for :Record(serviceComponentCBy)\n",
      "Index ensured for :Record(ciNameCby)\n",
      "\n",
      "=== O2O RELATIONSHIPS ===\n",
      "→ (:{'label': 'Incident|Interaction'}) - [:USED_KM] -> (:{'label': 'KnowledgeDocument', 'foreign_key': 'kmNumber'}) Relationship built\n",
      "→ (:{'label': 'Incident'}) - [:RELATED_CHANGE] -> (:{'label': 'Change', 'foreign_key': 'relatedChange'}) Relationship built\n",
      "→ (:{'label': 'Interaction'}) - [:RELATED_INCIDENT] -> (:{'label': 'Incident', 'foreign_key': 'relatedIncident'}) Relationship built\n",
      "→ (:{'label': 'Interaction', 'foreign_key': 'relatedInteraction'}) - [:RELATED_INCIDENT] -> (:{'label': 'Incident'}) Relationship built\n",
      "→ (:{'label': 'Incident|Interaction|Change'}) - [:AFFECTED_CI] -> (:{'label': 'ConfigurationItem', 'foreign_key': 'ciNameAff'}) Relationship built\n",
      "→ (:{'label': 'Incident|Interaction|Change'}) - [:AFFECTED_SC] -> (:{'label': 'ServiceComponent', 'foreign_key': 'serviceComponentAff'}) Relationship built\n",
      "→ (:{'label': 'Incident'}) - [:CAUSED_BY_CI] -> (:{'label': 'ConfigurationItem', 'foreign_key': 'ciNameCby'}) Relationship built\n",
      "→ (:{'label': 'Incident'}) - [:CAUSED_BY_SC] -> (:{'label': 'ServiceComponent', 'foreign_key': 'serviceComponentCBy'}) Relationship built\n",
      "→ (:{'label': 'ServiceComponent', 'foreign_key': 'serviceComponentAff'}) - [:CONTAINS] -> (:{'label': 'ConfigurationItem', 'foreign_key': 'ciNameAff'}) Relationship built\n",
      "→ (:{'label': 'ServiceComponent', 'foreign_key': 'serviceComponentCBy'}) - [:CONTAINS] -> (:{'label': 'ConfigurationItem', 'foreign_key': 'ciNameCby'}) Relationship built\n"
     ]
    }
   ],
   "execution_count": 332
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:13:31.166731900Z",
     "start_time": "2025-11-21T16:13:29.910930700Z"
    }
   },
   "cell_type": "code",
   "source": "get_graph_statistics(db_connection)",
   "id": "f7340c5f3d705b65",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "=== GRAPH STATISTICS ===\n",
      "\n",
      "--- Node counts ---\n",
      "(:Record)                      690622\n",
      "(:Interaction)                 147172\n",
      "(:Incident)                    47057\n",
      "(:Change)                      18026\n",
      "(:ConfigurationItem)           15134\n",
      "(:KnowledgeDocument)           2373\n",
      "(:ServiceComponent)            340\n",
      "(:Resource)                    242\n",
      "(:Log)                         4\n",
      "\n",
      "--- Relationship counts ---\n",
      "[:EXTRACTED_FROM]              2371470\n",
      "[:CONTAINS]                    705949\n",
      "[:AFFECTED_CI]                 226751\n",
      "[:AFFECTED_SC]                 214729\n",
      "[:USED_KM]                     194437\n",
      "[:RELATED_INCIDENT]            52687\n",
      "[:CAUSED_BY_CI]                45499\n",
      "[:CAUSED_BY_SC]                43123\n",
      "[:RELATED_CHANGE]              536\n",
      "\n",
      "--- Totals ---\n",
      "Total nodes: 920970\n",
      "Total relationships: 3855181\n"
     ]
    }
   ],
   "execution_count": 333
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "## Build Events\n",
    "\n",
    "There are four types of events Incident Events, Incident Activity Events, Change Events and Interaction Events"
   ],
   "id": "47fd24dc077101d"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:13:31.183983600Z",
     "start_time": "2025-11-21T16:13:31.175520400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "EVENTS = {\n",
    "    \"IncidentEvent\": [\n",
    "        {\n",
    "            \"log\": bpic14_incident,\n",
    "            \"sysId\": \"incidentId\",\n",
    "            \"id_addition\": \"_Open\",\n",
    "            \"attributes\": {\n",
    "                \"timestamp\": \"openTime\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"activity\": \"'Open'\"\n",
    "            }\n",
    "        }, {\n",
    "            \"log\": bpic14_incident,\n",
    "            \"sysId\": \"incidentId\",\n",
    "            \"id_addition\": \"_Resolve\",\n",
    "            \"attributes\": {\n",
    "                \"timestamp\": \"resolvedTime\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"activity\": \"'Resolve'\"\n",
    "            }\n",
    "        }, {\n",
    "            \"log\": bpic14_incident,\n",
    "            \"sysId\": \"incidentId\",\n",
    "            \"id_addition\": \"_Close\",\n",
    "            \"attributes\": {\n",
    "                \"timestamp\": \"closeTime\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"activity\": \"'Close'\"\n",
    "            }\n",
    "        }\n",
    "    ],\n",
    "    \"ChangeEvent\": [\n",
    "        {\n",
    "            \"log\": bpic14_change,\n",
    "            \"sysId\": \"changeId\",\n",
    "            \"id_addition\": \"_Start\",\n",
    "            \"attributes\": {\n",
    "                \"timestamp\": \"actualStart\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"activity\": \"'Start'\"\n",
    "            }\n",
    "        }, {\n",
    "            \"log\": bpic14_change,\n",
    "            \"sysId\": \"changeId\",\n",
    "            \"id_addition\": \"_End\",\n",
    "            \"attributes\": {\n",
    "                \"timestamp\": \"actualEnd\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"activity\": \"'End'\"\n",
    "            }\n",
    "        }\n",
    "    ],\n",
    "    \"InteractionEvent\": [\n",
    "        {\n",
    "            \"log\": bpic14_interaction,\n",
    "            \"sysId\": \"interactionId\",\n",
    "            \"id_addition\": \"_Open\",\n",
    "            \"attributes\": {\n",
    "                \"timestamp\": \"openTime\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"activity\": \"'Open'\"\n",
    "            }\n",
    "        }, {\n",
    "            \"log\": bpic14_interaction,\n",
    "            \"sysId\": \"interactionId\",\n",
    "            \"id_addition\": \"_Close\",\n",
    "            \"attributes\": {\n",
    "                \"timestamp\": \"closeTime\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"activity\": \"'Close'\"\n",
    "            }\n",
    "        }],\n",
    "    \"IncidentActivityEvent\": [\n",
    "        {\n",
    "            \"log\": bpic14_incident_activity,\n",
    "            \"sysId\": \"activityNumber\",\n",
    "            \"attributes\": {\n",
    "                \"activity\": \"incidentActivityType\",\n",
    "                \"timestamp\": \"dateStamp\"\n",
    "            }\n",
    "        }\n",
    "    ],\n",
    "}\n"
   ],
   "id": "77c6439870b3f3ce",
   "outputs": [],
   "execution_count": 334
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:13:54.384199400Z",
     "start_time": "2025-11-21T16:13:31.184985800Z"
    }
   },
   "cell_type": "code",
   "source": "build_entities(db_connection, entities=EVENTS)",
   "id": "241f1392016fb204",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "=== INDEXES ===\n",
      "Index for :IncidentEvent(sysId)\n",
      "Index for :ChangeEvent(sysId)\n",
      "Index for :InteractionEvent(sysId)\n",
      "Index for :IncidentActivityEvent(sysId)\n",
      "\n",
      "=== Building ENTITY NODES ===\n",
      "→ IncidentEvent nodes created.\n",
      "→ IncidentEvent nodes created.\n",
      "→ IncidentEvent nodes created.\n",
      "→ ChangeEvent nodes created.\n",
      "→ ChangeEvent nodes created.\n",
      "→ InteractionEvent nodes created.\n",
      "→ InteractionEvent nodes created.\n",
      "→ IncidentActivityEvent nodes created.\n"
     ]
    }
   ],
   "execution_count": 335
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:13:55.881098700Z",
     "start_time": "2025-11-21T16:13:54.392227900Z"
    }
   },
   "cell_type": "code",
   "source": "get_graph_statistics(db_connection)",
   "id": "9d91fb2295984cc0",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "=== GRAPH STATISTICS ===\n",
      "\n",
      "--- Node counts ---\n",
      "(:Record)                      690622\n",
      "(:IncidentActivityEvent)       466737\n",
      "(:InteractionEvent)            294008\n",
      "(:Interaction)                 147172\n",
      "(:IncidentEvent)               138038\n",
      "(:Incident)                    47057\n",
      "(:ChangeEvent)                 33381\n",
      "(:Change)                      18026\n",
      "(:ConfigurationItem)           15134\n",
      "(:KnowledgeDocument)           2373\n",
      "(:ServiceComponent)            340\n",
      "(:Resource)                    242\n",
      "(:Log)                         4\n",
      "\n",
      "--- Relationship counts ---\n",
      "[:EXTRACTED_FROM]              3324284\n",
      "[:CONTAINS]                    705949\n",
      "[:AFFECTED_CI]                 226751\n",
      "[:AFFECTED_SC]                 214729\n",
      "[:USED_KM]                     194437\n",
      "[:RELATED_INCIDENT]            52687\n",
      "[:CAUSED_BY_CI]                45499\n",
      "[:CAUSED_BY_SC]                43123\n",
      "[:RELATED_CHANGE]              536\n",
      "\n",
      "--- Totals ---\n",
      "Total nodes: 1853134\n",
      "Total relationships: 4807995\n"
     ]
    }
   ],
   "execution_count": 336
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "## E2O Relationships",
   "id": "58a54db18dbbed8b"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:13:55.899998600Z",
     "start_time": "2025-11-21T16:13:55.891035800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "e2o_relationships = {\n",
    "    \"CORR\": [\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"IncidentEvent\"\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"Incident\",\n",
    "                \"foreign_key\": \"incidentId\"\n",
    "            }\n",
    "        },\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"ChangeEvent\"\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"Change\",\n",
    "                \"foreign_key\": \"changeId\"\n",
    "            }\n",
    "        },\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"InteractionEvent\"\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"Interaction\",\n",
    "                \"foreign_key\": \"interactionId\"\n",
    "            }\n",
    "        },\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"IncidentActivityEvent\"\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"Incident\",\n",
    "                \"foreign_key\": \"incidentId\"\n",
    "            }\n",
    "        }\n",
    "    ],\n",
    "    \"EXECUTED_BY\": [\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"IncidentActivityEvent\"\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"Resource\",\n",
    "                \"foreign_key\": \"assignmentGroup\"\n",
    "            }\n",
    "        }\n",
    "    ]\n",
    "\n",
    "}"
   ],
   "id": "8b98e07c99edc94",
   "outputs": [],
   "execution_count": 337
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:14:08.580811800Z",
     "start_time": "2025-11-21T16:13:55.901010100Z"
    }
   },
   "cell_type": "code",
   "source": "build_relationships(db_connection, _relationships=e2o_relationships)",
   "id": "369efefe3b6cdf44",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "=== INDEXES ===\n",
      "Index ensured for :Record(incidentId)\n",
      "Index ensured for :Record(changeId)\n",
      "Index ensured for :Record(interactionId)\n",
      "Index ensured for :Record(incidentId)\n",
      "Index ensured for :Record(assignmentGroup)\n",
      "\n",
      "=== O2O RELATIONSHIPS ===\n",
      "→ (:{'label': 'IncidentEvent'}) - [:CORR] -> (:{'label': 'Incident', 'foreign_key': 'incidentId'}) Relationship built\n",
      "→ (:{'label': 'ChangeEvent'}) - [:CORR] -> (:{'label': 'Change', 'foreign_key': 'changeId'}) Relationship built\n",
      "→ (:{'label': 'InteractionEvent'}) - [:CORR] -> (:{'label': 'Interaction', 'foreign_key': 'interactionId'}) Relationship built\n",
      "→ (:{'label': 'IncidentActivityEvent'}) - [:CORR] -> (:{'label': 'Incident', 'foreign_key': 'incidentId'}) Relationship built\n",
      "→ (:{'label': 'IncidentActivityEvent'}) - [:EXECUTED_BY] -> (:{'label': 'Resource', 'foreign_key': 'assignmentGroup'}) Relationship built\n"
     ]
    }
   ],
   "execution_count": 338
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:14:10.272746100Z",
     "start_time": "2025-11-21T16:14:08.589336100Z"
    }
   },
   "cell_type": "code",
   "source": "get_graph_statistics(db_connection)",
   "id": "67bd05e08a938ed9",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "=== GRAPH STATISTICS ===\n",
      "\n",
      "--- Node counts ---\n",
      "(:Record)                      690622\n",
      "(:IncidentActivityEvent)       466737\n",
      "(:InteractionEvent)            294008\n",
      "(:Interaction)                 147172\n",
      "(:IncidentEvent)               138038\n",
      "(:Incident)                    47057\n",
      "(:ChangeEvent)                 33381\n",
      "(:Change)                      18026\n",
      "(:ConfigurationItem)           15134\n",
      "(:KnowledgeDocument)           2373\n",
      "(:ServiceComponent)            340\n",
      "(:Resource)                    242\n",
      "(:Log)                         4\n",
      "\n",
      "--- Relationship counts ---\n",
      "[:EXTRACTED_FROM]              3324284\n",
      "[:CORR]                        932164\n",
      "[:CONTAINS]                    705949\n",
      "[:EXECUTED_BY]                 466737\n",
      "[:AFFECTED_CI]                 226751\n",
      "[:AFFECTED_SC]                 214729\n",
      "[:USED_KM]                     194437\n",
      "[:RELATED_INCIDENT]            52687\n",
      "[:CAUSED_BY_CI]                45499\n",
      "[:CAUSED_BY_SC]                43123\n",
      "[:RELATED_CHANGE]              536\n",
      "\n",
      "--- Totals ---\n",
      "Total nodes: 1853134\n",
      "Total relationships: 6206896\n"
     ]
    }
   ],
   "execution_count": 339
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# 2. ASSIGN TYPES",
   "id": "c56f97496e15b5de"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:14:10.292055400Z",
     "start_time": "2025-11-21T16:14:10.282613800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def add_object_type_node(object_type):\n",
    "    query_create_ot = '''\n",
    "        MERGE (ot:ObjectType {objectType: $objectType})\n",
    "    '''\n",
    "\n",
    "    db_connection.exec_query(\n",
    "        Query(query_str=query_create_ot,\n",
    "              parameters={'objectType': object_type}\n",
    "              )\n",
    "    )\n",
    "\n",
    "    query_str = '''\n",
    "        :auto\n",
    "        MATCH (ot:ObjectType {objectType: $objectType })\n",
    "        MATCH (o:$label)\n",
    "        CALL (o, ot) {\n",
    "            MERGE (o) - [:IS_OF_TYPE] -> (ot)\n",
    "            } IN TRANSACTIONS\n",
    "    '''\n",
    "\n",
    "    query = Query(\n",
    "        query_str=query_str,\n",
    "        parameters={'objectType': object_type},\n",
    "        template_string_parameters={\"label\": object_type}\n",
    "    )\n",
    "\n",
    "    db_connection.exec_query(query)\n",
    "    print(f'-> (:ObjectType {{objectType: \"{object_type}\"}}) created.')"
   ],
   "id": "fd52e47c8d38c900",
   "outputs": [],
   "execution_count": 340
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:14:12.288082800Z",
     "start_time": "2025-11-21T16:14:10.292055400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "for label in objects.keys():\n",
    "    add_object_type_node(object_type=label)"
   ],
   "id": "e8e26d3ac8851895",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-> (:ObjectType {objectType: \"Incident\"}) created.\n",
      "-> (:ObjectType {objectType: \"Interaction\"}) created.\n",
      "-> (:ObjectType {objectType: \"Change\"}) created.\n",
      "-> (:ObjectType {objectType: \"KnowledgeDocument\"}) created.\n",
      "-> (:ObjectType {objectType: \"Resource\"}) created.\n",
      "-> (:ObjectType {objectType: \"ConfigurationItem\"}) created.\n",
      "-> (:ObjectType {objectType: \"ServiceComponent\"}) created.\n"
     ]
    }
   ],
   "execution_count": 341
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:14:12.308785700Z",
     "start_time": "2025-11-21T16:14:12.298128200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def add_event_type_node(event_type):\n",
    "    query_create_et = '''\n",
    "        MERGE (et:EventType {eventType: $eventType})\n",
    "    '''\n",
    "\n",
    "    db_connection.exec_query(\n",
    "        Query(query_str=query_create_et,\n",
    "              parameters={'eventType': event_type}\n",
    "              )\n",
    "    )\n",
    "\n",
    "    query_str = '''\n",
    "        :auto\n",
    "        MATCH (et:EventType {eventType: $eventType })\n",
    "        MATCH (e:$label)\n",
    "        CALL (e, et) {\n",
    "            MERGE (e) - [:IS_OF_TYPE] -> (et)\n",
    "        }\n",
    "        IN TRANSACTIONS\n",
    "    '''\n",
    "\n",
    "    query = Query(\n",
    "        query_str=query_str,\n",
    "        parameters={'eventType': event_type},\n",
    "        template_string_parameters={\"label\": event_type}\n",
    "    )\n",
    "\n",
    "    db_connection.exec_query(query)\n",
    "    print(f'-> (:EventType {{eventType: \"{event_type}\"}}) created.')"
   ],
   "id": "354530c8b86e5134",
   "outputs": [],
   "execution_count": 342
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:14:17.856353600Z",
     "start_time": "2025-11-21T16:14:12.308785700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "for label in EVENTS.keys():\n",
    "    add_event_type_node(event_type=label)"
   ],
   "id": "6ccf8d2100a4d57a",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-> (:EventType {eventType: \"IncidentEvent\"}) created.\n",
      "-> (:EventType {eventType: \"ChangeEvent\"}) created.\n",
      "-> (:EventType {eventType: \"InteractionEvent\"}) created.\n",
      "-> (:EventType {eventType: \"IncidentActivityEvent\"}) created.\n"
     ]
    }
   ],
   "execution_count": 343
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# 3) Enrichment",
   "id": "59e1a2b8b118357e"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "## 3.1 Materialize CI_SC Objects",
   "id": "283ccfeb98fa28ae"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:14:17.877878Z",
     "start_time": "2025-11-21T16:14:17.870439300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def materialize_object(_db_connection, _label, _config):\n",
    "    from_object = _config[\"from_object\"]\n",
    "    to_object = _config[\"to_object\"]\n",
    "    set_attributes = []\n",
    "\n",
    "    for _object in [from_object, to_object]:\n",
    "        if \"attributes\" in _object:\n",
    "            set_attributes.extend(\n",
    "                [f\"new.{key} = COALESCE(new.{key}, from.{attr})\" for key, attr in _object[\"attributes\"].items()])\n",
    "\n",
    "    materialize_relationship_query = '''\n",
    "        :auto\n",
    "        MATCH (from) - [ :IS_OF_TYPE] -> (:ObjectType {objectType: $from_object})\n",
    "        MATCH (to) - [ :IS_OF_TYPE] -> (:ObjectType {objectType: $to_object})\n",
    "        MATCH (from) - [r WHERE type(r) = $relation_type] -> (to)\n",
    "        CALL (from, r, to) {\n",
    "            MERGE (new:$materialized_object {sysId: from.sysId + '_' + to.sysId})\n",
    "            MERGE (from) <- [:RELATED] - (new) - [:RELATED] -> (to)\n",
    "            SET new[$from_object] = from.sysId,\n",
    "                new[$to_object] = to.sysId\n",
    "            $set_attributes\n",
    "        } IN TRANSACTIONS\n",
    "    '''\n",
    "\n",
    "    materialize_query = Query(\n",
    "        query_str=materialize_relationship_query,\n",
    "        parameters={\n",
    "            \"from_object\": from_object[\"label\"],\n",
    "            \"to_object\": to_object[\"label\"],\n",
    "            \"relation_type\": _config[\"relation_type\"]\n",
    "        },\n",
    "        template_string_parameters={\n",
    "            \"materialized_object\": _label,\n",
    "            \"set_attributes\": \"SET \" + \", \".join(set_attributes)\n",
    "        }\n",
    "    )\n",
    "\n",
    "    _db_connection.exec_query(materialize_query)\n",
    "    print(f\"→ {_label} nodes created.\")\n"
   ],
   "id": "f8c32a78b95eec9c",
   "outputs": [],
   "execution_count": 344
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:14:17.885404700Z",
     "start_time": "2025-11-21T16:14:17.877878Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def materialize_objects(_db_connection, _objects):\n",
    "    \"\"\"\n",
    "    Create entities. Includes indexing.\n",
    "    \"\"\"\n",
    "    print(\"\\n=== INDEXES ===\")\n",
    "    for _label in objects_to_materialize.keys():\n",
    "        try:\n",
    "            create_index(_db_connection=_db_connection,\n",
    "                         _label=_label)\n",
    "        except Exception as e:\n",
    "            print(f\"Failed to create index for {_label}: {e}\")\n",
    "\n",
    "    print(\"\\n=== Materializing Relationships ===\")\n",
    "    for _label, _configs in _objects.items():\n",
    "        for _config in _configs:\n",
    "            try:\n",
    "                materialize_object(\n",
    "                    _db_connection=_db_connection,\n",
    "                    _label=_label,\n",
    "                    _config=_config)\n",
    "            except Exception as e:\n",
    "                print(f\"Failed for {_label}: {e}\")"
   ],
   "id": "567224006cf2adba",
   "outputs": [],
   "execution_count": 345
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:14:17.892324800Z",
     "start_time": "2025-11-21T16:14:17.886404100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "objects_to_materialize = {\n",
    "    \"CI_SC\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"ServiceComponent\",\n",
    "            \"attributes\": {\n",
    "                \"ciType\": \"ciType\",\n",
    "                \"ciSubtype\": \"ciSubtype\"\n",
    "            }\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"ConfigurationItem\"\n",
    "        },\n",
    "        \"relation_type\": \"CONTAINS\"\n",
    "    }]\n",
    "}"
   ],
   "id": "38e774f5cf2b8394",
   "outputs": [],
   "execution_count": 346
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:14:18.726996300Z",
     "start_time": "2025-11-21T16:14:17.893323800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "materialize_objects(_db_connection=db_connection,\n",
    "                    _objects=objects_to_materialize)"
   ],
   "id": "f11be3fdbdcd09af",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "=== INDEXES ===\n",
      "Index for :CI_SC(sysId)\n",
      "\n",
      "=== Materializing Relationships ===\n",
      "→ CI_SC nodes created.\n"
     ]
    }
   ],
   "execution_count": 347
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:14:18.895205900Z",
     "start_time": "2025-11-21T16:14:18.734510Z"
    }
   },
   "cell_type": "code",
   "source": [
    "for _object in materialized_objects.keys():\n",
    "    add_object_type_node(_object)"
   ],
   "id": "9717996010070281",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-> (:ObjectType {objectType: \"CI_SC\"}) created.\n"
     ]
    }
   ],
   "execution_count": 348
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "## 3.2 Extend Relationships to Materialized CI_SC Objects",
   "id": "28d1b0377825ec9c"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:14:18.908682800Z",
     "start_time": "2025-11-21T16:14:18.895205900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "relationships_to_extend = {\n",
    "    \"AFFECTED_CI_SC\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"Incident|Interaction|Change\",\n",
    "            \"relationships\": [\n",
    "                {\n",
    "                    \"related_label\": \"ServiceComponent\",\n",
    "                    \"related_object\": \"sc\",\n",
    "                    \"relation_type\": \"AFFECTED_SC\"\n",
    "                },\n",
    "                {\n",
    "                    \"related_label\": \"ConfigurationItem\",\n",
    "                    \"related_object\": \"ci\",\n",
    "                    \"relation_type\": \"AFFECTED_CI\"\n",
    "                }]\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"CI_SC\",\n",
    "            \"relationships\": [\n",
    "                {\n",
    "                    \"related_label\": \"ServiceComponent\",\n",
    "                    \"related_object\": \"sc\",\n",
    "                    \"relation_type\": \"RELATED\"\n",
    "                },\n",
    "                {\n",
    "                    \"related_label\": \"ConfigurationItem\",\n",
    "                    \"related_object\": \"ci\",\n",
    "                    \"relation_type\": \"RELATED\"\n",
    "                }]\n",
    "        }\n",
    "    }],\n",
    "    \"CAUSED_BY_CI_SC\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"Incident\",\n",
    "            \"relationships\": [\n",
    "                {\n",
    "                    \"related_label\": \"ServiceComponent\",\n",
    "                    \"related_object\": \"sc\",\n",
    "                    \"relation_type\": \"CAUSED_BY_SC\"\n",
    "                },\n",
    "                {\n",
    "                    \"related_label\": \"ConfigurationItem\",\n",
    "                    \"related_object\": \"ci\",\n",
    "                    \"relation_type\": \"CAUSED_BY_CI\"\n",
    "                }]\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"CI_SC\",\n",
    "            \"relationships\": [\n",
    "                {\n",
    "                    \"related_label\": \"ServiceComponent\",\n",
    "                    \"related_object\": \"sc\",\n",
    "                    \"relation_type\": \"RELATED\"\n",
    "                },\n",
    "                {\n",
    "                    \"related_label\": \"ConfigurationItem\",\n",
    "                    \"related_object\": \"ci\",\n",
    "                    \"relation_type\": \"RELATED\"\n",
    "                }]\n",
    "        }\n",
    "    }],\n",
    "    \"CORR\": [\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"ChangeEvent\",\n",
    "                \"relationships\": [\n",
    "                    {\n",
    "                        \"related_label\": \"Change\",\n",
    "                        \"related_object\": \"change\",\n",
    "                        \"relation_type\": \"CORR\"\n",
    "                    }]\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"CI_SC\",\n",
    "                \"relationships\": [\n",
    "                    {\n",
    "                        \"related_label\": \"Change\",\n",
    "                        \"related_object\": \"change\",\n",
    "                        \"relation_type\": \"AFFECTED_CI_SC\"\n",
    "                    }]\n",
    "            }\n",
    "        },\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"IncidentEvent\",\n",
    "                \"relationships\": [\n",
    "                    {\n",
    "                        \"related_label\": \"Incident\",\n",
    "                        \"related_object\": \"incident\",\n",
    "                        \"relation_type\": \"CORR\"\n",
    "                    }]\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"CI_SC\",\n",
    "                \"relationships\": [\n",
    "                    {\n",
    "                        \"related_label\": \"Incident\",\n",
    "                        \"related_object\": \"incident\",\n",
    "                        \"relation_type\": \"AFFECTED_CI_SC\"\n",
    "                    }]\n",
    "            }\n",
    "        },\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"IncidentActivityEvent\",\n",
    "                \"relationships\": [\n",
    "                    {\n",
    "                        \"related_label\": \"Incident\",\n",
    "                        \"related_object\": \"incident\",\n",
    "                        \"relation_type\": \"CORR\"\n",
    "                    }]\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"CI_SC\",\n",
    "                \"relationships\": [\n",
    "                    {\n",
    "                        \"related_label\": \"Incident\",\n",
    "                        \"related_object\": \"incident\",\n",
    "                        \"relation_type\": \"AFFECTED_CI_SC\"\n",
    "                    }]\n",
    "            }\n",
    "        },\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"InteractionEvent\",\n",
    "                \"relationships\": [\n",
    "                    {\n",
    "                        \"related_label\": \"Interaction\",\n",
    "                        \"related_object\": \"interaction\",\n",
    "                        \"relation_type\": \"CORR\"\n",
    "                    }]\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"CI_SC\",\n",
    "                \"relationships\": [\n",
    "                    {\n",
    "                        \"related_label\": \"Interaction\",\n",
    "                        \"related_object\": \"interaction\",\n",
    "                        \"relation_type\": \"AFFECTED_CI_SC\"\n",
    "                    }]\n",
    "            }\n",
    "        }\n",
    "    ],\n",
    "}"
   ],
   "id": "af4a20b50437b4b9",
   "outputs": [],
   "execution_count": 349
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:14:18.920613500Z",
     "start_time": "2025-11-21T16:14:18.910697400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def extend_relationship(_db_connection, _type, _config):\n",
    "    from_object = _config[\"from_object\"]\n",
    "    to_object = _config[\"to_object\"]\n",
    "\n",
    "    query_str = '''\n",
    "        :auto\n",
    "        MATCH (from:$from_object)\n",
    "        MATCH (to:$to_object)\n",
    "        $relation_conditions\n",
    "        WITH distinct from, to\n",
    "        CALL (from, to) {\n",
    "            MERGE (from) - [r:$type] -> (to)\n",
    "        } IN TRANSACTIONS\n",
    "    '''\n",
    "\n",
    "    relation_conditions = []\n",
    "    for _object_type, _object in {\"from\": from_object, \"to\": to_object}.items():\n",
    "        if \"relationships\" in _object:\n",
    "            for relationship in _object['relationships']:\n",
    "                rel_type = relationship[\"relation_type\"]\n",
    "                related_object = relationship[\"related_object\"]\n",
    "                related_label = relationship[\"related_label\"]\n",
    "                relation_conditions.append(\n",
    "                    f\"MATCH ({_object_type}) - [:{rel_type}] - ({related_object}:{related_label})\")\n",
    "\n",
    "    query = Query(\n",
    "        query_str=query_str,\n",
    "        template_string_parameters={\n",
    "            \"from_object\": from_object[\"label\"],\n",
    "            \"to_object\": to_object[\"label\"],\n",
    "            \"type\": _type,\n",
    "            \"relation_conditions\": \"\\n\".join(relation_conditions)\n",
    "        }\n",
    "    )\n",
    "\n",
    "    _db_connection.exec_query(query)\n",
    "    print(f\"→ (:{from_object[\"label\"]}) - [:{_type}] -> (:{to_object[\"label\"]}) Relationship built\")\n",
    "\n",
    "def extend_relationships(_db_connection, _relationships):\n",
    "    for _type, _configs in _relationships.items():\n",
    "        for _config in _configs:\n",
    "            try:\n",
    "                extend_relationship(_db_connection, _type, _config)\n",
    "            except Exception as e:\n",
    "                print(f\"Failed for {_type}: {e}\")\n"
   ],
   "id": "12a71ece5c20904a",
   "outputs": [],
   "execution_count": 350
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-21T16:14:29.538530700Z",
     "start_time": "2025-11-21T16:14:18.921604600Z"
    }
   },
   "cell_type": "code",
   "source": "extend_relationships(db_connection, relationships_to_extend)",
   "id": "7fba48b0ffe95b1d",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "→ (:Incident|Interaction|Change) - [:AFFECTED_CI_SC] -> (:CI_SC) Relationship built\n",
      "→ (:Incident) - [:CAUSED_BY_CI_SC] -> (:CI_SC) Relationship built\n",
      "→ (:ChangeEvent) - [:CORR] -> (:CI_SC) Relationship built\n",
      "→ (:IncidentEvent) - [:CORR] -> (:CI_SC) Relationship built\n",
      "→ (:IncidentActivityEvent) - [:CORR] -> (:CI_SC) Relationship built\n",
      "→ (:InteractionEvent) - [:CORR] -> (:CI_SC) Relationship built\n"
     ]
    }
   ],
   "execution_count": 351
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "## 3.3 Check Incomplete Traces at Start And End of Period",
   "id": "66340f3acc3e4ac0"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "# Filter out all events of objects that have at least one event before cutoff\n",
    "Cutoff = 2013-08-19T09:59:53.000000000+01:00"
   ],
   "id": "6e27209c011817a5"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "source": [
    "results = []\n",
    "labels = ['Incident', 'Interaction', 'Change']\n",
    "\n",
    "count_query = '''\n",
    "    MATCH (ot:ObjectType) <- [:IS_OF_TYPE] - (o) - [] - (e:Event)\n",
    "    WHERE ot.objectType in $labels\n",
    "    WITH e, ot, o, e.timestamp < dateTime(\"2013-08-19T09:59:53.000000000+01:00\") as before_cutoff\n",
    "    WITH ot, o, collect(distinct before_cutoff) as before_cutoffs\n",
    "    WHERE True in before_cutoffs\n",
    "    MATCH (o) - [] - (all_e:Event)\n",
    "    RETURN ot.objectType as _label, count(distinct o) as object_deleted, count(distinct all_e) as events_deleted\n",
    "'''\n",
    "query = Query(\n",
    "    query_str=count_query,\n",
    "    parameters={'labels': labels}\n",
    ")\n",
    "result = pd.DataFrame(db_connection.exec_query(query))\n",
    "results.append(result)\n",
    "\n",
    "delete_query_str = '''\n",
    "    MATCH (ot:ObjectType) <- [:IS_OF_TYPE] - (o) - [] - (e:Event)\n",
    "    WHERE ot.objectType in $labels\n",
    "    WITH e, o, e.timestamp < dateTime(\"2013-08-19T09:59:53.000000000+01:00\") as before_cutoff\n",
    "    WITH o, collect(distinct before_cutoff) as before_cutoffs\n",
    "    WHERE True in before_cutoffs\n",
    "    MATCH (o) - [] - (all_e:Event)\n",
    "    DETACH DELETE o\n",
    "    DETACH DELETE all_e\n",
    "'''\n",
    "\n",
    "delete_query = Query(\n",
    "    query_str=delete_query_str,\n",
    "    parameters={'labels': labels}\n",
    ")\n",
    "db_connection.exec_query(delete_query)\n",
    "\n",
    "df_result = pd.concat(results)\n",
    "df_result"
   ],
   "id": "1689de9b5be00367",
   "outputs": [],
   "execution_count": null
  },
  {
   "metadata": {},
   "cell_type": "code",
   "source": [
    "\n",
    "query = '''\n",
    "    MATCH (ot:ObjectType) <- [:IS_OF_TYPE] - (o) - [] - (e:Event)\n",
    "    WHERE ot.objectType in $labels\n",
    "    RETURN ot.objectType as _label, count(distinct o) as objects_kept, count(distinct e) as events_kept\n",
    "'''\n",
    "query = Query(\n",
    "    query_str=query,\n",
    "    parameters={'labels': labels}\n",
    ")\n",
    "df_result_kept = pd.DataFrame(db_connection.exec_query(query))\n",
    "print(df_result_kept)"
   ],
   "id": "f285159d29d4a8cb",
   "outputs": [],
   "execution_count": null
  },
  {
   "metadata": {},
   "cell_type": "code",
   "source": [
    "df_both = df_result.set_index('_label').join(df_result_kept.set_index('_label'))\n",
    "df_both['total_objects'] = df_both['objects_kept'] + df_both['object_deleted']\n",
    "df_both['total_events'] = df_both['events_kept'] + df_both['events_deleted']\n",
    "df_both['% events deleted'] = round(df_both['events_deleted'] / df_both['total_events'] * 100, 2)\n",
    "df_both['% objects deleted'] = round(df_both['object_deleted'] / df_both['total_objects'] * 100, 2)\n",
    "df_both = df_both[\n",
    "    ['object_deleted', 'objects_kept', 'total_objects', '% objects deleted', 'events_deleted', 'events_kept',\n",
    "     'total_events', '% events deleted']]\n",
    "print(df_both)"
   ],
   "id": "f3c978dab55b399e",
   "outputs": [],
   "execution_count": null
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "## Delete non-referred CI_SC",
   "id": "b98d943539e288c"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "source": [
    "query = '''MATCH (ci_sc:CI_SC)\n",
    "WHERE NOT EXISTS((ci_sc) <- [] - (:Event)) AND NOT EXISTS ((ci_sc) -- (:Incident|Change|Interaction))\n",
    "DETACH DELETE ci_sc\n",
    "RETURN count(ci_sc) as cnt'''\n",
    "\n",
    "pd.DataFrame(db_connection.exec_query(query))"
   ],
   "id": "c2c3400d97cbb37b",
   "outputs": [],
   "execution_count": null
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### DF edges",
   "id": "abb86fd392e56fc5"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Each DF has attributes:\n",
    "- object (which object it correlates Incident, Interactions, Change, etc.)\n",
    "- object identifier (sysid) (which object it belongs incidentId, interactionsId, changeId, etc.)\n",
    "- dftype is an attribute that only exists for events of Incident objects that specifyes whether the DF relation connects IncidentActivityEvent or IncidentEvent Event nodes"
   ],
   "id": "621312905a7ac140"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "source": [
    "def build_df_edges(db_connection):\n",
    "    \"\"\"\n",
    "    Build :DF:* edges for all objects except KnowledgeDocument.\n",
    "    Creates separate DF edges for each object type and incident event type.\n",
    "    \"\"\"\n",
    "\n",
    "    all_objects = {**objects, **RESOURCES, **COMPLEX_OBJECTS}\n",
    "    excluded_objects = {\"KnowledgeDocument\", \"ConfigurationItem\",\n",
    "                        \"ServiceComponent\"}  # add here objects for which DF are not needed\n",
    "    for key in excluded_objects:\n",
    "        all_objects.pop(key, None)\n",
    "\n",
    "    with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "        print(\"=== BUILDING DIRECTLY_FOLLOWS (DF) EDGES (excluding Incident) ===\")\n",
    "\n",
    "        for obj_label, obj_data in all_objects.items():\n",
    "            sys_id_attr = obj_data.get(\"sysId\")\n",
    "\n",
    "            query = f\"\"\"\n",
    "            CALL apoc.periodic.iterate(\n",
    "                '\n",
    "                MATCH (e:Event)-[]-> (o) - [:IS_OF_TYPE] -> (ot:ObjectType {{objectType:\"{obj_label}\" }})\n",
    "                WHERE e.timestamp IS NOT NULL\n",
    "                WITH o, ot.objectType as oType, e ORDER BY e.timestamp, ID(e)\n",
    "                WITH o, oType, collect(e) AS events\n",
    "                UNWIND range(0, size(events)-2) AS idx\n",
    "                WITH events[idx] AS fromEv, events[idx+1] AS toEv, o.{sys_id_attr} AS objSysId, oType\n",
    "                RETURN fromEv, toEv, objSysId, oType\n",
    "                ',\n",
    "                '\n",
    "                WITH fromEv, toEv, objSysId, oType\n",
    "                MERGE (fromEv)-[rel:DF {{objectType:oType, id:objSysId}}]->(toEv)\n",
    "                ',\n",
    "                {{batchSize:1000, parallel:false}}\n",
    "            ) YIELD total\n",
    "            RETURN total\n",
    "            \"\"\"\n",
    "\n",
    "            res = session.run(query).data()\n",
    "            print(f\"{obj_label} DF creation result:\", res)\n"
   ],
   "id": "956c7eae0c9f430d",
   "outputs": [],
   "execution_count": null
  },
  {
   "metadata": {},
   "cell_type": "code",
   "source": "build_df_edges(db_connection)",
   "id": "f1a91776846473ba",
   "outputs": [],
   "execution_count": null
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### Statistics",
   "id": "ecc42898681ab0"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "source": "get_graph_statistics(db_connection)",
   "id": "10d4ce9d8042d1d4",
   "outputs": [],
   "execution_count": null
  },
  {
   "metadata": {},
   "cell_type": "code",
   "source": [
    "\n",
    "\n",
    "\n",
    "for dictionary in [objects, RESOURCES]:\n",
    "    for label in dictionary.keys():\n",
    "        add_object_type_node(object_type=label)\n",
    "        print(f'-> (:ObjectType {{objectType: \"{label}\"}} created.')"
   ],
   "id": "383139f9e464f3c7",
   "outputs": [],
   "execution_count": null
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 2
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython2",
   "version": "2.7.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
