{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "c64b4305d3d23d83",
   "metadata": {},
   "source": [
    "# 0. Prepare Project"
   ]
  },
  {
   "cell_type": "code",
   "id": "a83786237630755f",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-25T14:03:09.647567400Z",
     "start_time": "2025-11-25T14:03:09.399076400Z"
    }
   },
   "source": [
    "from typing import List\n",
    "%matplotlib inline\n",
    "import matplotlib.pyplot as plt\n",
    "\n",
    "from pathlib import Path\n",
    "\n",
    "from promg.modules.db_management import DBManagement\n",
    "from tabulate import tabulate\n",
    "import yaml\n",
    "\n",
    "from promg import Configuration, DatabaseConnection, Performance, SemanticHeader, DatasetDescriptions, OcedPg, Query\n",
    "\n",
    "from IPython.core.interactiveshell import InteractiveShell\n",
    "\n",
    "InteractiveShell.ast_node_interactivity = \"all\"\n",
    "\n",
    "import pandas as pd\n",
    "\n",
    "pd.set_option('display.width', 2000)"
   ],
   "outputs": [],
   "execution_count": 2
  },
  {
   "cell_type": "markdown",
   "id": "7621249a902ed231",
   "metadata": {},
   "source": [
    "### Define the project that you want to do analysis on"
   ]
  },
  {
   "cell_type": "code",
   "id": "9ff2c60b73bb0b11",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-25T14:03:10.117074100Z",
     "start_time": "2025-11-25T14:03:10.062798300Z"
    }
   },
   "source": [
    "case_study = 'bpic14'\n",
    "use_sample = False"
   ],
   "outputs": [],
   "execution_count": 3
  },
  {
   "cell_type": "code",
   "id": "aa3387e167d67135",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-25T14:03:10.551239100Z",
     "start_time": "2025-11-25T14:03:10.449933Z"
    }
   },
   "source": [
    "# retrieve configuration for case_study\n",
    "conf_path = Path(case_study, 'config.yaml')\n",
    "config = yaml.safe_load(open(conf_path))\n",
    "\n",
    "print(f\"These are the credentials that I expect to be set for the database.\")\n",
    "print(f\"db_name: {config['db_name']}\")\n",
    "print(f\"uri: {config['uri']}\")\n",
    "print(f\"password: {config['password']}\")\n",
    "print(\"----------------------\")\n",
    "print(f\"If you have other credentials, please change them at: {conf_path}\")"
   ],
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "These are the credentials that I expect to be set for the database.\n",
      "db_name: neo4j\n",
      "uri: bolt://localhost:7687\n",
      "password: bpic2014\n",
      "----------------------\n",
      "If you have other credentials, please change them at: bpic14\\config.yaml\n"
     ]
    }
   ],
   "execution_count": 4
  },
  {
   "cell_type": "markdown",
   "id": "e8120ab6c716ab32",
   "metadata": {},
   "source": [
    "### Prepare so we can use PromG to load the data and execute queries"
   ]
  },
  {
   "cell_type": "code",
   "id": "6a43b12f667191c7",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-25T14:03:12.308700500Z",
     "start_time": "2025-11-25T14:03:12.184568Z"
    }
   },
   "source": [
    "config = Configuration.init_conf_with_config_file(conf_path)\n",
    "db_connection = DatabaseConnection.set_up_connection(config=config)\n",
    "perf = Performance.set_up_performance(config=config)\n",
    "dataset_descriptions = DatasetDescriptions(config=config)"
   ],
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0it [00:00, ?it/s]"
     ]
    }
   ],
   "execution_count": 5
  },
  {
   "cell_type": "code",
   "id": "401c224950fa68e",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-25T09:43:25.912514100Z",
     "start_time": "2025-11-25T09:43:25.884221900Z"
    }
   },
   "source": [
    "def reset_pbar(pbar=perf.pbar, total=None):\n",
    "    # clear db\n",
    "    pbar.reset()\n",
    "    # TODO update dragons in PromG, #update method to set total for pbar\n",
    "    pbar.total = total\n",
    "    pbar.set_postfix_str()"
   ],
   "outputs": [],
   "execution_count": 5
  },
  {
   "cell_type": "markdown",
   "id": "6bb7df7ad87d2580",
   "metadata": {},
   "source": [
    "#### Prepare the DB"
   ]
  },
  {
   "cell_type": "code",
   "id": "62c8f00ce4cfd71a",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-25T09:43:27.307996400Z",
     "start_time": "2025-11-25T09:43:27.290058800Z"
    }
   },
   "source": [
    "# read the semantic header --> this details how the data should be structured\n",
    "semantic_header = SemanticHeader.create_semantic_header(config=config)"
   ],
   "outputs": [],
   "execution_count": 6
  },
  {
   "cell_type": "code",
   "id": "60b3495572a9748b",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-25T09:43:32.337187900Z",
     "start_time": "2025-11-25T09:43:27.925423400Z"
    }
   },
   "source": [
    "# Clear the DB (if use_sample = False, this should not take long on a loaded database)\n",
    "db_manager = DBManagement(db_connection=db_connection, semantic_header=None)\n",
    "db_manager.clear_db(\n",
    "    replace=True);  # in the community version of neo4j, replace is not allowed. In that case, set replace=False"
   ],
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1it [00:06,  6.93s/it, clear_db: took 6.93 seconds]"
     ]
    },
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\s156229\\PycharmProjects\\EKG_BPIC2014_Notebook\\.venv\\Lib\\site-packages\\promg\\utilities\\performance_handling.py:64: FutureWarning: The behavior of DataFrame concatenation with empty or all-NA entries is deprecated. In a future version, this will no longer exclude empty or all-NA columns when determining the result dtypes. To retain the old behavior, exclude the relevant entries before the concat operation.\n",
      "  perf.perf = pd.concat([perf.perf, pd.DataFrame.from_records([\n"
     ]
    }
   ],
   "execution_count": 7
  },
  {
   "cell_type": "markdown",
   "id": "9b9574f79a18bc22",
   "metadata": {},
   "source": [
    "### Statistics"
   ]
  },
  {
   "cell_type": "code",
   "id": "61eb8964fed3fe33",
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-25T09:43:34.601256900Z",
     "start_time": "2025-11-25T09:43:34.566034700Z"
    }
   },
   "source": [
    "def get_graph_statistics(_db_connection):\n",
    "    \"\"\"\n",
    "    Statistics about nodes and relations.\n",
    "    \"\"\"\n",
    "\n",
    "    with _db_connection.driver.get_session(database=_db_connection.db_name) as session:\n",
    "        print(\"\\n=== GRAPH STATISTICS ===\")\n",
    "\n",
    "        try:\n",
    "            node_query = \"\"\"\n",
    "            MATCH (n)\n",
    "            WITH n, labels(n) as labels\n",
    "            RETURN reduce(label_str = \"(\", l in labels | label_str + \":\" + l) + \")\" as label, count(n) as count ORDER BY count DESC\n",
    "            \"\"\"\n",
    "            node_counts = session.run(node_query)\n",
    "            print(\"\\n--- Node counts ---\")\n",
    "            for record in node_counts:\n",
    "                print(f\"{record['label']:<30} {record['count']}\")\n",
    "\n",
    "            rel_query = \"\"\"\n",
    "            MATCH (n) - [r] -> (n2)\n",
    "            RETURN \"[:\" + type(r) + \"]\" as  type, count(r) as count ORDER BY count DESC\n",
    "            \"\"\"\n",
    "            rel_counts = session.run(rel_query)\n",
    "            print(\"\\n--- Relationship counts ---\")\n",
    "            for record in rel_counts:\n",
    "                print(f\"{record['type']:<30} {record['count']}\")\n",
    "\n",
    "            total_nodes = session.run(\"MATCH (n) RETURN count(n) AS total\").single()[\"total\"]\n",
    "            total_rels = session.run(\"MATCH ()-[r]->() RETURN count(r) AS total\").single()[\"total\"]\n",
    "\n",
    "            print(\"\\n--- Totals ---\")\n",
    "            print(f\"Total nodes: {total_nodes}\")\n",
    "            print(f\"Total relationships: {total_rels}\")\n",
    "\n",
    "        except Exception as e:\n",
    "            print(f\"Failed to get graph statistics: {e}\")"
   ],
   "outputs": [],
   "execution_count": 8
  },
  {
   "cell_type": "markdown",
   "id": "c9f31d099aa6fa78",
   "metadata": {},
   "source": [
    "# 0. Load the data"
   ]
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "use_sample = False\n",
    "oced_pg = OcedPg(database_connection=db_connection,\n",
    "                 dataset_descriptions=dataset_descriptions,\n",
    "                 semantic_header=semantic_header,\n",
    "                 use_sample=use_sample)\n"
   ],
   "id": "ca6c0a4ea7b76768"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "# first, we load all records\n",
    "# (if use_sample = False, this should take less than 2 minutes)\n",
    "reset_pbar(total=11)\n",
    "oced_pg.load();"
   ],
   "id": "993f777308b09540"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "get_graph_statistics(db_connection)",
   "id": "a35f8979f0b1d5c1"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "bpic14_incident = \"BPIC14Incident.csv\"\n",
    "bpic14_interaction = \"BPIC14Interaction.csv\"\n",
    "bpic14_change = \"Detail_Change.csv\"\n",
    "bpic14_incident_activity = \"Detail_Incident_Activity.csv\""
   ],
   "id": "ebd2883990e3c6d4"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# 1. Split Entities into Objects and Events",
   "id": "6c78cab85865e480"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### Objects Nodes",
   "id": "ea802966a95c7036"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Create objects directly from the records available in the input files.<br>\n",
    "We take all entities in the domain model that refer to an object. Those are:\n",
    "\n",
    "- Incident\n",
    "- Interaction\n",
    "- Change\n",
    "- Knowledge Document\n",
    "- Resource\n",
    "- Configuration Item\n",
    "- Service Component"
   ],
   "id": "ec8ffd1c7c42e77f"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "For every entity, we define how it should be created, considering:\n",
    "- which log to read from.\n",
    "- which field to use as the unique sysId\n",
    "- which attributes to keep\n",
    "- any constant properties that should be added to the node"
   ],
   "id": "d0fd2b9864a3f9b"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "FZE: For Knowledge Documents, CIs and SCs the log is empty. Where do these entities come from? From the domain model directly? This should be briefly explained",
   "id": "e9eecf962c2cd07"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "objects = {\n",
    "    \"Incident\": [\n",
    "        {\n",
    "            \"log\": bpic14_incident,\n",
    "            \"sysId\": \"incidentId\",\n",
    "            \"attributes\": {\n",
    "                \"incidentId\": \"incidentId\",\n",
    "                \"status\": \"status\",\n",
    "                \"impact\": \"impact\",\n",
    "                \"priority\": \"priority\",\n",
    "                \"category\": \"category\",\n",
    "                \"handleTimeHours\": \"handleTimeHours\",\n",
    "                \"closureCode\": \"closureCode\",\n",
    "                \"alertStatus\": \"alertStatus\",\n",
    "                \"numReassignments\": \"numReassignments\",\n",
    "                \"numRelatedInteractions\": \"numRelatedInteractions\",\n",
    "                \"numRelatedIncidents\": \"numRelatedIncidents\",\n",
    "                \"numRelatedChanges\": \"numRelatedChanges\"\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            \"log\": bpic14_interaction,\n",
    "            \"sysId\": \"relatedIncident\",\n",
    "            \"attributes\": {\n",
    "                \"incidentId\": \"relatedIncident\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"derivedFromInteraction\": True\n",
    "            }\n",
    "        },\n",
    "\n",
    "        {\n",
    "            \"log\": bpic14_incident_activity,\n",
    "            \"sysId\": \"incidentId\",\n",
    "            \"attributes\": {\n",
    "                \"incidentId\": \"incidentId\"\n",
    "            }\n",
    "        }\n",
    "    ],\n",
    "    \"Interaction\": [\n",
    "        {\n",
    "            \"log\": bpic14_interaction,\n",
    "            \"sysId\": \"interactionId\",\n",
    "            \"attributes\": {\n",
    "                \"interactionId\": \"interactionId\",\n",
    "                \"status\": \"status\",\n",
    "                \"impact\": \"impact\",\n",
    "                \"priority\": \"priority\",\n",
    "                \"category\": \"category\",\n",
    "                \"handleTimeSecs\": \"handleTimeSecs\",\n",
    "                \"closureCode\": \"closureCode\",\n",
    "                \"firstCallResolution\": \"firstCallResolution\"\n",
    "            },\n",
    "        },\n",
    "        {\n",
    "            \"log\": bpic14_incident,\n",
    "            \"sysId\": \"relatedInteraction\",\n",
    "            \"attributes\": {\n",
    "                \"interactionId\": \"relatedInteraction\"\n",
    "            },\n",
    "        }\n",
    "    ],\n",
    "    \"Change\": [\n",
    "        {\n",
    "            \"log\": bpic14_change,\n",
    "            \"sysId\": \"changeId\",\n",
    "            \"attributes\": {\n",
    "                \"changeId\": \"changeId\",\n",
    "                \"type\": \"changeType\",\n",
    "                \"riskAssessment\": \"riskAssessment\",\n",
    "                \"cabApprovalNeeded\": \"cabApprovalNeeded\",\n",
    "                \"plannedStart\": \"plannedStart\",\n",
    "                \"plannedEnd\": \"plannedEnd\",\n",
    "                \"scheduledDowntimeStart\": \"scheduledDowntimeStart\",\n",
    "                \"scheduledDowntimeEnd\": \"scheduledDowntimeEnd\",\n",
    "                \"requestedEndDate\": \"requestedEndDate\",\n",
    "                \"originatedFrom\": \"originatedFrom\",\n",
    "                \"numRelatedInteractions\": \"numRelatedInteractions\",\n",
    "                \"numRelatedIncidents\": \"numRelatedIncidents\"\n",
    "            },\n",
    "        }, {\n",
    "            \"log\": bpic14_incident,\n",
    "            \"sysId\": \"relatedChange\",\n",
    "            \"attributes\": {\n",
    "                \"changeId\": \"relatedChange\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"derivedFromIncident\": True\n",
    "            }\n",
    "        }\n",
    "    ],\n",
    "    \"KnowledgeDocument\": [\n",
    "        {\n",
    "            \"log\": None,\n",
    "            \"sysId\": \"kmNumber\",\n",
    "            \"attributes\": {\"kmNumber\": \"kmNumber\"}\n",
    "        }\n",
    "    ],\n",
    "    \"Resource\": [\n",
    "        {\n",
    "            \"log\": bpic14_incident_activity,\n",
    "            \"sysId\": \"assignmentGroup\",\n",
    "            \"attributes\": {\"assignmentGroup\": \"assignmentGroup\"}\n",
    "        }\n",
    "    ],\n",
    "    \"ConfigurationItem\": [\n",
    "        {  # affected CIs\n",
    "            \"log\": None,\n",
    "            \"sysId\": \"ciNameAff\",\n",
    "            \"attributes\": {\n",
    "                \"ciName\": \"ciNameAff\",\n",
    "                \"ciType\": \"ciTypeAff\",\n",
    "                \"ciSubtype\": \"ciSubtypeAff\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"affected\": True\n",
    "            }\n",
    "        },\n",
    "        {  # caused by CIs\n",
    "            \"log\": bpic14_incident,\n",
    "            \"sysId\": \"ciNameCby\",\n",
    "            \"attributes\": {\n",
    "                \"ciName\": \"ciNameCby\",\n",
    "                \"ciType\": \"ciTypeCby\",\n",
    "                \"ciSubtype\": \"ciSubtypeCby\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"caused\": True\n",
    "            }\n",
    "\n",
    "        }\n",
    "\n",
    "    ],\n",
    "    \"ServiceComponent\": [\n",
    "        {  # affected SCs\n",
    "            \"log\": None,\n",
    "            \"sysId\": \"serviceComponentAff\",\n",
    "            \"attributes\": {\n",
    "                \"scName\": \"serviceComponentAff\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"affected\": True\n",
    "            }\n",
    "        },\n",
    "        {  # caused by SCs\n",
    "            \"log\": bpic14_incident,\n",
    "            \"sysId\": \"serviceComponentCBy\",\n",
    "            \"attributes\": {\n",
    "                \"scName\": \"serviceComponentCBy\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"caused\": True\n",
    "            }\n",
    "        },\n",
    "    ]\n",
    "}"
   ],
   "id": "3a13d5e02e08bc3f"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "Define functions to create the nodes in Neo4j using the previous configuration to extract the data from the specified logs.",
   "id": "cbb05fec90ce562b"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "def create_index(_db_connection, _label):\n",
    "    index_query_str = f\"\"\"\n",
    "        CREATE INDEX $index_name IF NOT EXISTS\n",
    "        FOR (n:$label)\n",
    "        ON (n.sysId)\n",
    "    \"\"\"\n",
    "\n",
    "    index_query = Query(query_str=index_query_str,\n",
    "                        parameters={\n",
    "                            \"index_name\": f\"{_label.lower()}_sysId_index\"\n",
    "                        },\n",
    "                        template_string_parameters={\n",
    "                            \"label\": _label\n",
    "                        })\n",
    "\n",
    "    _db_connection.exec_query(index_query)\n",
    "    print(f\"Index for :{_label}(sysId)\")\n",
    "\n",
    "\n",
    "def build_entity(_label, _config):\n",
    "    iterate_query = \"\"\"\n",
    "        :auto\n",
    "        MATCH (l:Log)-[:CONTAINS]->(r:Record)\n",
    "        WHERE r.$sysId_field IS NOT NULL $log_name_condition $time_field_condition\n",
    "        WITH r.$sysId_field $id_addition AS sysId, r\n",
    "        CALL (sysId, r) {\n",
    "             MERGE (n:$label {sysId: sysId})\n",
    "             MERGE (n)-[:EXTRACTED_FROM]->(r)\n",
    "             $attr_updates\n",
    "             $constants_updates\n",
    "        } IN TRANSACTIONS\n",
    "    \"\"\"\n",
    "    attr_updates = \"\"\n",
    "    time_field_condition = \"\"\n",
    "\n",
    "    if \"attributes\" in _config:\n",
    "        attr_updates += \"SET \"\n",
    "        attr_updates += \", \".join(\n",
    "            [f\"n.{key} = COALESCE(n.{key}, r.{attr})\" for key, attr in _config[\"attributes\"].items()])\n",
    "\n",
    "        if \"timestamp\" in _config[\"attributes\"]:\n",
    "            time_field_condition = f\"AND r.{_config['attributes']['timestamp']} IS NOT NULL\"\n",
    "\n",
    "    constants_updates = \"\"\n",
    "    if \"constants\" in _config:\n",
    "        constants_updates += \"SET \"\n",
    "        constants_updates += \", \".join(\n",
    "            [f\"n.{key} = COALESCE(n.{key}, {attr})\" for key, attr in _config[\"constants\"].items()])\n",
    "\n",
    "    query = Query(\n",
    "        query_str=iterate_query,\n",
    "        parameters={\n",
    "            \"log_name\": _config[\"log\"],\n",
    "        },\n",
    "        template_string_parameters={\n",
    "            \"label\": _label,\n",
    "            \"sysId_field\": _config[\"sysId\"],\n",
    "            \"log_name_condition\": \"AND l.name = $log_name\" if _config[\"log\"] else \"\",\n",
    "            \"time_field_condition\": time_field_condition,\n",
    "            \"attr_updates\": attr_updates,\n",
    "            \"constants_updates\": constants_updates,\n",
    "            \"id_addition\": f\"+ '{_config['id_addition']}'\" if 'id_addition' in _config else \"\"\n",
    "        }\n",
    "    )\n",
    "    db_connection.exec_query(query)\n",
    "    print(f\"→ {_label} nodes created.\")\n",
    "\n",
    "\n",
    "def build_entities(_db_connection, entities):\n",
    "    \"\"\"\n",
    "    Create entities. Includes indexing.\n",
    "    \"\"\"\n",
    "    print(\"\\n=== INDEXES ===\")\n",
    "    for _label in entities.keys():\n",
    "        try:\n",
    "            create_index(_db_connection=_db_connection,\n",
    "                         _label=_label)\n",
    "        except Exception as e:\n",
    "            print(f\"Failed to create index for {_label}: {e}\")\n",
    "\n",
    "    print(f\"\\n=== Building ENTITY NODES ===\")\n",
    "\n",
    "    for _label, _configs in entities.items():\n",
    "        for _config in _configs:\n",
    "            try:\n",
    "                build_entity(_label=_label,\n",
    "                             _config=_config)\n",
    "            except Exception as e:\n",
    "                print(f\"Failed for {_label}: {e}\")\n"
   ],
   "id": "4f25a9ff2e57a3f5"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "Create the object nodes in Neo4j.",
   "id": "b27524bb05769c1f"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "build_entities(db_connection, entities=objects)",
   "id": "c8846e2998419882"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "get_graph_statistics(db_connection)",
   "id": "ac54c25cad3c1523"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "FZE: Why do you also have four :Log nodes? When have these been created? I assume during data loading?",
   "id": "87a1101fea29bc6b"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "## Object-to-Object (O2O) Relationships\n",
    "\n",
    "Similarly to the objects, we define and specify the following Object-to-Object (O2O) relations:\n",
    "- (Incident|Interaction)-[:USED_KM]->(KnowledgeDocument)\n",
    "- (Incident)-[:RELATED_CHANGE]->(Change)\n",
    "- (Interaction)-[:RELATED_INCIDENT]->(Incident)\n",
    "- (Incident|Interaction|Change)-[:AFFECTED_CI_SC]->(CI_SC)\n",
    "- (Incident|Interaction|Change)<-[:CAUSED_BY_CI_SC]-(CI_SC)"
   ],
   "id": "421c8e43cb57ee0f"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "o2o_relationships = {\n",
    "    \"USED_KM\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"Incident|Interaction\"\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"KnowledgeDocument\",\n",
    "            \"foreign_key\": \"kmNumber\"\n",
    "        }\n",
    "    }],\n",
    "    \"RELATED_CHANGE\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"Incident\"\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"Change\",\n",
    "            \"foreign_key\": \"relatedChange\"\n",
    "        }\n",
    "    }],\n",
    "    \"RELATED_INCIDENT\": [\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"Interaction\"\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"Incident\",\n",
    "                \"foreign_key\": \"relatedIncident\"\n",
    "            }\n",
    "        },\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"Interaction\",\n",
    "                \"foreign_key\": \"relatedInteraction\"\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"Incident\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"primary\": True\n",
    "            }\n",
    "        }],\n",
    "    \"AFFECTED_CI\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"Incident\"\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"ConfigurationItem\",\n",
    "            \"foreign_key\": \"ciNameAff\",\n",
    "        },\n",
    "        \"log\": bpic14_incident\n",
    "    },\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"Interaction\"\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"ConfigurationItem\",\n",
    "                \"foreign_key\": \"ciNameAff\",\n",
    "            },\n",
    "            \"log\": bpic14_interaction\n",
    "        },\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"Change\"\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"ConfigurationItem\",\n",
    "                \"foreign_key\": \"ciNameAff\",\n",
    "            },\n",
    "            \"log\": bpic14_change\n",
    "        }],\n",
    "    \"AFFECTED_SC\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"Incident\"\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"ServiceComponent\",\n",
    "            \"foreign_key\": \"serviceComponentAff\",\n",
    "        },\n",
    "        \"log\": bpic14_incident\n",
    "    },\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"Interaction\"\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"ServiceComponent\",\n",
    "                \"foreign_key\": \"serviceComponentAff\",\n",
    "            },\n",
    "            \"log\": bpic14_interaction\n",
    "        },\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"Change\"\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"ServiceComponent\",\n",
    "                \"foreign_key\": \"serviceComponentAff\"\n",
    "            },\n",
    "            \"log\": bpic14_change\n",
    "        }],\n",
    "    \"CAUSED_BY_CI\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"Incident\"\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"ConfigurationItem\",\n",
    "            \"foreign_key\": \"ciNameCby\"\n",
    "        },\n",
    "    }],\n",
    "    \"CAUSED_BY_SC\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"Incident\"\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"ServiceComponent\",\n",
    "            \"foreign_key\": \"serviceComponentCBy\"\n",
    "        },\n",
    "    }],\n",
    "    \"CONTAINS\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"ServiceComponent\",\n",
    "            \"foreign_key\": \"serviceComponentAff\"\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"ConfigurationItem\",\n",
    "            \"foreign_key\": \"ciNameAff\"\n",
    "        },\n",
    "    }, {\n",
    "        \"from_object\": {\n",
    "            \"label\": \"ServiceComponent\",\n",
    "            \"foreign_key\": \"serviceComponentCBy\"\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"ConfigurationItem\",\n",
    "            \"foreign_key\": \"ciNameCby\"\n",
    "        },\n",
    "    }]\n",
    "}"
   ],
   "id": "300bb440aac7df3c"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "def build_foreign_key_index(_db_connection, _config):\n",
    "    foreign_key_query_str = '''\n",
    "                            CREATE INDEX $index_name IF NOT EXISTS\n",
    "                                FOR (n:Record) ON (n.$foreign_key) \\\n",
    "                            '''\n",
    "\n",
    "    for _type in [\"from_object\", \"to_object\"]:\n",
    "        if \"foreign_key\" in _config[_type]:\n",
    "            foreign_key = _config[_type][\"foreign_key\"]\n",
    "\n",
    "            foreign_key_index_query = Query(\n",
    "                query_str=foreign_key_query_str,\n",
    "                parameters={\n",
    "                    \"index_name\": f\"record_{foreign_key}_index\"\n",
    "                },\n",
    "                template_string_parameters={\n",
    "                    \"foreign_key\": foreign_key\n",
    "                }\n",
    "            )\n",
    "\n",
    "            _db_connection.exec_query(foreign_key_index_query)\n",
    "            print(f\"Index ensured for :Record({foreign_key})\")\n",
    "\n",
    "\n",
    "def build_relationship(_db_connection, _type, _config):\n",
    "    o2o_query_str = '''\n",
    "        :auto\n",
    "         MATCH (from:$from_object) - [:EXTRACTED_FROM] -> (r:Record) <- [:EXTRACTED_FROM] - (to:$to_object)\n",
    "         $log_condition\n",
    "         WHERE $condition\n",
    "         CALL (from, to, r) {\n",
    "            MERGE (from) - [rel:$type] -> (to)\n",
    "            $attr_updates\n",
    "            $constants_updates\n",
    "        } IN TRANSACTIONS\n",
    "    '''\n",
    "\n",
    "    attr_updates = \"\"\n",
    "    if \"attributes\" in _config:\n",
    "        attr_updates = \"SET \"\n",
    "        attr_updates += \", \".join(\n",
    "            [f\"rel.{key} = COALESCE(rel.{key}, r.{attr})\" for key, attr in _config[\"attributes\"].items()])\n",
    "    constants_updates = \"\"\n",
    "    if \"constants\" in _config:\n",
    "        constants_updates += \"SET \"\n",
    "        constants_updates += \", \".join(\n",
    "            [f\"rel.{key} = COALESCE(rel.{key}, {attr})\" for key, attr in _config[\"constants\"].items()])\n",
    "\n",
    "    from_object = _config[\"from_object\"]\n",
    "    to_object = _config[\"to_object\"]\n",
    "\n",
    "    from_foreign_key = \"\"\n",
    "    to_foreign_key = \"\"\n",
    "    log = \"\"\n",
    "    conditions = []\n",
    "    log_condition = \"\"\n",
    "\n",
    "    if \"foreign_key\" in from_object:\n",
    "        from_foreign_key = from_object[\"foreign_key\"]\n",
    "        conditions.append(\"r[$from_foreign_key] IS NOT NULL AND from.sysId = r[$from_foreign_key]\")\n",
    "    if \"foreign_key\" in to_object:\n",
    "        to_foreign_key = to_object[\"foreign_key\"]\n",
    "        conditions.append(\"r[$to_foreign_key] IS NOT NULL AND to.sysId = r[$to_foreign_key]\")\n",
    "    if \"log\" in _config:\n",
    "        log = _config[\"log\"]\n",
    "        log_condition = \"MATCH (r) <- [:CONTAINS] - (:Log {name: $log_name})\"\n",
    "\n",
    "    o2o_query = Query(\n",
    "        query_str=o2o_query_str,\n",
    "        parameters={\n",
    "            \"from_foreign_key\": from_foreign_key,\n",
    "            \"to_foreign_key\": to_foreign_key,\n",
    "            \"log_name\": log\n",
    "        },\n",
    "\n",
    "        template_string_parameters={\n",
    "            \"condition\": \" AND \".join(conditions),\n",
    "            \"from_object\": from_object[\"label\"],\n",
    "            \"to_object\": to_object[\"label\"],\n",
    "            \"type\": _type,\n",
    "            \"attr_updates\": attr_updates,\n",
    "            \"constants_updates\": constants_updates,\n",
    "            \"log_condition\": log_condition\n",
    "        }\n",
    "    )\n",
    "\n",
    "    db_connection.exec_query(o2o_query)\n",
    "    print(f\"→ (:{_config['from_object']}) - [:{_type}] -> (:{_config['to_object']}) Relationship built\")\n",
    "\n",
    "\n",
    "def build_relationships(_db_connection, _relationships):\n",
    "    print(\"\\n=== INDEXES ===\")\n",
    "    for _type, _configs in _relationships.items():\n",
    "        for _config in _configs:\n",
    "            build_foreign_key_index(_db_connection=_db_connection,\n",
    "                                    _config=_config)\n",
    "\n",
    "    print(\"\\n=== O2O RELATIONSHIPS ===\")\n",
    "    for _type, _configs in _relationships.items():\n",
    "        for _config in _configs:\n",
    "            build_relationship(_db_connection=_db_connection,\n",
    "                               _type=_type,\n",
    "                               _config=_config)"
   ],
   "id": "5e4cb5f97e46f81"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "build_relationships(_db_connection=db_connection,\n",
    "                    _relationships=o2o_relationships)"
   ],
   "id": "a07d12136cebdf8"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "get_graph_statistics(db_connection)",
   "id": "bac8d09b040a5780"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "## Event Nodes\n",
    "\n",
    "There are four types of events Incident Events, Incident Activity Events, Change Events and Interaction Events."
   ],
   "id": "53cd65433789a5a8"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "FZE: WHY??? How do you infer this from the raw data? ",
   "id": "c0ad786ccd0ee696"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "EVENTS = {\n",
    "    \"IncidentEvent\": [\n",
    "        {\n",
    "            \"log\": bpic14_incident,\n",
    "            \"sysId\": \"incidentId\",\n",
    "            \"id_addition\": \"_Open\",\n",
    "            \"attributes\": {\n",
    "                \"timestamp\": \"openTime\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"activity\": \"'Open'\"\n",
    "            }\n",
    "        }, {\n",
    "            \"log\": bpic14_incident,\n",
    "            \"sysId\": \"incidentId\",\n",
    "            \"id_addition\": \"_Resolve\",\n",
    "            \"attributes\": {\n",
    "                \"timestamp\": \"resolvedTime\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"activity\": \"'Resolve'\"\n",
    "            }\n",
    "        }, {\n",
    "            \"log\": bpic14_incident,\n",
    "            \"sysId\": \"incidentId\",\n",
    "            \"id_addition\": \"_Close\",\n",
    "            \"attributes\": {\n",
    "                \"timestamp\": \"closeTime\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"activity\": \"'Close'\"\n",
    "            }\n",
    "        }\n",
    "    ],\n",
    "    \"ChangeEvent\": [\n",
    "        {\n",
    "            \"log\": bpic14_change,\n",
    "            \"sysId\": \"changeId\",\n",
    "            \"id_addition\": \"_Start\",\n",
    "            \"attributes\": {\n",
    "                \"timestamp\": \"actualStart\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"activity\": \"'Start'\"\n",
    "            }\n",
    "        }, {\n",
    "            \"log\": bpic14_change,\n",
    "            \"sysId\": \"changeId\",\n",
    "            \"id_addition\": \"_End\",\n",
    "            \"attributes\": {\n",
    "                \"timestamp\": \"actualEnd\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"activity\": \"'End'\"\n",
    "            }\n",
    "        }\n",
    "    ],\n",
    "    \"InteractionEvent\": [\n",
    "        {\n",
    "            \"log\": bpic14_interaction,\n",
    "            \"sysId\": \"interactionId\",\n",
    "            \"id_addition\": \"_Open\",\n",
    "            \"attributes\": {\n",
    "                \"timestamp\": \"openTime\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"activity\": \"'Open'\"\n",
    "            }\n",
    "        }, {\n",
    "            \"log\": bpic14_interaction,\n",
    "            \"sysId\": \"interactionId\",\n",
    "            \"id_addition\": \"_Close\",\n",
    "            \"attributes\": {\n",
    "                \"timestamp\": \"closeTime\"\n",
    "            },\n",
    "            \"constants\": {\n",
    "                \"activity\": \"'Close'\"\n",
    "            }\n",
    "        }],\n",
    "    \"IncidentActivityEvent\": [\n",
    "        {\n",
    "            \"log\": bpic14_incident_activity,\n",
    "            \"sysId\": \"activityNumber\",\n",
    "            \"attributes\": {\n",
    "                \"activity\": \"incidentActivityType\",\n",
    "                \"timestamp\": \"dateStamp\"\n",
    "            }\n",
    "        }\n",
    "    ],\n",
    "}\n"
   ],
   "id": "a0934c3165c05848"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "build_entities(db_connection, entities=EVENTS)",
   "id": "a4d09b21360900fb"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "get_graph_statistics(db_connection)",
   "id": "47c2db13d8170cc9"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "## Event-to-Object (E2O) Relationships",
   "id": "3f03db7b309faedc"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "FZE: add here what these relationships are and how they are built",
   "id": "5f91b903db45c220"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "e2o_relationships = {\n",
    "    \"CORR\": [\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"IncidentEvent\"\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"Incident\",\n",
    "                \"foreign_key\": \"incidentId\"\n",
    "            }\n",
    "        },\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"ChangeEvent\"\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"Change\",\n",
    "                \"foreign_key\": \"changeId\"\n",
    "            }\n",
    "        },\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"InteractionEvent\"\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"Interaction\",\n",
    "                \"foreign_key\": \"interactionId\"\n",
    "            }\n",
    "        },\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"IncidentActivityEvent\"\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"Incident\",\n",
    "                \"foreign_key\": \"incidentId\"\n",
    "            }\n",
    "        }\n",
    "    ],\n",
    "    \"EXECUTED_BY\": [\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"IncidentActivityEvent\"\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"Resource\",\n",
    "                \"foreign_key\": \"assignmentGroup\"\n",
    "            }\n",
    "        }\n",
    "    ]\n",
    "\n",
    "}"
   ],
   "id": "345f305ae2522e0b"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "build_relationships(db_connection, _relationships=e2o_relationships)",
   "id": "5bf42f11363b1f44"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "get_graph_statistics(db_connection)",
   "id": "e6036d8864811023"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# 2. Assign Types",
   "id": "7b37102f29848160"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "This function creates an ObjectType node (e.g., \"Incident\", \"Interaction\") and then links every node of that label in the graph to this type node with an IS_OF_TYPE relationship.",
   "id": "50771279342c442b"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "def add_object_type_node(object_type):\n",
    "    query_create_ot = '''\n",
    "        MERGE (ot:ObjectType {objectType: $objectType})\n",
    "    '''\n",
    "\n",
    "    db_connection.exec_query(\n",
    "        Query(query_str=query_create_ot,\n",
    "              parameters={'objectType': object_type}\n",
    "              )\n",
    "    )\n",
    "\n",
    "    query_str = '''\n",
    "        :auto\n",
    "        MATCH (ot:ObjectType {objectType: $objectType })\n",
    "        MATCH (o:$label)\n",
    "        CALL (o, ot) {\n",
    "            MERGE (o) - [:IS_OF_TYPE] -> (ot)\n",
    "            } IN TRANSACTIONS\n",
    "    '''\n",
    "\n",
    "    query = Query(\n",
    "        query_str=query_str,\n",
    "        parameters={'objectType': object_type},\n",
    "        template_string_parameters={\"label\": object_type}\n",
    "    )\n",
    "\n",
    "    db_connection.exec_query(query)\n",
    "    print(f'-> (:ObjectType {{objectType: \"{object_type}\"}}) created.')"
   ],
   "id": "49d19abfd3fdf1fc"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "for label in objects.keys():\n",
    "    add_object_type_node(object_type=label)"
   ],
   "id": "2d6d763be022e65d"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "This function creates an EventType node (e.g., \"IncidentEvent\", \"InteractionEvent\") and then links every node of that label in the graph to this type node with an IS_OF_TYPE relationship.",
   "id": "d9fbca3346f03bdf"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "def add_event_type_node(_db_connection, event_type):\n",
    "    create_index(_db_connection, 'Event')\n",
    "\n",
    "    query_create_et = '''\n",
    "        MERGE (et:EventType {eventType: $eventType})\n",
    "    '''\n",
    "\n",
    "    _db_connection.exec_query(\n",
    "        Query(query_str=query_create_et,\n",
    "              parameters={'eventType': event_type}\n",
    "              )\n",
    "    )\n",
    "\n",
    "    query_str = '''\n",
    "        :auto\n",
    "        MATCH (et:EventType {eventType: $eventType })\n",
    "        MATCH (e:$label)\n",
    "        CALL (e, et) {\n",
    "            MERGE (e) - [:IS_OF_TYPE] -> (et)\n",
    "            REMOVE e:$label\n",
    "            SET e:Event\n",
    "        }\n",
    "        IN TRANSACTIONS\n",
    "    '''\n",
    "\n",
    "    query = Query(\n",
    "        query_str=query_str,\n",
    "        parameters={'eventType': event_type},\n",
    "        template_string_parameters={\"label\": event_type}\n",
    "    )\n",
    "\n",
    "    _db_connection.exec_query(query)\n",
    "    print(f'-> (:EventType {{eventType: \"{event_type}\"}}) created.')"
   ],
   "id": "ee96605484ae36cb"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "for label in EVENTS.keys():\n",
    "    add_event_type_node(_db_connection=db_connection, event_type=label)"
   ],
   "id": "b784618add0aabf2"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# 3. Enrichment",
   "id": "18e7e14315359a60"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "FZE: I thought this was model completion. Or have you decided based on the last meeting to keep only Enrichment and distinguish two types of enrichment?",
   "id": "d2368866bc03a1e5"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "## 3.1 Materialize CI_SC Objects",
   "id": "fece90a0a0102671"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "FZE: Why? Does this depend on our analysis question? Or is this something that is done based on domain knowledge, independently from the analysis? You need some narrative here...",
   "id": "6fb5ef82615c8d5d"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "def materialize_object(_db_connection, _label, _config):\n",
    "    from_object = _config[\"from_object\"]\n",
    "    to_object = _config[\"to_object\"]\n",
    "    set_attributes = []\n",
    "\n",
    "    for _object in [from_object, to_object]:\n",
    "        if \"attributes\" in _object:\n",
    "            set_attributes.extend(\n",
    "                [f\"new.{key} = COALESCE(new.{key}, from.{attr})\" for key, attr in _object[\"attributes\"].items()])\n",
    "\n",
    "    materialize_relationship_query = '''\n",
    "        :auto\n",
    "        MATCH (from) - [ :IS_OF_TYPE] -> (:ObjectType {objectType: $from_object})\n",
    "        MATCH (to) - [ :IS_OF_TYPE] -> (:ObjectType {objectType: $to_object})\n",
    "        MATCH (from) - [r WHERE type(r) = $relation_type] -> (to)\n",
    "        CALL (from, r, to) {\n",
    "            MERGE (new:$materialized_object {sysId: from.sysId + '_' + to.sysId})\n",
    "            MERGE (from) <- [:RELATED] - (new) - [:RELATED] -> (to)\n",
    "            SET new[$from_object] = from.sysId,\n",
    "                new[$to_object] = to.sysId\n",
    "            $set_attributes\n",
    "        } IN TRANSACTIONS\n",
    "    '''\n",
    "\n",
    "    materialize_query = Query(\n",
    "        query_str=materialize_relationship_query,\n",
    "        parameters={\n",
    "            \"from_object\": from_object[\"label\"],\n",
    "            \"to_object\": to_object[\"label\"],\n",
    "            \"relation_type\": _config[\"relation_type\"]\n",
    "        },\n",
    "        template_string_parameters={\n",
    "            \"materialized_object\": _label,\n",
    "            \"set_attributes\": \"SET \" + \", \".join(set_attributes)\n",
    "        }\n",
    "    )\n",
    "\n",
    "    _db_connection.exec_query(materialize_query)\n",
    "    print(f\"→ {_label} nodes created.\")\n"
   ],
   "id": "5776865c3c57290e"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "def materialize_objects(_db_connection, _objects):\n",
    "    \"\"\"\n",
    "    Create entities. Includes indexing.\n",
    "    \"\"\"\n",
    "    print(\"\\n=== INDEXES ===\")\n",
    "    for _label in objects_to_materialize.keys():\n",
    "        try:\n",
    "            create_index(_db_connection=_db_connection,\n",
    "                         _label=_label)\n",
    "        except Exception as e:\n",
    "            print(f\"Failed to create index for {_label}: {e}\")\n",
    "\n",
    "    print(\"\\n=== Materializing Relationships ===\")\n",
    "    for _label, _configs in _objects.items():\n",
    "        for _config in _configs:\n",
    "            try:\n",
    "                materialize_object(\n",
    "                    _db_connection=_db_connection,\n",
    "                    _label=_label,\n",
    "                    _config=_config)\n",
    "            except Exception as e:\n",
    "                print(f\"Failed for {_label}: {e}\")"
   ],
   "id": "8b71e1692c291c9"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "objects_to_materialize = {\n",
    "    \"CI_SC\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"ServiceComponent\",\n",
    "            \"attributes\": {\n",
    "                \"ciType\": \"ciType\",\n",
    "                \"ciSubtype\": \"ciSubtype\"\n",
    "            }\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"ConfigurationItem\"\n",
    "        },\n",
    "        \"relation_type\": \"CONTAINS\"\n",
    "    }]\n",
    "}"
   ],
   "id": "db961e758d6302b2"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "materialize_objects(_db_connection=db_connection,\n",
    "                    _objects=objects_to_materialize)"
   ],
   "id": "663ffbd6ae96951b"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "for _object in objects_to_materialize.keys():\n",
    "    add_object_type_node(_object)"
   ],
   "id": "349bb21d47d0b521"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "## 3.2 Extend Relationships to Materialized CI_SC Objects",
   "id": "5c13c6966243fcb9"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "relationships_to_extend = {\n",
    "    \"AFFECTED_CI_SC\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"Incident|Interaction|Change\",\n",
    "            \"relationships\": [\n",
    "                {\n",
    "                    \"related_label\": \"ServiceComponent\",\n",
    "                    \"related_object\": \"sc\",\n",
    "                    \"relation_type\": \"AFFECTED_SC\"\n",
    "                },\n",
    "                {\n",
    "                    \"related_label\": \"ConfigurationItem\",\n",
    "                    \"related_object\": \"ci\",\n",
    "                    \"relation_type\": \"AFFECTED_CI\"\n",
    "                }]\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"CI_SC\",\n",
    "            \"relationships\": [\n",
    "                {\n",
    "                    \"related_label\": \"ServiceComponent\",\n",
    "                    \"related_object\": \"sc\",\n",
    "                    \"relation_type\": \"RELATED\"\n",
    "                },\n",
    "                {\n",
    "                    \"related_label\": \"ConfigurationItem\",\n",
    "                    \"related_object\": \"ci\",\n",
    "                    \"relation_type\": \"RELATED\"\n",
    "                }]\n",
    "        }\n",
    "    }],\n",
    "    \"CAUSED_BY_CI_SC\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"Incident\",\n",
    "            \"relationships\": [\n",
    "                {\n",
    "                    \"related_label\": \"ServiceComponent\",\n",
    "                    \"related_object\": \"sc\",\n",
    "                    \"relation_type\": \"CAUSED_BY_SC\"\n",
    "                },\n",
    "                {\n",
    "                    \"related_label\": \"ConfigurationItem\",\n",
    "                    \"related_object\": \"ci\",\n",
    "                    \"relation_type\": \"CAUSED_BY_CI\"\n",
    "                }]\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"CI_SC\",\n",
    "            \"relationships\": [\n",
    "                {\n",
    "                    \"related_label\": \"ServiceComponent\",\n",
    "                    \"related_object\": \"sc\",\n",
    "                    \"relation_type\": \"RELATED\"\n",
    "                },\n",
    "                {\n",
    "                    \"related_label\": \"ConfigurationItem\",\n",
    "                    \"related_object\": \"ci\",\n",
    "                    \"relation_type\": \"RELATED\"\n",
    "                }]\n",
    "        }\n",
    "    }],\n",
    "    \"CORR\": [\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"Event\",\n",
    "                \"relationships\": [\n",
    "                    {\n",
    "                        \"related_label\": \"Change\",\n",
    "                        \"related_object\": \"change\",\n",
    "                        \"relation_type\": \"CORR\"\n",
    "                    }]\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"CI_SC\",\n",
    "                \"relationships\": [\n",
    "                    {\n",
    "                        \"related_label\": \"Change\",\n",
    "                        \"related_object\": \"change\",\n",
    "                        \"relation_type\": \"AFFECTED_CI_SC\"\n",
    "                    }]\n",
    "            }\n",
    "        },\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"Event\",\n",
    "                \"relationships\": [\n",
    "                    {\n",
    "                        \"related_label\": \"Incident\",\n",
    "                        \"related_object\": \"incident\",\n",
    "                        \"relation_type\": \"CORR\"\n",
    "                    }]\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"CI_SC\",\n",
    "                \"relationships\": [\n",
    "                    {\n",
    "                        \"related_label\": \"Incident\",\n",
    "                        \"related_object\": \"incident\",\n",
    "                        \"relation_type\": \"AFFECTED_CI_SC\"\n",
    "                    }]\n",
    "            }\n",
    "        },\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"Event\",\n",
    "                \"relationships\": [\n",
    "                    {\n",
    "                        \"related_label\": \"Interaction\",\n",
    "                        \"related_object\": \"interaction\",\n",
    "                        \"relation_type\": \"CORR\"\n",
    "                    }]\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"CI_SC\",\n",
    "                \"relationships\": [\n",
    "                    {\n",
    "                        \"related_label\": \"Interaction\",\n",
    "                        \"related_object\": \"interaction\",\n",
    "                        \"relation_type\": \"AFFECTED_CI_SC\"\n",
    "                    }]\n",
    "            }\n",
    "        }\n",
    "    ],\n",
    "}"
   ],
   "id": "1f42d51743f62052"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "def extend_relationship(_db_connection, _type, _config):\n",
    "    from_object = _config[\"from_object\"]\n",
    "    to_object = _config[\"to_object\"]\n",
    "\n",
    "    query_str = '''\n",
    "        :auto\n",
    "        MATCH (from:$from_object)\n",
    "        MATCH (to:$to_object)\n",
    "        $relation_conditions\n",
    "        WITH distinct from, to\n",
    "        CALL (from, to) {\n",
    "            MERGE (from) - [r:$type] -> (to)\n",
    "            RETURN r\n",
    "        } IN TRANSACTIONS\n",
    "        RETURN count(r) as count\n",
    "    '''\n",
    "\n",
    "    relation_conditions = []\n",
    "    for _object_type, _object in {\"from\": from_object, \"to\": to_object}.items():\n",
    "        if \"relationships\" in _object:\n",
    "            for relationship in _object['relationships']:\n",
    "                rel_type = relationship[\"relation_type\"]\n",
    "                related_object = relationship[\"related_object\"]\n",
    "                related_label = relationship[\"related_label\"]\n",
    "                relation_conditions.append(\n",
    "                    f\"MATCH ({_object_type}) - [:{rel_type}] - ({related_object}:{related_label})\")\n",
    "\n",
    "    query = Query(\n",
    "        query_str=query_str,\n",
    "        template_string_parameters={\n",
    "            \"from_object\": from_object[\"label\"],\n",
    "            \"to_object\": to_object[\"label\"],\n",
    "            \"type\": _type,\n",
    "            \"relation_conditions\": \"\\n\".join(relation_conditions)\n",
    "        }\n",
    "    )\n",
    "\n",
    "    res = _db_connection.exec_query(query)\n",
    "    print(f'→ {res[0][\"count\"]} (:{from_object[\"label\"]}) - [:{_type}] -> (:{to_object[\"label\"]}) Relationship built')\n",
    "\n",
    "\n",
    "def extend_relationships(_db_connection, _relationships):\n",
    "    for _type, _configs in _relationships.items():\n",
    "        for _config in _configs:\n",
    "            try:\n",
    "                extend_relationship(_db_connection, _type, _config)\n",
    "            except Exception as e:\n",
    "                print(f\"Failed for {_type}: {e}\")\n"
   ],
   "id": "f91948d32befaf35"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "extend_relationships(db_connection, relationships_to_extend)",
   "id": "1d9036cb2e4035df"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "## 3.3 Check Incomplete Traces at Start And End of Period",
   "id": "aafcfd0905eacb81"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "FZE: This is not enrichment... Is \"simple\" filtering, data cleaning, right? Which I think you do because of a specific analysis question you have in mind. I wonder if you could get rid of these traces before you materialize the objects. <br>\n",
    "\n",
    "FZE: Important: What is a _TRACE_ in this context? In OCPM I am not sure if this is clear... I guess you refer to all events connected to one specific object, where you consider only INCIDENT, INTERACTION and CHANGE as object types?"
   ],
   "id": "23334d0cd3acd101"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "TODO: Add Analysis",
   "id": "a80e48d5d30c793a"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "#### Filter out all events of objects that have at least one event before cutoff\n",
    "Cutoff = 2013-08-19T09:59:53.000000000+01:00"
   ],
   "id": "9b98a6f3f3ffcf97"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "FZE: Why this cutoff??? Have you looked at the timeframe of the log and made this decision? If so, it needs to be narrated/ shown.",
   "id": "c2f3f9fcaaac3aae"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "results = []\n",
    "labels = ['Incident', 'Interaction', 'Change']\n",
    "\n",
    "count_query = '''\n",
    "    MATCH (ot:ObjectType) <- [:IS_OF_TYPE] - (o) - [] - (e) - [:IS_OF_TYPE] -> (et:EventType)\n",
    "    WHERE ot.objectType in ['Incident', 'Interaction', 'Change']\n",
    "    WITH e, ot, o, e.timestamp < dateTime(\"2013-08-19T09:59:53.000000000+01:00\") as before_cutoff\n",
    "    WITH ot, o, collect(distinct before_cutoff) as before_cutoffs\n",
    "    WHERE True in before_cutoffs\n",
    "    MATCH (o) - [] - (all_e) - [:IS_OF_TYPE] -> (et:EventType)\n",
    "    RETURN ot.objectType as _label, count(distinct o) as object_deleted, count(distinct all_e) as events_deleted\n",
    "'''\n",
    "query = Query(\n",
    "    query_str=count_query,\n",
    "    parameters={'labels': labels}\n",
    ")\n",
    "result = pd.DataFrame(db_connection.exec_query(query))\n",
    "results.append(result)\n",
    "\n",
    "delete_query_str = '''\n",
    "    MATCH (ot:ObjectType) <- [:IS_OF_TYPE] - (o) - [] - (e) - [:IS_OF_TYPE] -> (et:EventType)\n",
    "    WHERE ot.objectType in $labels\n",
    "    WITH e, o, e.timestamp < dateTime(\"2013-08-19T09:59:53.000000000+01:00\") as before_cutoff\n",
    "    WITH o, collect(distinct before_cutoff) as before_cutoffs\n",
    "    WHERE True in before_cutoffs\n",
    "    MATCH (o) - [] - (all_e) - [:IS_OF_TYPE] -> (et:EventType)\n",
    "    DETACH DELETE o\n",
    "    DETACH DELETE all_e\n",
    "'''\n",
    "\n",
    "delete_query = Query(\n",
    "    query_str=delete_query_str,\n",
    "    parameters={'labels': labels}\n",
    ")\n",
    "db_connection.exec_query(delete_query)\n",
    "\n",
    "df_result = pd.concat(results)\n",
    "df_result"
   ],
   "id": "7b57f4a447c8910e"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "\n",
    "query = '''\n",
    "    MATCH (ot:ObjectType) <- [:IS_OF_TYPE] - (o) - []  - (e) - [:IS_OF_TYPE] -> (et:EventType)\n",
    "    WHERE ot.objectType in $labels\n",
    "    RETURN ot.objectType as _label, count(distinct o) as objects_kept, count(distinct e) as events_kept\n",
    "'''\n",
    "query = Query(\n",
    "    query_str=query,\n",
    "    parameters={'labels': labels}\n",
    ")\n",
    "df_result_kept = pd.DataFrame(db_connection.exec_query(query))\n",
    "print(df_result_kept)"
   ],
   "id": "1f2f27ee24078af9"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "df_both = df_result.set_index('_label').join(df_result_kept.set_index('_label'))\n",
    "df_both['total_objects'] = df_both['objects_kept'] + df_both['object_deleted']\n",
    "df_both['total_events'] = df_both['events_kept'] + df_both['events_deleted']\n",
    "df_both['% events deleted'] = round(df_both['events_deleted'] / df_both['total_events'] * 100, 2)\n",
    "df_both['% objects deleted'] = round(df_both['object_deleted'] / df_both['total_objects'] * 100, 2)\n",
    "df_both = df_both[\n",
    "    ['object_deleted', 'objects_kept', 'total_objects', '% objects deleted', 'events_deleted', 'events_kept',\n",
    "     'total_events', '% events deleted']]\n",
    "print(df_both)"
   ],
   "id": "d06b485e9292c5c"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "#### Delete non-referred CI_SC",
   "id": "462c27f4eda3c878"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "We delete all CI_SC that are not involved in any Interaction, Incident nor Change. ",
   "id": "b956a6ee41c5f754"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "delete_non_referred_objects = '''\n",
    "MATCH (object) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "OPTIONAL MATCH (object) -- (other_o) - [:IS_OF_TYPE] -> (other_ot:ObjectType)\n",
    "WITH object, collect(distinct other_ot.objectType) as other_ots\n",
    "WITH object, [other_ot in other_ots WHERE other_ot in $requiredObjectTypes] as allowed_types\n",
    "WHERE size(allowed_types) = 0 // none of the required types were found, so we get to delete this object\n",
    "DETACH DELETE object\n",
    "RETURN count(object) as cnt'''\n",
    "\n",
    "delete_non_referred_objects_query = Query(\n",
    "    query_str=delete_non_referred_objects,\n",
    "    parameters={'objectType': 'CI_SC',\n",
    "                'requiredObjectTypes': ['Incident', 'Interaction', 'Change']}\n",
    ")\n",
    "\n",
    "pd.DataFrame(db_connection.exec_query(delete_non_referred_objects_query))"
   ],
   "id": "7f6583d9858386a7"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "## 3.2 Infer and Materialize DF edges",
   "id": "7074df2d385f28f9"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Each DF has attributes:\n",
    "- objectType\n",
    "- object identifier (sysid) (which object it belongs incidentId, interactionsId, changeId, etc.)"
   ],
   "id": "c3d2a239808fc6a0"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "def create_event_timestamp_index(_db_connection, _label):\n",
    "    index_query_str = f\"\"\"\n",
    "        CREATE INDEX $index_name IF NOT EXISTS\n",
    "        FOR (n:$label)\n",
    "        ON (n.timestamp)\n",
    "    \"\"\"\n",
    "\n",
    "    index_query = Query(query_str=index_query_str,\n",
    "                        parameters={\n",
    "                            \"index_name\": f\"{_label.lower()}_timestamp_index\"\n",
    "                        },\n",
    "                        template_string_parameters={\n",
    "                            \"label\": _label\n",
    "                        })\n",
    "\n",
    "    _db_connection.exec_query(index_query)\n",
    "    print(f\"Index for :{_label}(timestamp)\")\n"
   ],
   "id": "6a17b2763c800bc0"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "for event_labels in EVENTS.keys():\n",
    "    create_event_timestamp_index(db_connection, event_labels)"
   ],
   "id": "a71fc63ab730f6c8"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "object_types_for_df = ['Interaction', 'Incident', 'Change', 'CI_SC']",
   "id": "d890b05461d2ea19"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "def build_df_edges_for_object_type(_db_connection, _object_type):\n",
    "    \"\"\"\n",
    "    Build :DF:* edges for all events related to objects of type :_object_type.\n",
    "    Creates separate DF edges for each object type and incident event type.\n",
    "    \"\"\"\n",
    "\n",
    "    discover_df_query_str = '''\n",
    "        :auto\n",
    "        MATCH (o) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "        WITH o, ot.objectType as oType\n",
    "        MATCH (e:Event) -- (o)\n",
    "        WITH o, oType, e ORDER BY e.timestamp, elementId(e)\n",
    "        WITH o.sysId as sysId, oType, collect(e) as events\n",
    "        UNWIND range(0, size(events) - 2) AS index\n",
    "        WITH events[index] as fromEvent, events[index+1] as toEvent, sysId, oType\n",
    "        CALL (fromEvent, toEvent, sysId, oType) {\n",
    "            MERGE (fromEvent) -[rel:DF {objectType:oType, id:sysId}]->(toEvent)\n",
    "            RETURN count(rel) as count\n",
    "        } IN TRANSACTIONS\n",
    "        RETURN sum(count) as count\n",
    "       '''\n",
    "\n",
    "    discover_df = Query(query_str=discover_df_query_str,\n",
    "                        parameters={'objectType': _object_type})\n",
    "\n",
    "    res = _db_connection.exec_query(discover_df)\n",
    "    print(f\"-> {_object_type} DF creation result: {res[0]['count']}\")\n",
    "\n",
    "\n",
    "def build_df_edges(_db_connection, _object_types):\n",
    "    for _object_type in _object_types:\n",
    "        try:\n",
    "            build_df_edges_for_object_type(_db_connection, _object_type)\n",
    "        except Exception as e:\n",
    "            print(f\"Failed to build DFs for {_object_type}: {e}\")\n"
   ],
   "id": "7834e7882e887b6b"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "build_df_edges(_db_connection=db_connection,\n",
    "               _object_types=object_types_for_df)"
   ],
   "id": "b036423b96028c21"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "## Understand the main flow: Explore Directly-Follows Relations\n",
    "\n",
    "To better understand the process, we can query the DF paths in Neo4j bloom with the following query\n",
    "```\n",
    "    MATCH (o) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "    MATCH (start:Event) -- (o)\n",
    "    MATCH (end:Event) -- (o)\n",
    "    WHERE NOT EXISTS (() - [:DF {id: o.sysId}] -> (start))\n",
    "    AND NOT EXISTS ((end) - [:DF {id: o.sysId}] -> ())\n",
    "    MATCH p = (start) - [:DF* {id: o.sysId}] -> (end)\n",
    "    RETURN p limit 10\n",
    "```"
   ],
   "id": "a05b178d24b19c86"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "FZE: Why these four objects now? ",
   "id": "65cf3c4b6249fa1d"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "DF-Paths for Change\n",
    "<div>\n",
    "<img src=\"attachment:b8077b43-5bd1-46f7-b73b-cf6b655eef81.png\" width=\"500\"/>\n",
    "</div>\n",
    "\n",
    "DF-Paths for Interaction\n",
    "<div>\n",
    "<img src=\"attachment:3ce36d38-be96-4c5d-8eec-6d9af2cc786b.png\" width=\"500\"/>\n",
    "</div>\n",
    "\n",
    "DF-Paths for Incident\n",
    "<div>\n",
    "<img src=\"attachment:60a1bf0e-f91c-4fa4-8b49-cd53c6399b64.png\" width=\"500\"/>\n",
    "</div>\n",
    "\n",
    "Let's zoom in on one example\n",
    "<div>\n",
    "<img src=\"attachment:3af2de93-547c-4c97-915f-77c00717d7a9.png\" width=\"1000\"/>\n",
    "</div>\n",
    "\n",
    "DF-Paths for CI_SC\n",
    "<div>\n",
    "<img src=\"attachment:51062c7e-cf05-47e1-ade3-1651211779fc.png\" width=\"1000\"/>\n",
    "</div>"
   ],
   "id": "bb935989a45040d6"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Where Change and Interaction are straightforward (existing of just two events per object), Incident and CI_SC show more variability.\n",
    "\n",
    "Incident has two different types of events (IncidentActivityEvent and IncidentEvent).\n",
    "\n",
    "CI_SC has all four different types of events,\n",
    "there are some CI_SC that only have changes, some have all four.\n",
    "Finally, there is also some interaction happening at different Change Events."
   ],
   "id": "1e9ed631e2cc4590"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "### Inferring HighLevelEvents",
   "id": "4da735bfcfe44947"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "FZE: Say what a high-level event is, why you do so. Is this still part of enrichment?",
   "id": "a1f0dabc4b653801"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-26T16:54:48.585131600Z",
     "start_time": "2025-11-26T16:54:48.563238700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def infer_start_event(_db_connection, _object_type):\n",
    "    # infer start and end events for each object type\n",
    "    q_start_event = '''\n",
    "        :auto\n",
    "        // Infer start event of an object\n",
    "        MATCH (o) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "        MATCH (o)<-[]-(e:Event)\n",
    "        WHERE NOT ()-[:DF {id:o.sysId}]->(e)\n",
    "        CALL (o, e){\n",
    "            MERGE (o)<-[rel:START]-(e)\n",
    "            RETURN rel\n",
    "        } IN TRANSACTIONS\n",
    "        RETURN count(rel) as count\n",
    "    '''\n",
    "\n",
    "    q_start_event_result = Query(\n",
    "        query_str=q_start_event,\n",
    "        parameters={\"objectType\": _object_type}\n",
    "    )\n",
    "\n",
    "    res = _db_connection.exec_query(q_start_event_result)\n",
    "\n",
    "    print(f'-> Inferred Start Events for {res[0][\"count\"]} objects ({_object_type})')"
   ],
   "id": "5b692d1b11da7835",
   "outputs": [],
   "execution_count": 65
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-26T16:54:49.812557Z",
     "start_time": "2025-11-26T16:54:49.791732Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def infer_end_event(_db_connection, _object_type):\n",
    "    # infer start and end events for each object type\n",
    "    q_end_event = '''\n",
    "        :auto\n",
    "        // Infer start event of an object\n",
    "        MATCH (o) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "        MATCH (o)<-[]-(e:Event)\n",
    "        WHERE NOT (e)-[:DF {id:o.sysId}]->()\n",
    "        CALL (o, e){\n",
    "            MERGE (o)<-[rel:END]-(e)\n",
    "            RETURN rel\n",
    "        } IN TRANSACTIONS\n",
    "        RETURN count(rel) as count\n",
    "    '''\n",
    "\n",
    "    q_end_event_result = Query(\n",
    "        query_str=q_end_event,\n",
    "        parameters={\"objectType\": _object_type}\n",
    "    )\n",
    "\n",
    "    res = _db_connection.exec_query(q_end_event_result)\n",
    "\n",
    "    print(f'-> Inferred End Events for {res[0][\"count\"]} objects ({_object_type})')"
   ],
   "id": "c028931b75b72646",
   "outputs": [],
   "execution_count": 66
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-26T16:55:04.991572700Z",
     "start_time": "2025-11-26T16:54:51.044357600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "object_types = ['Interaction', 'Incident', 'Change']\n",
    "for object_type in object_types:\n",
    "    infer_start_event(db_connection, object_type)\n",
    "    infer_end_event(db_connection, object_type)"
   ],
   "id": "4f45dc8548f47696",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-> Inferred Start Events for 146557 objects (Interaction)\n",
      "-> Inferred End Events for 146557 objects (Interaction)\n",
      "-> Inferred Start Events for 48133 objects (Incident)\n",
      "-> Inferred End Events for 49887 objects (Incident)\n",
      "-> Inferred Start Events for 16614 objects (Change)\n",
      "-> Inferred End Events for 16619 objects (Change)\n"
     ]
    }
   ],
   "execution_count": 67
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-26T16:55:45.716783200Z",
     "start_time": "2025-11-26T16:55:45.592984300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# build index for high-level events\n",
    "qCreateIndexHLE_sys = f'''\n",
    "    CREATE INDEX highLevelEventSysIdIndex IF NOT EXISTS FOR (h:HighLevelEvent) ON (h.sysId);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_sys)\n",
    "\n",
    "qCreateIndexHLE_start = f'''\n",
    "    CREATE INDEX highLevelEventStartTimeIndex IF NOT EXISTS FOR (h:HighLevelEvent) ON (h.startTime);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_start)\n",
    "qCreateIndexHLE_end = f'''\n",
    "    CREATE INDEX highLevelEventEndTimeIndex IF NOT EXISTS FOR (h:HighLevelEvent) ON (h.endTime);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_end)\n"
   ],
   "id": "d5dc3a2c8710fd1e",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 68,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 68,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 68,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 68
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-26T16:56:08.114802300Z",
     "start_time": "2025-11-26T16:56:08.085259Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def infer_high_level_events(_db_connection, _object_type):\n",
    "    # build high-level events\n",
    "    q_build_high_level_event_str = '''\n",
    "        :auto\n",
    "        MATCH (n) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "        MATCH (eStart:Event)-[st:START]->(n)<-[en:END]-(eEnd:Event)\n",
    "        WITH DISTINCT eStart, eEnd\n",
    "        CALL (eStart, eEnd) {\n",
    "            MERGE (h:HighLevelEvent {sysId: \"HLE_\" + eStart.sysId + \"_\" + eEnd.sysId})\n",
    "            MERGE (h_et:EventType {eventType: 'HighLevelEvent'})\n",
    "            MERGE (h) - [:IS_OF_TYPE] -> (h_et)\n",
    "            ON CREATE SET h.startTime=eStart.timestamp, h.endTime=eEnd.timestamp, h.activity=$objectType\n",
    "            MERGE (h)-[:START]->(eStart)\n",
    "            MERGE (h)-[:END]->(eEnd)\n",
    "            RETURN h\n",
    "        } IN TRANSACTIONS\n",
    "        RETURN count(h) as count\n",
    "    '''\n",
    "\n",
    "    q_build_high_level_event_result = Query(\n",
    "        query_str=q_build_high_level_event_str,\n",
    "        parameters={\"objectType\": _object_type}\n",
    "    )\n",
    "\n",
    "    res = _db_connection.exec_query(q_build_high_level_event_result)\n",
    "    print(f'-> Inferred {res[0][\"count\"]} HighLevelEvent for ObjectType ({_object_type})')\n"
   ],
   "id": "efaadd5d9cb43acc",
   "outputs": [],
   "execution_count": 71
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-26T16:56:18.603135900Z",
     "start_time": "2025-11-26T16:56:10.470614600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "object_types = ['Interaction', 'Incident', 'Change']\n",
    "for object_type in object_types:\n",
    "    infer_high_level_events(db_connection, object_type)"
   ],
   "id": "dd22fe7fbe3ad45c",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-> Inferred 146557 HighLevelEvent for ObjectType (Interaction)\n",
      "-> Inferred 52813 HighLevelEvent for ObjectType (Incident)\n",
      "-> Inferred 16614 HighLevelEvent for ObjectType (Change)\n"
     ]
    }
   ],
   "execution_count": 72
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-26T16:57:28.500179Z",
     "start_time": "2025-11-26T16:57:28.485594700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def lift_e2o_relationship_to_hle(_db_connection, _object_type):\n",
    "    # lift CORR to high-level events\n",
    "    q_lift_e2o_str = '''\n",
    "        :auto\n",
    "        MATCH (h:HighLevelEvent) - [:START|END] -> () --> (o) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "        WITH distinct h, o\n",
    "        CALL (h, o) {\n",
    "            MERGE(h) - [c:CORR] -> (o)\n",
    "            RETURN c\n",
    "        } IN TRANSACTIONS\n",
    "        RETURN count(c) as count\n",
    "    '''\n",
    "\n",
    "    q_lift_e2o = Query(\n",
    "        query_str=q_lift_e2o_str,\n",
    "        parameters={\"objectType\": _object_type}\n",
    "    )\n",
    "\n",
    "    res = db_connection.exec_query(q_lift_e2o)\n",
    "    print(f'-> Lifted {res[0][\"count\"]} E2O relationships for ObjectType ({_object_type})')"
   ],
   "id": "af73f030998c470f",
   "outputs": [],
   "execution_count": 73
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-26T16:57:38.359590700Z",
     "start_time": "2025-11-26T16:57:29.556904Z"
    }
   },
   "cell_type": "code",
   "source": [
    "object_types = ['Interaction', 'Incident', 'Change', 'CI_SC']\n",
    "for object_type in object_types:\n",
    "    lift_e2o_relationship_to_hle(db_connection, object_type)"
   ],
   "id": "8e2be2f1845ad44",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-> Lifted 146557 E2O relationships for ObjectType (Interaction)\n",
      "-> Lifted 52813 E2O relationships for ObjectType (Incident)\n",
      "-> Lifted 16614 E2O relationships for ObjectType (Change)\n",
      "-> Lifted 226074 E2O relationships for ObjectType (CI_SC)\n"
     ]
    }
   ],
   "execution_count": 74
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-26T16:57:40.689847900Z",
     "start_time": "2025-11-26T16:57:40.670905400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# build DF relations between high-level events\n",
    "# step 1: build HL-DF relations between events\n",
    "\n",
    "def discover_df_hle(_db_connection, _object_type):\n",
    "    q_build_df_relations_hle_str = '''\n",
    "        :auto\n",
    "        // get only START/END events of each HL event correlated to CI_SC\n",
    "        MATCH (ot:ObjectType {objectType: 'CI_SC'}) <- [:IS_OF_TYPE] - (o) <- [:CORR] - (h:HighLevelEvent)\n",
    "        MATCH (o) <-[:CORR]- (h) -[:START|END] -> (e:Event)\n",
    "        WITH o, e ORDER BY e.timestamp, elementId(e) // order by time\n",
    "        WITH o, collect(e) AS events\n",
    "        UNWIND range(0, size(events)-2) AS idx\n",
    "        WITH idx, events[idx] AS fromEv, events[idx+1] AS toEv, o\n",
    "        CALL (o, idx, fromEv, toEv) {\n",
    "            // get their HL events correlated to the same object\n",
    "            MATCH (fromEv)<-[:START|END]-(h1:HighLevelEvent)-[:CORR]->(o)<-[:CORR]-(h2:HighLevelEvent)-[:START|END]->(toEv)\n",
    "            WHERE h1 <> h2\n",
    "            // and add their DF relation\n",
    "            MERGE (h1)-[rel:DF {objectType:'CI_SC', id:o.sysId, sequence_number: idx}]->(h2)\n",
    "            RETURN count(rel) as rel\n",
    "        } IN TRANSACTIONS\n",
    "        RETURN sum(rel) AS total\n",
    "\n",
    "    '''\n",
    "\n",
    "    q_build_df_relations_hle = Query(\n",
    "        query_str=q_build_df_relations_hle_str,\n",
    "        parameters={\n",
    "            \"objectType\": _object,\n",
    "        }\n",
    "    )\n",
    "\n",
    "    return db_connection.exec_query(q_build_df_relations_hle)"
   ],
   "id": "6d49c1edad104117",
   "outputs": [],
   "execution_count": 75
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-26T16:57:53.933490200Z",
     "start_time": "2025-11-26T16:57:41.218792700Z"
    }
   },
   "cell_type": "code",
   "source": "discover_df_hle(db_connection, _object_type='CI_SC')",
   "id": "cd7e0b31212419c1",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'total': 577239}]"
      ]
     },
     "execution_count": 76,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 76
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-26T16:58:28.815121600Z",
     "start_time": "2025-11-26T16:58:26.622600900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "count_events = '''\n",
    "MATCH (e:HighLevelEvent)\n",
    "RETURN e.activity, count(e)\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(count_events)"
   ],
   "id": "8a35a2add2445525",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'e.activity': 'Interaction', 'count(e)': 146557},\n",
       " {'e.activity': 'Incident', 'count(e)': 52813},\n",
       " {'e.activity': 'Change', 'count(e)': 16614}]"
      ]
     },
     "execution_count": 77,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 77
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "## Set Variant Analysis per CI_SC",
   "id": "be7efecb6f9514ea"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "FZE: I assume you are interested in the behavior of CI_SCs? Also, briefly say what a set variant is as this is not \"standard\" PM terminology",
   "id": "6d7ccba294748991"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-26T17:02:26.043596800Z",
     "start_time": "2025-11-26T17:02:26.031547300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def get_activity_set_variants(_db_connection, _object_type, _event_types):\n",
    "    # get the bag variants on the high_level\n",
    "    q_set_activity_variants_str = '''\n",
    "        MATCH (:ObjectType {objectType: $objectType}) <- [:IS_OF_TYPE] - (o) -- (e) - [:IS_OF_TYPE] -> (et:EventType)\n",
    "        WHERE et.eventType IN $eventTypes\n",
    "        WITH o, e.activity AS activity ORDER BY activity\n",
    "        WITH o, collect(distinct activity) as set_variant\n",
    "        RETURN ltrim(reduce(initial = \"\", activity in set_variant | initial + \" - (\" + activity + \")\" ), \" - \" ) as set_variant, count(o) as count_objects order by count_objects DESC\n",
    "    '''\n",
    "\n",
    "    q_set_activity_variants = Query(query_str=q_set_activity_variants_str,\n",
    "                                    parameters={'objectType': _object_type,\n",
    "                                                'eventTypes': event_types})\n",
    "\n",
    "    _result = pd.DataFrame(db_connection.exec_query(q_set_activity_variants))\n",
    "    _result['%_set_variant'] = round(\n",
    "        _result.groupby(['set_variant']).count_objects.transform(\"sum\") / sum(_result['count_objects']) * 100, 2)\n",
    "    return _result\n",
    "\n"
   ],
   "id": "70455fee1ad9fe24",
   "outputs": [],
   "execution_count": 78
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-26T17:03:01.599104900Z",
     "start_time": "2025-11-26T17:02:59.833976900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "event_types = ['HighLevelEvent']\n",
    "result = get_activity_set_variants(_db_connection=db_connection,\n",
    "                          _object_type='CI_SC',\n",
    "                          _event_types=event_types)"
   ],
   "id": "9586d6e73f8d01b7",
   "outputs": [],
   "execution_count": 81
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-11-26T17:03:01.625241200Z",
     "start_time": "2025-11-26T17:03:01.602107900Z"
    }
   },
   "cell_type": "code",
   "source": "print(result)",
   "id": "bc25a0330a6e15de",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                             set_variant  count_objects  %_set_variant\n",
      "0                               (Change)           8212          63.61\n",
      "1             (Incident) - (Interaction)           2038          15.79\n",
      "2                          (Interaction)           1554          12.04\n",
      "3  (Change) - (Incident) - (Interaction)            531           4.11\n",
      "4                             (Incident)            472           3.66\n",
      "5               (Change) - (Interaction)             71           0.55\n",
      "6                  (Change) - (Incident)             32           0.25\n"
     ]
    }
   ],
   "execution_count": 82
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "These results are difficult to interpret as the activities refer to different objects in the process, which are \"lost\" at this level of abstraction. <br> Let's then abstract and look at the event types:",
   "id": "f70d536ee0961c4a"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "def get_event_type_set_variants(_db_connection, _object_type, _event_types):\n",
    "    # get the bag variants on the high_level\n",
    "    q_set_event_type_variants_str = '''\n",
    "        MATCH (:ObjectType {objectType: $objectType}) <- [:IS_OF_TYPE] - (o) -- (e:Event) - [:IS_OF_TYPE] -> (et:EventType)\n",
    "        WHERE et.eventType IN $eventTypes\n",
    "        WITH o, et.eventType as event_type ORDER BY event_type\n",
    "        WITH o, collect(distinct event_type) as set_variant\n",
    "        RETURN ltrim(reduce(initial = \"\", activity in set_variant | initial + \" - (\" + activity + \")\" ), \" - \" ) as set_variant, count(o) as count_objects order by count_objects DESC\n",
    "    '''\n",
    "\n",
    "    q_set_event_type_variants = Query(query_str=q_set_event_type_variants_str,\n",
    "                                      parameters={'objectType': 'CI_SC',\n",
    "                                                  'eventTypes': event_types})\n",
    "\n",
    "    _result = pd.DataFrame(db_connection.exec_query(q_set_event_type_variants))\n",
    "    _result['%_set_variant'] = round(\n",
    "        _result.groupby(['set_variant']).count_objects.transform(\"sum\") / sum(_result['count_objects']) * 100, 2)\n",
    "    return _result"
   ],
   "id": "749ec69ad9a16ad1"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "event_types = ['ChangeEvent', 'InteractionEvent', 'IncidentEvent', 'IncidentActivityEvent']\n",
    "get_event_type_set_variants(_db_connection=db_connection,\n",
    "                            _object_type='CI_SC',\n",
    "                            _event_types=event_types)"
   ],
   "id": "f72a225202acbeb5"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "FZE: In the cell above I don't see all the outputs, but the numbers do not match. Easier to link the text below with variant number (e.g., 19.6% of them (variants 2 and 8) are only involved in InteractionEvents;\n",
   "id": "ef3f5b33b1117d58"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Now we only have 8 variants.\n",
    "\n",
    "By looking at the most frequent variants, we observe that most CI_SCs (63%) are only involved in ChangeEvents;\n",
    "19.6% of them have solely Incident(Activity)Events and InteractionEvents and 11.3% only InteractionEvent.\n",
    "Only 4.66% is involved in all types of events.\n",
    "\n",
    "Since we're interested in how the CI_SC behave over time, we can rescope our analysis to only look at the types of events.\n",
    "For this, we will infer higher level events.\n",
    "\n",
    "Instead of aggregating on the eventType level, we will aggregate on the main object they operate. So, that's for\n",
    "- Change --> ChangeEvent\n",
    "- Interaction --> InteractionEvent\n",
    "- Incident --> IncidentActivityEvent and IncidentEvent"
   ],
   "id": "2017765add8682b8"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "",
   "id": "705d9770ad8041a9"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "61c92ce2521bca74"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "5631e4604c40880d"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "d9b74a622ea304b9"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "# materialize time between events as duration on DF edge\n",
    "q_materialize_duration_on_df = '''\n",
    "    :auto\n",
    "    MATCH (e1:Event) - [df:DF] -> (e2:Event)\n",
    "    WHERE df.duration IS NULL\n",
    "    CALL (e1, df, e2) {\n",
    "        SET df.duration = duration.inSeconds(e1.timestamp, e2.timestamp).seconds\n",
    "    } IN TRANSACTIONS\n",
    "    RETURN count(*) AS total\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(q_materialize_duration_on_df)"
   ],
   "id": "9de3233072ba0198"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "4758fb2252a0eabd"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "f369bac0a17158b6"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "dcf6f5f9ebb0764e"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "151860e5a0469e20"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "4a75ce5413e0e57f"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "6e34970c28f2d797"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "## Building Directly-Follows Relationships between high-level events",
   "id": "9a8c7e2dbf7bdc3a"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "79271268574b57bd"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "c0bfc66c111b527f"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "def infer_hle_start_event(_db_connection, _object_type):\n",
    "    # infer start and end events for each object type\n",
    "    q_start_event = '''\n",
    "        :auto\n",
    "        // Infer start event of an object\n",
    "        MATCH (o) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "        MATCH (o) <- [] - (e:HighLevelEvent) - [:DF {id:o.sysId, sequence_number:1}] -> (e2)\n",
    "        CALL (o, e){\n",
    "            MERGE (o)<-[rel:START]-(e)\n",
    "            RETURN rel\n",
    "        } IN TRANSACTIONS\n",
    "        RETURN count(rel) as count\n",
    "    '''\n",
    "\n",
    "    q_start_event_result = Query(\n",
    "        query_str=q_start_event,\n",
    "        parameters={\"objectType\": _object_type}\n",
    "    )\n",
    "\n",
    "    res = _db_connection.exec_query(q_start_event_result)\n",
    "\n",
    "    print(f'-> Inferred High Level Start Events for {res[0][\"count\"]} objects ({_object_type})')"
   ],
   "id": "207be90a57a9ad2c"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "def infer_hle_end_event(_db_connection, _object_type):\n",
    "    # infer start and end events for each object type\n",
    "    q_end_event = '''\n",
    "        :auto\n",
    "        // Infer start event of an object\n",
    "        MATCH (o) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "        MATCH (o) <-[] - (e:HighLevelEvent) - [df:DF {id:o.sysId}] -> (next_e:HighLevelEvent)\n",
    "        WITH o, max(df.sequence_number) as last_df_index\n",
    "        MATCH (o) <-[] - (before:HighLevelEvent) - [df:DF {id:o.sysId, sequence_number:last_df_index}] -> (e:HighLevelEvent)\n",
    "        CALL (o, e){\n",
    "            MERGE (o)<-[rel:END]-(e)\n",
    "            RETURN rel\n",
    "        } IN TRANSACTIONS\n",
    "        RETURN count(rel) as count\n",
    "    '''\n",
    "\n",
    "    q_end_event_result = Query(\n",
    "        query_str=q_end_event,\n",
    "        parameters={\"objectType\": _object_type}\n",
    "    )\n",
    "\n",
    "    res = _db_connection.exec_query(q_end_event_result)\n",
    "\n",
    "    print(f'-> Inferred High Level End Events for {res[0][\"count\"]} objects ({_object_type})')"
   ],
   "id": "5354ba44bd10502e"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "infer_hle_start_event(_db_connection=db_connection,\n",
    "                      _object_type='CI_SC')\n",
    "infer_hle_end_event(_db_connection=db_connection,\n",
    "                    _object_type='CI_SC')"
   ],
   "id": "92469ba8ad80b3f6"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "# Discover different NBags\n",
    "For every shortest trace from the first event of a CI_SC until the last event of a CI_SC, we determine sequences of a specific length, so called nbags.\n",
    "Then for every CI_SC, we also request the type\n"
   ],
   "id": "69d003682abd3ce7"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "FZE: Why? What is a Nbag, why is the type important all of the sudden",
   "id": "ae1101f438e85b26"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "def get_nbag(size):\n",
    "    q_get_nbags_str = '''\n",
    "        MATCH (start:HighLevelEvent) - [:START] -> (o) - [:IS_OF_TYPE] -> (:ObjectType {objectType: 'CI_SC'})\n",
    "        MATCH (o) - [:RELATED] -> (ci:ConfigurationItem)\n",
    "        MATCH (end:HighLevelEvent) - [:END] -> (o)\n",
    "        MATCH p = SHORTEST 1 (start) - [:DF* {id:o.sysId}] -> (end)\n",
    "        UNWIND nodes(p) as event\n",
    "        WITH o, ci, event.activity as activity order by event.timestamp\n",
    "        WITH o, ci, collect(activity) as activities\n",
    "        WITH o, ci, [i in range(0, size(activities) - 1) WHERE i = 0 OR activities[i] <> activities[i-1] | activities[i]] AS activities\n",
    "        UNWIND range(0, size(activities) - $size) as i\n",
    "        WITH o, ci, activities[i..i+$size] as nbag_list\n",
    "        RETURN ci.ciType as type, ci.ciType as subtype, ltrim(reduce(init=\"\", t in nbag_list| init + \"-\" + t), '-') as nbag, count(nbag_list) as nbag_count\n",
    "    '''\n",
    "\n",
    "    q_get_nbags = Query(query_str=q_get_nbags_str,\n",
    "                        template_string_parameters={\n",
    "                            \"size\": size\n",
    "                        })\n",
    "\n",
    "    results = db_connection.exec_query(q_get_nbags)\n",
    "    nbags = pd.DataFrame(results)\n",
    "    table = pd.pivot_table(nbags, index=['nbag', 'type', 'subtype'], aggfunc=\"sum\")\n",
    "    table['%'] = (\n",
    "        round(\n",
    "            table.groupby(['nbag', 'type', 'subtype']).nbag_count.transform(\"sum\") /\n",
    "            sum(table.nbag_count) * 100,\n",
    "            2\n",
    "        )\n",
    "    )\n",
    "    return table"
   ],
   "id": "90900c7e7ba3e8b3"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "get_nbag(1)",
   "id": "38c6ee9aeea49e9b"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "get_nbag(2)",
   "id": "431eabeed2cdd5a4"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "get_nbag(3)",
   "id": "cd91e98df635bc71"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "FZE: What do we see here? Is there anything interesting to report/conclude?",
   "id": "4132e04e888ad064"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "# CI_SC Check\n",
    "CI_SC are often handled simultaneously. Sometimes, they go then on to a different route and come back later at a different point in time. <br>\n",
    "Let's check what happens in between these two events"
   ],
   "id": "3bd3cdcf0e905a57"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "FZE: the description above is cryptical. Where do they go? :-) I am not sure I understand it",
   "id": "65fd8f656fd7c508"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "def get_ci_scs_in_sync(db_connection):\n",
    "    query = '''\n",
    "            :auto\n",
    "\n",
    "\n",
    "        MATCH (e:HighLevelEvent) - [:CORR] -> (o1) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType:'CI_SC'})\n",
    "MATCH (e) - [:CORR] -> (o2) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType:'CI_SC'})\n",
    "WHERE o1 < o2\n",
    "WITH e, o1, o2\n",
    "CALL (e, o1, o2){\n",
    "  MATCH (f:HighLevelEvent)  - [:CORR] -> (o1)\n",
    "  MATCH (f) - [:CORR] -> (o2)\n",
    "  WHERE f.startTime >= e.startTime AND e <> f\n",
    "  RETURN f ORDER BY f.startTime limit 1\n",
    "} IN TRANSACTIONS\n",
    "CALL (o1, e, f){\n",
    "  MATCH p = SHORTEST 1 (e) - [:DF* {id: o1.sysId}] -> (f)\n",
    "  WITH p, nodes(p)[1..-1] as events\n",
    "  CALL (events) {\n",
    "    UNWIND events as event\n",
    "    WITH event ORDER BY event.activity\n",
    "    RETURN collect(distinct event.activity) as set_variant\n",
    "    }\n",
    "  RETURN nodes(p) as p_o1, set_variant as set_variant_o1\n",
    "} IN TRANSACTIONS\n",
    "CALL (o2, e, f){\n",
    "    MATCH p = SHORTEST 1 (e) - [:DF* {id: o2.sysId}] -> (f)\n",
    "  WITH p, nodes(p)[1..-1] as events\n",
    "  CALL (events) {\n",
    "    UNWIND events as event\n",
    "    WITH event ORDER BY event.activity\n",
    "    RETURN collect(distinct event.activity) as set_variant\n",
    "    }\n",
    "\n",
    "  RETURN nodes(p) as p_o2,  set_variant as  set_variant_o2\n",
    "\n",
    "} IN TRANSACTIONS\n",
    "    MATCH (o1) - [:RELATED] -> (ci1:ConfigurationItem)\n",
    "    MATCH (o2) - [:RELATED] -> (ci2:ConfigurationItem)\n",
    "    WITH o1, ci1, o2, ci2, p_o1, p_o2, set_variant_o1, set_variant_o2\n",
    "\n",
    "    CALL (set_variant_o1, set_variant_o2) {\n",
    "    WITH set_variant_o1, set_variant_o2, CASE\n",
    "        WHEN size(set_variant_o1) <= size(set_variant_o2) THEN set_variant_o1\n",
    "        ELSE set_variant_o2 END AS first_interruptions\n",
    "    WITH set_variant_o1, set_variant_o2, first_interruptions, CASE\n",
    "        WHEN first_interruptions = set_variant_o1 THEN set_variant_o2\n",
    "        ELSE set_variant_o1 END AS second_interruptions\n",
    "    WITH set_variant_o1, set_variant_o2, CASE\n",
    "        WHEN size(first_interruptions) = 0 THEN \" None\"\n",
    "        ELSE ltrim(reduce(init=\"\", item in first_interruptions | init + \"-\" + item), '-')  END AS interruptions_o1,\n",
    "    CASE\n",
    "        WHEN size(second_interruptions) = 0 THEN \" None\"\n",
    "        ELSE ltrim(reduce(init=\"\", item in second_interruptions | init + \"-\" + item), '-') END AS interruptions_o2\n",
    "    RETURN interruptions_o1, interruptions_o2}\n",
    "    RETURN ci1.ciType as c1Type, ci1.ciSubtype as c1Subtype, ci2.ciType as c2Type, ci2.ciSubtype as c2Subtype, interruptions_o1, interruptions_o2, count(o1) as occurrences\n",
    "\n",
    "    '''\n",
    "\n",
    "    result = pd.DataFrame(db_connection.exec_query(query=query))\n",
    "    table = pd.pivot_table(result, index=['interruptions_o1', 'interruptions_o2', 'c1Type', 'c1Subtype', 'c2Type', 'c2Subtype'], aggfunc=\"sum\")\n",
    "    table['%'] = (\n",
    "        round(\n",
    "            table.groupby(['interruptions_o1', 'interruptions_o2', 'c1Type', 'c1Subtype', 'c2Type', 'c2Subtype']).occurrences.transform(\"sum\") /\n",
    "            sum(table.occurrences) * 100,\n",
    "            2\n",
    "        )\n",
    "    )\n",
    "    return table\n"
   ],
   "id": "5bb2709c366af9ce"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "result = get_ci_scs_in_sync(db_connection)\n",
    "result"
   ],
   "id": "fb00da4e9e4847a1"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": [
    "new_result = result.reset_index()\n",
    "new_result = new_result.drop(columns=['c1Type', 'c1Subtype', 'c2Type', 'c2Subtype', '%'])\n",
    "table = pd.pivot_table(new_result, index=['interruptions_o1', 'interruptions_o2'], aggfunc=\"sum\")\n",
    "table['%'] = (\n",
    "    round(\n",
    "        table.groupby(['interruptions_o1', 'interruptions_o2']).occurrences.transform(\"sum\") /\n",
    "        sum(table.occurrences) * 100,\n",
    "        2\n",
    "    )\n",
    ")\n",
    "table\n"
   ],
   "id": "ad9fd2100c8c1da9"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "new_result.columns",
   "id": "dee1fe0f2c0916f9"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "e820c8acf56067fe"
  },
  {
   "metadata": {},
   "cell_type": "code",
   "outputs": [],
   "execution_count": null,
   "source": "",
   "id": "c56b20af7c8c66a6"
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "promg",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
