{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "c64b4305d3d23d83",
   "metadata": {},
   "source": [
    "## Prepare Project\n",
    "### Import Libraries and set up database connection"
   ]
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T15:10:59.270814Z",
     "start_time": "2025-12-04T15:10:59.077677600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "from IPython.core.interactiveshell import InteractiveShell\n",
    "\n",
    "InteractiveShell.ast_node_interactivity = \"all\"\n",
    "\n",
    "# Import pandas\n",
    "import pandas as pd\n",
    "\n",
    "pd.set_option('display.width', 2000)\n",
    "\n",
    "# Import logging and suppress warnings\n",
    "import logging\n",
    "\n",
    "logging.getLogger(\"neo4j\").setLevel(logging.ERROR)\n",
    "logging.getLogger(\"pd\").setLevel(logging.ERROR)\n",
    "\n",
    "# Import Path\n",
    "from pathlib import Path\n",
    "\n",
    "# Import promg\n",
    "from promg import Query"
   ],
   "id": "8fe967f6704e3799",
   "outputs": [],
   "execution_count": 1
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T15:10:59.366856100Z",
     "start_time": "2025-12-04T15:10:59.333341200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "from util.db_helper_functions import get_db_connection, get_graph_statistics\n",
    "from util.assign_types_functions import add_object_type_node\n",
    "from util.enrichment_methods import materialize_objects, extend_relationships, build_df_edges"
   ],
   "id": "68b01f097d5863f2",
   "outputs": [],
   "execution_count": 2
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "## Set up connection",
   "id": "7b1acf4dc586fd03"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T15:11:00.505322300Z",
     "start_time": "2025-12-04T15:11:00.458544400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "conf_path = Path('bpic14', 'config.yaml')\n",
    "db_connection = get_db_connection(conf_path)"
   ],
   "id": "9e5e34f5fc6c9ee2",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "These are the credentials that I expect to be set for the database.\n",
      "db_name: neo4j\n",
      "uri: bolt://localhost:7687\n",
      "password: bpic2014\n",
      "----------------------\n",
      "If you have other credentials, please change them at: bpic14\\config.yaml\n"
     ]
    }
   ],
   "execution_count": 3
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "# 3. Analysis",
   "id": "d2368866bc03a1e5"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "## Iteration 0: Filter Data based on Timestamps\n",
    "\n",
    "_Note: We did explain this filtering in the paper as this is focused on data preparation and not so much on enrichment_"
   ],
   "id": "8e87418916c269ef"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "**Exploration**\n",
    "Since events for the Incidents can come from two different data sources (`BPIC14Incident.csv` and `Detail_Incident_Activity.csv`) we check whether the start and end of the Incidents termporally align.\n",
    "\n",
    "Every Incident should start with its opening which is recorded in `BPIC14Incident.csv`.\n",
    "Then it should be followed by an `Open` event on the `:DetailIncident` level.\n",
    "\n",
    "Let's check whether that is the case."
   ],
   "id": "bb1105b02989b0e2"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T14:58:43.804807500Z",
     "start_time": "2025-12-04T14:58:38.436285500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "succeeding_events_q = '''\n",
    "    MATCH (e1:Event {activity: 'Open'}) - [:IS_OF_TYPE] -> (et:EventType {eventType: 'IncidentEvent'})\n",
    "    CALL (e1) {\n",
    "        MATCH (e1) - [:CORR] -> (:Incident) <- [:CORR] - (e2)\n",
    "        WHERE e1.timestamp <= e2.timestamp AND e1 <> e2\n",
    "        MATCH (e2) - [:IS_OF_TYPE] -> (et2:EventType)\n",
    "        RETURN e2, et2 ORDER BY e2.timestamp ASC LIMIT 1\n",
    "    }\n",
    "    RETURN et.eventType + ':' + e1.activity as first_event, et2.eventType + ':' + e2.activity as second_event, count(e1) as count order by count DESC'''\n",
    "\n",
    "df = pd.DataFrame(db_connection.exec_query(succeeding_events_q))\n",
    "print(f\"Total number of events: {sum(df['count'])}\")\n",
    "df"
   ],
   "id": "98ef2902d15644c1",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Total number of events: 46606\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "           first_event                                       second_event  count\n",
       "0   IncidentEvent:Open                         IncidentActivityEvent:Open  46369\n",
       "1   IncidentEvent:Open                   IncidentActivityEvent:Assignment     60\n",
       "2   IncidentEvent:Open              IncidentActivityEvent:Operator Update     46\n",
       "3   IncidentEvent:Open                 IncidentActivityEvent:Reassignment     42\n",
       "4   IncidentEvent:Open                IncidentActivityEvent:Status Change     27\n",
       "5   IncidentEvent:Open                       IncidentActivityEvent:Update     22\n",
       "6   IncidentEvent:Open         IncidentActivityEvent:Update from customer     18\n",
       "7   IncidentEvent:Open                              IncidentEvent:Resolve      4\n",
       "8   IncidentEvent:Open  IncidentActivityEvent:Communication with customer      4\n",
       "9   IncidentEvent:Open            IncidentActivityEvent:Analysis/Research      3\n",
       "10  IncidentEvent:Open           IncidentActivityEvent:Description Update      3\n",
       "11  IncidentEvent:Open                 IncidentActivityEvent:Caused By CI      2\n",
       "12  IncidentEvent:Open                IncidentActivityEvent:Impact Change      2\n",
       "13  IncidentEvent:Open                       IncidentActivityEvent:Closed      2\n",
       "14  IncidentEvent:Open    IncidentActivityEvent:Communication with vendor      1\n",
       "15  IncidentEvent:Open               IncidentActivityEvent:Pending vendor      1"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>first_event</th>\n",
       "      <th>second_event</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>IncidentEvent:Open</td>\n",
       "      <td>IncidentActivityEvent:Open</td>\n",
       "      <td>46369</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>IncidentEvent:Open</td>\n",
       "      <td>IncidentActivityEvent:Assignment</td>\n",
       "      <td>60</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>IncidentEvent:Open</td>\n",
       "      <td>IncidentActivityEvent:Operator Update</td>\n",
       "      <td>46</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>IncidentEvent:Open</td>\n",
       "      <td>IncidentActivityEvent:Reassignment</td>\n",
       "      <td>42</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>IncidentEvent:Open</td>\n",
       "      <td>IncidentActivityEvent:Status Change</td>\n",
       "      <td>27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>IncidentEvent:Open</td>\n",
       "      <td>IncidentActivityEvent:Update</td>\n",
       "      <td>22</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>IncidentEvent:Open</td>\n",
       "      <td>IncidentActivityEvent:Update from customer</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>IncidentEvent:Open</td>\n",
       "      <td>IncidentEvent:Resolve</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>IncidentEvent:Open</td>\n",
       "      <td>IncidentActivityEvent:Communication with customer</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>IncidentEvent:Open</td>\n",
       "      <td>IncidentActivityEvent:Analysis/Research</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>IncidentEvent:Open</td>\n",
       "      <td>IncidentActivityEvent:Description Update</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>IncidentEvent:Open</td>\n",
       "      <td>IncidentActivityEvent:Caused By CI</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>IncidentEvent:Open</td>\n",
       "      <td>IncidentActivityEvent:Impact Change</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>IncidentEvent:Open</td>\n",
       "      <td>IncidentActivityEvent:Closed</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>IncidentEvent:Open</td>\n",
       "      <td>IncidentActivityEvent:Communication with vendor</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>IncidentEvent:Open</td>\n",
       "      <td>IncidentActivityEvent:Pending vendor</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 9
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Indeed, most `(IncidentEvent:Open)` are followed by a `(IncidentActivityEvent:Open)`, however there are some 46606-46369=237 events that are not followed by such event.\n",
    "\n",
    "Let's check the minimum timestamp of the preceding event. It could be that for some cases, the `(IncidentActivityEvent:Open)` is not recorded because it falls outside the recording period."
   ],
   "id": "e23937e3785e7ee7"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T14:58:48.958066600Z",
     "start_time": "2025-12-04T14:58:47.387210400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "succeeding_events_timestamp_q = '''\n",
    "    MATCH (e1:Event {activity: 'Open'}) - [:IS_OF_TYPE] -> (et:EventType {eventType: 'IncidentEvent'})\n",
    "    CALL (e1) {\n",
    "        MATCH (e1) - [:CORR] -> (:Incident) <- [:CORR] - (e2)\n",
    "        WHERE e1.timestamp <= e2.timestamp AND e1 <> e2\n",
    "        MATCH (e2) - [:IS_OF_TYPE] -> (et2:EventType)\n",
    "        RETURN e2, et2 ORDER BY e2.timestamp, e2.activity ASC LIMIT 1\n",
    "    }\n",
    "    WITH e1, e2, et2\n",
    "    WHERE et2.eventType = 'IncidentActivityEvent'\n",
    "    WITH min(e2.timestamp) as first_occurrence, et2.eventType + ':' + e2.activity as event, count(e1) as count order by count DESC\n",
    "    RETURN first_occurrence, event, count order by first_occurrence DESC'''\n",
    "\n",
    "df = pd.DataFrame(db_connection.exec_query(succeeding_events_timestamp_q))\n",
    "df"
   ],
   "id": "1bd4b2562ed1930c",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                       first_occurrence                                              event  count\n",
       "0   2013-08-19T09:59:53.000000000+01:00                         IncidentActivityEvent:Open  46369\n",
       "1   2013-07-15T09:58:13.000000000+01:00                       IncidentActivityEvent:Reopen      1\n",
       "2   2013-06-20T14:05:30.000000000+01:00  IncidentActivityEvent:Communication with customer      2\n",
       "3   2013-05-23T12:50:01.000000000+01:00           IncidentActivityEvent:Description Update      3\n",
       "4   2013-05-10T13:26:58.000000000+01:00            IncidentActivityEvent:Analysis/Research      4\n",
       "5   2013-04-19T07:54:57.000000000+01:00    IncidentActivityEvent:Communication with vendor      1\n",
       "6   2013-03-11T15:37:45.000000000+01:00                IncidentActivityEvent:Impact Change      2\n",
       "7   2013-03-01T13:02:40.000000000+01:00   IncidentActivityEvent:External Vendor Assignment      3\n",
       "8   2013-02-21T07:12:50.000000000+01:00                 IncidentActivityEvent:Caused By CI      4\n",
       "9   2013-02-11T15:08:15.000000000+01:00                       IncidentActivityEvent:Update     12\n",
       "10  2013-02-04T15:06:56.000000000+01:00         IncidentActivityEvent:Update from customer     12\n",
       "11  2013-01-23T16:15:44.000000000+01:00                IncidentActivityEvent:Status Change     13\n",
       "12  2013-01-23T07:08:48.000000000+01:00                   IncidentActivityEvent:Assignment    121\n",
       "13  2013-01-07T15:49:40.000000000+01:00              IncidentActivityEvent:Operator Update     37\n",
       "14  2013-01-07T08:17:17.000000000+01:00                 IncidentActivityEvent:Reassignment     18"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>first_occurrence</th>\n",
       "      <th>event</th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2013-08-19T09:59:53.000000000+01:00</td>\n",
       "      <td>IncidentActivityEvent:Open</td>\n",
       "      <td>46369</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2013-07-15T09:58:13.000000000+01:00</td>\n",
       "      <td>IncidentActivityEvent:Reopen</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2013-06-20T14:05:30.000000000+01:00</td>\n",
       "      <td>IncidentActivityEvent:Communication with customer</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2013-05-23T12:50:01.000000000+01:00</td>\n",
       "      <td>IncidentActivityEvent:Description Update</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>2013-05-10T13:26:58.000000000+01:00</td>\n",
       "      <td>IncidentActivityEvent:Analysis/Research</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>2013-04-19T07:54:57.000000000+01:00</td>\n",
       "      <td>IncidentActivityEvent:Communication with vendor</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>2013-03-11T15:37:45.000000000+01:00</td>\n",
       "      <td>IncidentActivityEvent:Impact Change</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>2013-03-01T13:02:40.000000000+01:00</td>\n",
       "      <td>IncidentActivityEvent:External Vendor Assignment</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>2013-02-21T07:12:50.000000000+01:00</td>\n",
       "      <td>IncidentActivityEvent:Caused By CI</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>2013-02-11T15:08:15.000000000+01:00</td>\n",
       "      <td>IncidentActivityEvent:Update</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>2013-02-04T15:06:56.000000000+01:00</td>\n",
       "      <td>IncidentActivityEvent:Update from customer</td>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>2013-01-23T16:15:44.000000000+01:00</td>\n",
       "      <td>IncidentActivityEvent:Status Change</td>\n",
       "      <td>13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>2013-01-23T07:08:48.000000000+01:00</td>\n",
       "      <td>IncidentActivityEvent:Assignment</td>\n",
       "      <td>121</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>2013-01-07T15:49:40.000000000+01:00</td>\n",
       "      <td>IncidentActivityEvent:Operator Update</td>\n",
       "      <td>37</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>2013-01-07T08:17:17.000000000+01:00</td>\n",
       "      <td>IncidentActivityEvent:Reassignment</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 10
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "The `(IncidentActivityEvent:Open)` occurs from 2013-08-19 and from then onwards, it is always the first event after the `(IncidentEvent:Open)`.\n",
    "\n",
    "Let's check how many events we have before this date and after this date for any `(:Event)` node.\n"
   ],
   "id": "39d5bcbd984ad5d0"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T14:58:53.256902200Z",
     "start_time": "2025-12-04T14:58:52.280284700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query_str = '''\n",
    "        MATCH (e:Event) - [:IS_OF_TYPE] -> (et:EventType)\n",
    "        RETURN et.eventType as eventType, date(e.timestamp) < date(\"2013-08-19\") as before, count(e) as cnt ORDER BY eventType, before DESC\n",
    "'''\n",
    "result = pd.DataFrame(db_connection.exec_query(query_str))\n",
    "table = pd.pivot_table(result, index=['eventType', 'before'], aggfunc=\"sum\")\n",
    "table['%'] = (round(table.cnt / table.groupby(level=0).cnt.transform(\"sum\") * 100, 2)).astype(str) + '%'\n",
    "print(table)"
   ],
   "id": "66789c0bf9d91e06",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                                 cnt       %\n",
      "eventType             before                \n",
      "ChangeEvent           False    33254  99.62%\n",
      "                      True       127   0.38%\n",
      "IncidentActivityEvent False   461826  98.95%\n",
      "                      True      4911   1.05%\n",
      "IncidentEvent         False   137801  99.83%\n",
      "                      True       237   0.17%\n",
      "InteractionEvent      False   293561  99.85%\n",
      "                      True       447   0.15%\n"
     ]
    }
   ],
   "execution_count": 11
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Most events (99.4%) happen after 2013-08-19.\n",
    "\n",
    "Let's check how many objects have at least one event before this date.\n"
   ],
   "id": "ea88e416ecbfa102"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T14:58:57.085243300Z",
     "start_time": "2025-12-04T14:58:55.543985800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "        MATCH (o) - [:CORR] - (e:Event)\n",
    "        MATCH (e) - [:IS_OF_TYPE] -> (et:EventType)\n",
    "        WITH e, o, e.timestamp < dateTime(\"2013-08-19T09:59:53.000000000+01:00\") as before_cutoff\n",
    "        WITH o, collect(distinct before_cutoff) as before_cutoffs\n",
    "        MATCH (o) - [:IS_OF_TYPE] -> (ot:ObjectType)\n",
    "        RETURN ot.objectType as objectType, True in before_cutoffs as before, count(distinct o) as cnt\n",
    "    '''\n",
    "\n",
    "df_result = pd.DataFrame(db_connection.exec_query(query))\n",
    "table = pd.pivot_table(df_result, index=['objectType', 'before'], aggfunc=\"sum\")\n",
    "table['%'] = (round(table.cnt / table.groupby(level=0).cnt.transform(\"sum\") * 100, 2)).astype(str) + '%'\n",
    "print(table)\n",
    "\n"
   ],
   "id": "b7d9070b0732d08b",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                       cnt       %\n",
      "objectType  before                \n",
      "Change      False    16611  99.51%\n",
      "            True        82   0.49%\n",
      "Incident    False    46378  99.49%\n",
      "            True       238   0.51%\n",
      "Interaction False   146553  99.69%\n",
      "            True       451   0.31%\n"
     ]
    }
   ],
   "execution_count": 12
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "Most object (99.6%) have only events after 2013-08-19.",
   "id": "ad973506bb7669ad"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "**Filtering**\n",
    "From domain knowledge (and verified by the data) we see that most `(IncidentEvent:Open)` are followed by a `(IncidentActivityEvent:Open)`. The very few that don't have a first succeeding event before 2013-08-19.\n",
    "\n",
    "We decide to remove those objects that have at least one event before said date, as this only affects a small amount of objects. We also remove all associated events."
   ],
   "id": "a1fc131c0fe32f9d"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T14:59:06.852636900Z",
     "start_time": "2025-12-04T14:58:59.814581700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "results = []\n",
    "\n",
    "count_query = '''\n",
    "    MATCH (ot:ObjectType) <- [:IS_OF_TYPE] - (o) - [] - (e) - [:IS_OF_TYPE] -> (et:EventType)\n",
    "    WHERE ot.objectType in ['Incident', 'Interaction', 'Change']\n",
    "    WITH e, ot, o, e.timestamp < dateTime(\"2013-08-19T09:59:53.000000000+01:00\") as before_cutoff\n",
    "    WITH ot, o, collect(distinct before_cutoff) as before_cutoffs\n",
    "    WHERE True in before_cutoffs\n",
    "    MATCH (o) - [] - (all_e) - [:IS_OF_TYPE] -> (et:EventType)\n",
    "    RETURN ot.objectType as objectType, count(distinct o) as object_deleted, count(distinct all_e) as events_deleted\n",
    "'''\n",
    "\n",
    "df_deleted = pd.DataFrame(db_connection.exec_query(count_query))\n",
    "\n",
    "delete_query_str = '''\n",
    "    MATCH (ot:ObjectType) <- [:IS_OF_TYPE] - (o) - [] - (e) - [:IS_OF_TYPE] -> (et:EventType)\n",
    "    WHERE ot.objectType in ['Incident', 'Interaction', 'Change']\n",
    "    WITH e, o, e.timestamp < dateTime(\"2013-08-19T09:59:53.000000000+01:00\") as before_cutoff\n",
    "    WITH o, collect(distinct before_cutoff) as before_cutoffs\n",
    "    WHERE True in before_cutoffs\n",
    "    MATCH (o) - [] - (all_e) - [:IS_OF_TYPE] -> (et:EventType)\n",
    "    DETACH DELETE o\n",
    "    DETACH DELETE all_e\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(delete_query_str);"
   ],
   "id": "da0eb3a40a5b8e19",
   "outputs": [],
   "execution_count": 13
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "Let's also count the number of objects and events we kept.",
   "id": "d4fa258abd231eef"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T15:02:50.266559700Z",
     "start_time": "2025-12-04T15:02:46.524281200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "kept_count_query = '''\n",
    "    MATCH (ot:ObjectType) <- [:IS_OF_TYPE] - (o) - []  - (e) - [:IS_OF_TYPE] -> (et:EventType)\n",
    "    WHERE ot.objectType in  ['Incident', 'Interaction', 'Change']\n",
    "    RETURN ot.objectType as objectType, count(distinct o) as objects_kept, count(distinct e) as events_kept\n",
    "'''\n",
    "\n",
    "df_kept = pd.DataFrame(db_connection.exec_query(kept_count_query))"
   ],
   "id": "b4ff287a06a602ea",
   "outputs": [],
   "execution_count": 14
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T15:02:51.819212300Z",
     "start_time": "2025-12-04T15:02:51.770620700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "df_both = df_deleted.set_index('objectType').join(df_kept.set_index('objectType'))\n",
    "df_both['total_objects'] = df_both['objects_kept'] + df_both['object_deleted']\n",
    "df_both['total_events'] = df_both['events_kept'] + df_both['events_deleted']\n",
    "df_both['% events deleted'] = round(df_both['events_deleted'] / df_both['total_events'] * 100, 2)\n",
    "df_both['% objects deleted'] = round(df_both['object_deleted'] / df_both['total_objects'] * 100, 2)\n",
    "df_both = df_both[\n",
    "    ['object_deleted', 'objects_kept', 'total_objects', '% objects deleted', 'events_deleted', 'events_kept',\n",
    "     'total_events', '% events deleted']]\n",
    "df_both"
   ],
   "id": "3cafaea22f17d985",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "             object_deleted  objects_kept  total_objects  % objects deleted  events_deleted  events_kept  total_events  % events deleted\n",
       "objectType                                                                                                                              \n",
       "Incident                238         46378          46616               0.51            8691       596084        604775              1.44\n",
       "Interaction             451        146553         147004               0.31             902       293106        294008              0.31\n",
       "Change                   82         16611          16693               0.49             164        33217         33381              0.49"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>object_deleted</th>\n",
       "      <th>objects_kept</th>\n",
       "      <th>total_objects</th>\n",
       "      <th>% objects deleted</th>\n",
       "      <th>events_deleted</th>\n",
       "      <th>events_kept</th>\n",
       "      <th>total_events</th>\n",
       "      <th>% events deleted</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>objectType</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>Incident</th>\n",
       "      <td>238</td>\n",
       "      <td>46378</td>\n",
       "      <td>46616</td>\n",
       "      <td>0.51</td>\n",
       "      <td>8691</td>\n",
       "      <td>596084</td>\n",
       "      <td>604775</td>\n",
       "      <td>1.44</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Interaction</th>\n",
       "      <td>451</td>\n",
       "      <td>146553</td>\n",
       "      <td>147004</td>\n",
       "      <td>0.31</td>\n",
       "      <td>902</td>\n",
       "      <td>293106</td>\n",
       "      <td>294008</td>\n",
       "      <td>0.31</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Change</th>\n",
       "      <td>82</td>\n",
       "      <td>16611</td>\n",
       "      <td>16693</td>\n",
       "      <td>0.49</td>\n",
       "      <td>164</td>\n",
       "      <td>33217</td>\n",
       "      <td>33381</td>\n",
       "      <td>0.49</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 15
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "## Iteration 1: Enrich with a dedicated CI-SC object",
   "id": "c317b07c9822d868"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "**Materialize CI-SC object**\n",
    "\n",
    "To analyze the lifecycle of a CI, we first assessed its global uniqueness. Our domain model reveals a many-to-many relationship between CIs and SCs. Upon reflection, we found that CIs are locally unique within each SC, making the CI-SC pair the true object of interest. We materialized this relationship as a distinct object, CI-SC, using _Enrich Method 1: Materializing Objects_."
   ],
   "id": "d1367a075a529520"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T15:11:12.857048600Z",
     "start_time": "2025-12-04T15:11:12.842910Z"
    }
   },
   "cell_type": "code",
   "source": [
    "objects_to_materialize = {\n",
    "    \"CI_SC\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"ServiceComponent\"\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"ConfigurationItem\",\n",
    "            \"attributes\": {  # copy over attributes\n",
    "                \"ciType\": \"ciType\",\n",
    "                \"ciSubtype\": \"ciSubtype\"\n",
    "            }\n",
    "        },\n",
    "        \"relation_type\": \"CONTAINS\"\n",
    "    }]\n",
    "}"
   ],
   "id": "663ffbd6ae96951b",
   "outputs": [],
   "execution_count": 4
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T15:11:16.535320800Z",
     "start_time": "2025-12-04T15:11:13.300407500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "materialize_objects(_db_connection=db_connection,\n",
    "                    _objects_to_materialize=objects_to_materialize)"
   ],
   "id": "a37ce6758420f857",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "=== Materializing Relationships into Objects ===\n",
      "→ 15327 CI_SC nodes created.\n",
      "→ (:ObjectType {objectType: \"CI_SC\"}) created.\n"
     ]
    }
   ],
   "execution_count": 5
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "Results should show that we created 15327 `(:CI_SC)` nodes.",
   "id": "10c0bece29a9a574"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "**Materialize O2O relationships**\n",
    "\n",
    "We lift the relations from Incidents, Interactions, Changes _o_ to the newly materialized CI-SC pair _ci-sc_ if _o_ is related to both the _ci_ and _sc_ of which the _ci-sc_ pair is composed of using _Enrichment Method 3: Infer O2O_ relationship.\n",
    "\n",
    "More specifically, we lift the `:AFFECTED_CI` and `:AFFECTED_SC` relationship into `:AFFECTED_CISC` and `:CAUSED_BY_CI` and `:CAUSED_BY_SC` into `:CAUSED_BY_CI_SC`."
   ],
   "id": "a33d876b76bae4e1"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T15:11:18.575712800Z",
     "start_time": "2025-12-04T15:11:18.549267300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "o2o_relationships_to_extend = {\n",
    "    \"AFFECTED_CI_SC\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"Incident|Interaction|Change\",\n",
    "            \"relationships\": [\n",
    "                {\n",
    "                    \"related_label\": \"ServiceComponent\",\n",
    "                    \"related_object\": \"sc\",\n",
    "                    \"relation_type\": \"AFFECTED_SC\"\n",
    "                },\n",
    "                {\n",
    "                    \"related_label\": \"ConfigurationItem\",\n",
    "                    \"related_object\": \"ci\",\n",
    "                    \"relation_type\": \"AFFECTED_CI\"\n",
    "                }]\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"CI_SC\",\n",
    "            \"relationships\": [\n",
    "                {\n",
    "                    \"related_label\": \"ServiceComponent\",\n",
    "                    \"related_object\": \"sc\",\n",
    "                    \"relation_type\": \"RELATED\"\n",
    "                },\n",
    "                {\n",
    "                    \"related_label\": \"ConfigurationItem\",\n",
    "                    \"related_object\": \"ci\",\n",
    "                    \"relation_type\": \"RELATED\"\n",
    "                }]\n",
    "        }\n",
    "    }],\n",
    "    \"CAUSED_BY_CI_SC\": [{\n",
    "        \"from_object\": {\n",
    "            \"label\": \"Incident\",\n",
    "            \"relationships\": [\n",
    "                {\n",
    "                    \"related_label\": \"ServiceComponent\",\n",
    "                    \"related_object\": \"sc\",\n",
    "                    \"relation_type\": \"CAUSED_BY_SC\"\n",
    "                },\n",
    "                {\n",
    "                    \"related_label\": \"ConfigurationItem\",\n",
    "                    \"related_object\": \"ci\",\n",
    "                    \"relation_type\": \"CAUSED_BY_CI\"\n",
    "                }]\n",
    "        },\n",
    "        \"to_object\": {\n",
    "            \"label\": \"CI_SC\",\n",
    "            \"relationships\": [\n",
    "                {\n",
    "                    \"related_label\": \"ServiceComponent\",\n",
    "                    \"related_object\": \"sc\",\n",
    "                    \"relation_type\": \"RELATED\"\n",
    "                },\n",
    "                {\n",
    "                    \"related_label\": \"ConfigurationItem\",\n",
    "                    \"related_object\": \"ci\",\n",
    "                    \"relation_type\": \"RELATED\"\n",
    "                }]\n",
    "        }\n",
    "    }]\n",
    "}"
   ],
   "id": "21a7b87b6b9e9ddf",
   "outputs": [],
   "execution_count": 6
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T15:11:25.654941400Z",
     "start_time": "2025-12-04T15:11:19.569849800Z"
    }
   },
   "cell_type": "code",
   "source": "extend_relationships(db_connection, o2o_relationships_to_extend)",
   "id": "fc9285bc9c533c3",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "→ 222884 (:Incident|Interaction|Change) - [:AFFECTED_CI_SC] -> (:CI_SC) Relationship built\n",
      "→ 42928 (:Incident) - [:CAUSED_BY_CI_SC] -> (:CI_SC) Relationship built\n"
     ]
    }
   ],
   "execution_count": 7
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Results should show that we extended with\n",
    "- 222884 `(:Incident|Interaction|Change) - [:AFFECTED_CI_SC] -> (:CI_SC)` Relationships\n",
    "- 42928 `(:Incident) - [:CAUSED_BY_CI_SC] -> (:CI_SC)` Relationships"
   ],
   "id": "de5cb42af4847c68"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "**Materialize E2O relationships**\n",
    "\n",
    "Since Incidents, Interactions, and Changes relate to one or more CI-SCs, analysts must track CI-SCs across process steps to understand recurring disruptions and their impact on Changes. Isolated views of Interactions, Incidents, or Changes are insufficient. Thus, we linked these events directly to CI-SC objects using _Enrichment Method 2: Infer E2O relations_."
   ],
   "id": "aac6b8326d2dd810"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T15:12:13.908941300Z",
     "start_time": "2025-12-04T15:12:13.895343700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "e2o_relationships_to_extend = {\n",
    "    \"CORR\": [\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"Event\",\n",
    "                \"relationships\": [\n",
    "                    {\n",
    "                        \"related_label\": \"Change\",\n",
    "                        \"related_object\": \"change\",\n",
    "                        \"relation_type\": \"CORR\"\n",
    "                    }]\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"CI_SC\",\n",
    "                \"relationships\": [\n",
    "                    {\n",
    "                        \"related_label\": \"Change\",\n",
    "                        \"related_object\": \"change\",\n",
    "                        \"relation_type\": \"AFFECTED_CI_SC\"\n",
    "                    }]\n",
    "            }\n",
    "        },\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"Event\",\n",
    "                \"relationships\": [\n",
    "                    {\n",
    "                        \"related_label\": \"Incident\",\n",
    "                        \"related_object\": \"incident\",\n",
    "                        \"relation_type\": \"CORR\"\n",
    "                    }]\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"CI_SC\",\n",
    "                \"relationships\": [\n",
    "                    {\n",
    "                        \"related_label\": \"Incident\",\n",
    "                        \"related_object\": \"incident\",\n",
    "                        \"relation_type\": \"AFFECTED_CI_SC\"\n",
    "                    }]\n",
    "            }\n",
    "        },\n",
    "        {\n",
    "            \"from_object\": {\n",
    "                \"label\": \"Event\",\n",
    "                \"relationships\": [\n",
    "                    {\n",
    "                        \"related_label\": \"Interaction\",\n",
    "                        \"related_object\": \"interaction\",\n",
    "                        \"relation_type\": \"CORR\"\n",
    "                    }]\n",
    "            },\n",
    "            \"to_object\": {\n",
    "                \"label\": \"CI_SC\",\n",
    "                \"relationships\": [\n",
    "                    {\n",
    "                        \"related_label\": \"Interaction\",\n",
    "                        \"related_object\": \"interaction\",\n",
    "                        \"relation_type\": \"AFFECTED_CI_SC\"\n",
    "                    }]\n",
    "            }\n",
    "        }\n",
    "    ],\n",
    "}"
   ],
   "id": "d7acb988000e0d4f",
   "outputs": [],
   "execution_count": 8
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T15:12:27.532729100Z",
     "start_time": "2025-12-04T15:12:14.484478500Z"
    }
   },
   "cell_type": "code",
   "source": "extend_relationships(db_connection, e2o_relationships_to_extend)",
   "id": "9e2d69620e4810d0",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "→ 53413 (:Event) - [:CORR] -> (:CI_SC) Relationship built\n",
      "→ 596012 (:Event) - [:CORR] -> (:CI_SC) Relationship built\n",
      "→ 293106 (:Event) - [:CORR] -> (:CI_SC) Relationship built\n"
     ]
    }
   ],
   "execution_count": 9
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Results should show that we extend with\n",
    "- 53413 `(:Event) - [:CORR] -> (:CI_SC)` Relationships (via `:Change`)\n",
    "- 596012 `(:Event) - [:CORR] -> (:CI_SC)` Relationships (via `:Incident`)\n",
    "- 293106 `(:Event) - [:CORR] -> (:CI_SC)` Relationships (via `:Interaction`)"
   ],
   "id": "fab00b02337f4afb"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "**Materialize DF relationships**\n",
    "We inferred the temporal order of the events as DF relationships with _Enrichment method 4: Inferring DF relationships_.\n",
    "\n",
    "DF relationships are inferred for objects of a specific object type, we infer the relationships for the following objects as they are of interest to better understand the CI-SC lifecycle.\n",
    "- Interaction\n",
    "- Incident\n",
    "- Change\n",
    "- CI-SC"
   ],
   "id": "7d05407a50a84b59"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T15:12:38.006320600Z",
     "start_time": "2025-12-04T15:12:37.994819300Z"
    }
   },
   "cell_type": "code",
   "source": "object_types_for_df = ['Interaction', 'Incident', 'Change', 'CI_SC']",
   "id": "7834e7882e887b6b",
   "outputs": [],
   "execution_count": 10
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T15:13:21.227206900Z",
     "start_time": "2025-12-04T15:12:39.022092200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "build_df_edges(_db_connection=db_connection,\n",
    "               _object_types=object_types_for_df)"
   ],
   "id": "b036423b96028c21",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "→ Index for :Event (timestamp)\n",
      "-> Interaction DF creation result: 146553\n",
      "-> Incident DF creation result: 549706\n",
      "-> Change DF creation result: 16606\n",
      "-> CI_SC DF creation result: 929621\n"
     ]
    }
   ],
   "execution_count": 11
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "Complex nesting patterns can be found when exploring the DF-edges visually.\n",
    "For instance, Fig.6 (left) shows the trace of CI_SC with sysId: WBS000098_APP000003.\n",
    "\n",
    "To visualize it for yourself, you can do the following steps:\n",
    "1) In Neo4j Bloom, request CI_SC sysId: WBS000098_APP000003\n",
    "2) Right-click the node to expand all related :Events by expressing Expand, :CORR\n",
    "3) Select all events and reveal DF relationships.\n",
    "\n",
    "To color the event nodes per event type, we first need to add an eventType property using the following query. Then on the right hand side, you can select Event, then go to rule based, add a rule-based styling based on eventType with unique colours."
   ],
   "id": "a50fb535f8dad46d"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:48:25.000685900Z",
     "start_time": "2025-12-04T16:48:18.021361900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "MATCH (e:Event) - [:IS_OF_TYPE] -> (et:EventType)\n",
    "SET e.eventType = et.eventType\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(query);"
   ],
   "id": "58fad9a57b7fabf9",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 12
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "## Iteration 2: Enrich with High-Level Events\n",
    "TODO: add comments"
   ],
   "id": "c111ba1869439edd"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:51:08.008830900Z",
     "start_time": "2025-12-04T16:51:07.993811100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def infer_start_event(_db_connection, _object_type):\n",
    "    # infer start and end events for each object type\n",
    "    q_start_event = '''\n",
    "        :auto\n",
    "        // Infer start event of an object\n",
    "        MATCH (o) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "        MATCH (o)<-[]-(e:Event)\n",
    "        WHERE NOT ()-[:DF {id:o.sysId}]->(e)\n",
    "        CALL (o, e){\n",
    "            MERGE (o)<-[rel:START]-(e)\n",
    "            RETURN rel\n",
    "        } IN TRANSACTIONS\n",
    "        RETURN count(rel) as count\n",
    "    '''\n",
    "\n",
    "    q_start_event_result = Query(\n",
    "        query_str=q_start_event,\n",
    "        parameters={\"objectType\": _object_type}\n",
    "    )\n",
    "\n",
    "    res = _db_connection.exec_query(q_start_event_result)\n",
    "\n",
    "    print(f'→ Inferred Start Events for {res[0][\"count\"]} objects ({_object_type})')"
   ],
   "id": "c028931b75b72646",
   "outputs": [],
   "execution_count": 13
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:51:09.879469900Z",
     "start_time": "2025-12-04T16:51:09.846359400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def infer_end_event(_db_connection, _object_type):\n",
    "    # infer start and end events for each object type\n",
    "    q_end_event = '''\n",
    "        :auto\n",
    "        // Infer start event of an object\n",
    "        MATCH (o) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "        MATCH (o)<-[]-(e:Event)\n",
    "        WHERE NOT (e)-[:DF {id:o.sysId}]->()\n",
    "        CALL (o, e){\n",
    "            MERGE (o)<-[rel:END]-(e)\n",
    "            RETURN rel\n",
    "        } IN TRANSACTIONS\n",
    "        RETURN count(rel) as count\n",
    "    '''\n",
    "\n",
    "    q_end_event_result = Query(\n",
    "        query_str=q_end_event,\n",
    "        parameters={\"objectType\": _object_type}\n",
    "    )\n",
    "\n",
    "    res = _db_connection.exec_query(q_end_event_result)\n",
    "\n",
    "    print(f'→ Inferred End Events for {res[0][\"count\"]} objects ({_object_type})')"
   ],
   "id": "4f45dc8548f47696",
   "outputs": [],
   "execution_count": 14
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:51:24.697239200Z",
     "start_time": "2025-12-04T16:51:10.696212400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "object_types = ['Interaction', 'Incident', 'Change']\n",
    "for object_type in object_types:\n",
    "    infer_start_event(db_connection, object_type)\n",
    "    infer_end_event(db_connection, object_type)"
   ],
   "id": "d5dc3a2c8710fd1e",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "→ Inferred Start Events for 146553 objects (Interaction)\n",
      "→ Inferred End Events for 146553 objects (Interaction)\n",
      "→ Inferred Start Events for 46378 objects (Incident)\n",
      "→ Inferred End Events for 46378 objects (Incident)\n",
      "→ Inferred Start Events for 16611 objects (Change)\n",
      "→ Inferred End Events for 16616 objects (Change)\n"
     ]
    }
   ],
   "execution_count": 15
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:51:24.820991800Z",
     "start_time": "2025-12-04T16:51:24.699243300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# build index for high-level events\n",
    "qCreateIndexHLE_sys = f'''\n",
    "    CREATE INDEX highLevelEventSysIdIndex IF NOT EXISTS FOR (h:HighLevelEvent) ON (h.sysId);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_sys)\n",
    "\n",
    "qCreateIndexHLE_start = f'''\n",
    "    CREATE INDEX highLevelEventStartTimeIndex IF NOT EXISTS FOR (h:HighLevelEvent) ON (h.startTime);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_start)\n",
    "qCreateIndexHLE_end = f'''\n",
    "    CREATE INDEX highLevelEventEndTimeIndex IF NOT EXISTS FOR (h:HighLevelEvent) ON (h.endTime);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_end)\n"
   ],
   "id": "efaadd5d9cb43acc",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    },
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 16
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:51:24.836580100Z",
     "start_time": "2025-12-04T16:51:24.822496800Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def infer_high_level_events(_db_connection, _object_type):\n",
    "    # build high-level events\n",
    "    q_build_high_level_event_str = '''\n",
    "        :auto\n",
    "        MATCH (n) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "        MATCH (eStart:Event)-[st:START]->(n)<-[en:END]-(eEnd:Event)\n",
    "        WITH DISTINCT eStart, eEnd\n",
    "        CALL (eStart, eEnd) {\n",
    "            MERGE (h:HighLevelEvent {sysId: \"HLE_\" + eStart.sysId + \"_\" + eEnd.sysId})\n",
    "            MERGE (h_et:EventType {eventType: 'HighLevelEvent'})\n",
    "            MERGE (h) - [:IS_OF_TYPE] -> (h_et)\n",
    "            ON CREATE SET h.startTime=eStart.timestamp, h.endTime=eEnd.timestamp, h.activity=$objectType\n",
    "            MERGE (h)-[:START]->(eStart)\n",
    "            MERGE (h)-[:END]->(eEnd)\n",
    "            RETURN h\n",
    "        } IN TRANSACTIONS\n",
    "        RETURN count(h) as count\n",
    "    '''\n",
    "\n",
    "    q_build_high_level_event_result = Query(\n",
    "        query_str=q_build_high_level_event_str,\n",
    "        parameters={\"objectType\": _object_type}\n",
    "    )\n",
    "\n",
    "    res = _db_connection.exec_query(q_build_high_level_event_result)\n",
    "    print(f'→ Inferred {res[0][\"count\"]} HighLevelEvent for ObjectType ({_object_type})')\n"
   ],
   "id": "dd22fe7fbe3ad45c",
   "outputs": [],
   "execution_count": 17
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:51:49.083732300Z",
     "start_time": "2025-12-04T16:51:29.576234Z"
    }
   },
   "cell_type": "code",
   "source": [
    "object_types = ['Interaction', 'Incident', 'Change']\n",
    "for object_type in object_types:\n",
    "    infer_high_level_events(db_connection, object_type)"
   ],
   "id": "af73f030998c470f",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "→ Inferred 146553 HighLevelEvent for ObjectType (Interaction)\n",
      "→ Inferred 46378 HighLevelEvent for ObjectType (Incident)\n",
      "→ Inferred 16611 HighLevelEvent for ObjectType (Change)\n"
     ]
    }
   ],
   "execution_count": 18
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:52:50.782140100Z",
     "start_time": "2025-12-04T16:52:50.766847900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def lift_e2o_relationship_to_hle(_db_connection, _object_type):\n",
    "    # lift CORR to high-level events\n",
    "    q_lift_e2o_str = '''\n",
    "        :auto\n",
    "        MATCH (h:HighLevelEvent) - [:START|END] -> () --> (o) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType: $objectType})\n",
    "        WITH distinct h, o\n",
    "        CALL (h, o) {\n",
    "            MERGE(h) - [c:CORR] -> (o)\n",
    "            RETURN c\n",
    "        } IN TRANSACTIONS\n",
    "        RETURN count(c) as count\n",
    "    '''\n",
    "\n",
    "    q_lift_e2o = Query(\n",
    "        query_str=q_lift_e2o_str,\n",
    "        parameters={\"objectType\": _object_type}\n",
    "    )\n",
    "\n",
    "    res = db_connection.exec_query(q_lift_e2o)\n",
    "    print(f'→ Lifted {res[0][\"count\"]} E2O relationships for ObjectType ({_object_type})')"
   ],
   "id": "8e2be2f1845ad44",
   "outputs": [],
   "execution_count": 20
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:53:01.512891300Z",
     "start_time": "2025-12-04T16:52:51.743029900Z"
    }
   },
   "cell_type": "code",
   "source": [
    "object_types = ['Interaction', 'Incident', 'Change', 'CI_SC']\n",
    "for object_type in object_types:\n",
    "    lift_e2o_relationship_to_hle(db_connection, object_type)"
   ],
   "id": "6d49c1edad104117",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "→ Lifted 146553 E2O relationships for ObjectType (Interaction)\n",
      "→ Lifted 46378 E2O relationships for ObjectType (Incident)\n",
      "→ Lifted 16611 E2O relationships for ObjectType (Change)\n",
      "→ Lifted 219630 E2O relationships for ObjectType (CI_SC)\n"
     ]
    }
   ],
   "execution_count": 21
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:54:09.335550100Z",
     "start_time": "2025-12-04T16:54:09.305892500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# build DF relations between high-level events\n",
    "# step 1: build HL-DF relations between events\n",
    "\n",
    "def discover_df_hle(_db_connection, _object_type):\n",
    "    q_build_df_relations_hle_str = '''\n",
    "        :auto\n",
    "        // get only START/END events of each HL event correlated to CI_SC\n",
    "        MATCH (ot:ObjectType {objectType: 'CI_SC'}) <- [:IS_OF_TYPE] - (o) <- [:CORR] - (h:HighLevelEvent)\n",
    "        MATCH (o) <-[:CORR]- (h) -[:START|END] -> (e:Event)\n",
    "        WITH o, e ORDER BY e.timestamp, elementId(e) // order by time\n",
    "        WITH o, collect(e) AS events\n",
    "        UNWIND range(0, size(events)-2) AS idx\n",
    "        WITH idx, events[idx] AS fromEv, events[idx+1] AS toEv, o\n",
    "        CALL (o, idx, fromEv, toEv) {\n",
    "            // get their HL events correlated to the same object\n",
    "            MATCH (fromEv)<-[:START|END]-(h1:HighLevelEvent)-[:CORR]->(o)<-[:CORR]-(h2:HighLevelEvent)-[:START|END]->(toEv)\n",
    "            WHERE h1 <> h2\n",
    "            // and add their DF relation\n",
    "            MERGE (h1)-[rel:DF {objectType:'CI_SC', id:o.sysId}]->(h2)\n",
    "            RETURN count(rel) as rel\n",
    "        } IN TRANSACTIONS\n",
    "        RETURN sum(rel) AS total\n",
    "\n",
    "    '''\n",
    "\n",
    "    q_build_df_relations_hle = Query(\n",
    "        query_str=q_build_df_relations_hle_str,\n",
    "        parameters={\n",
    "            \"objectType\": _object_type,\n",
    "        }\n",
    "    )\n",
    "\n",
    "    return db_connection.exec_query(q_build_df_relations_hle)"
   ],
   "id": "cd7e0b31212419c1",
   "outputs": [],
   "execution_count": 22
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:54:21.303126800Z",
     "start_time": "2025-12-04T16:54:10.126741500Z"
    }
   },
   "cell_type": "code",
   "source": "discover_df_hle(db_connection, _object_type='CI_SC')",
   "id": "8a35a2add2445525",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'total': 334901}]"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 23
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:57:04.995072300Z",
     "start_time": "2025-12-04T16:57:02.762012300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "count_events = '''\n",
    "MATCH (e:HighLevelEvent)\n",
    "RETURN e.activity, count(e)\n",
    "'''\n",
    "\n",
    "db_connection.exec_query(count_events)"
   ],
   "id": "d49a99bb7ca9d45d",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'e.activity': 'Interaction', 'count(e)': 146553},\n",
       " {'e.activity': 'Incident', 'count(e)': 46378},\n",
       " {'e.activity': 'Change', 'count(e)': 16611}]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 24
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "## Iteration 3: Enrich Domain-Perspective with Set Variants Feature\n",
    "TODO: add comments"
   ],
   "id": "6d7ccba294748991"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:57:06.452059300Z",
     "start_time": "2025-12-04T16:57:06.442068200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def get_activity_set_variants(_db_connection, _object_type, _event_types):\n",
    "    # get the bag variants on the high_level\n",
    "    q_set_activity_variants_str = '''\n",
    "        MATCH (:ObjectType {objectType: $objectType}) <- [:IS_OF_TYPE] - (o) -- (e) - [:IS_OF_TYPE] -> (et:EventType)\n",
    "        WHERE et.eventType IN $eventTypes\n",
    "        WITH o, e.activity AS activity ORDER BY activity\n",
    "        WITH o, collect(distinct activity) as set_variant\n",
    "        RETURN ltrim(reduce(initial = \"\", activity in set_variant | initial + \" - (\" + activity + \")\" ), \" - \" ) as set_variant, count(o) as count_objects order by count_objects DESC\n",
    "    '''\n",
    "\n",
    "    q_set_activity_variants = Query(query_str=q_set_activity_variants_str,\n",
    "                                    parameters={\n",
    "                                        'objectType': _object_type,\n",
    "                                        'eventTypes': event_types\n",
    "                                    })\n",
    "\n",
    "    _result = pd.DataFrame(db_connection.exec_query(q_set_activity_variants))\n",
    "    _result['%_set_variant'] = round(\n",
    "        _result.groupby(['set_variant']).count_objects.transform(\"sum\") / sum(_result['count_objects']) * 100, 2)\n",
    "    return _result\n",
    "\n"
   ],
   "id": "9586d6e73f8d01b7",
   "outputs": [],
   "execution_count": 25
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:57:09.384427800Z",
     "start_time": "2025-12-04T16:57:07.028780100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "event_types = ['HighLevelEvent']\n",
    "result = get_activity_set_variants(_db_connection=db_connection,\n",
    "                                   _object_type='CI_SC',\n",
    "                                   _event_types=event_types)"
   ],
   "id": "bc25a0330a6e15de",
   "outputs": [],
   "execution_count": 26
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:57:09.408950600Z",
     "start_time": "2025-12-04T16:57:09.386428Z"
    }
   },
   "cell_type": "code",
   "source": "print(result)",
   "id": "826b0b4372a7e786",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "                             set_variant  count_objects  %_set_variant\n",
      "0                               (Change)           8212          63.61\n",
      "1             (Incident) - (Interaction)           2038          15.79\n",
      "2                          (Interaction)           1554          12.04\n",
      "3  (Change) - (Incident) - (Interaction)            531           4.11\n",
      "4                             (Incident)            472           3.66\n",
      "5               (Change) - (Interaction)             71           0.55\n",
      "6                  (Change) - (Incident)             32           0.25\n"
     ]
    }
   ],
   "execution_count": 27
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:57:09.438352700Z",
     "start_time": "2025-12-04T16:57:09.409953500Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def assign_exposure_level(_db_connection, _object_type, _event_types):\n",
    "    q_assign_exposure_level_str = '''\n",
    "        MATCH (:ObjectType {objectType: $objectType}) <- [:IS_OF_TYPE] - (o) -- (e) - [:IS_OF_TYPE] -> (et:EventType)\n",
    "        WHERE et.eventType IN $eventTypes\n",
    "        WITH o, e.activity AS activity ORDER BY activity\n",
    "        WITH o, collect(distinct activity) as set_variant\n",
    "        WITH o, set_variant,\n",
    "        CASE\n",
    "            WHEN size(set_variant) = 1 AND 'Change' in set_variant THEN 'internal'\n",
    "            WHEN size(set_variant) > 1 AND 'Change' in set_variant THEN 'combined'\n",
    "            ELSE 'exposed'\n",
    "        END AS exposure\n",
    "        SET o.exposure_level = exposure'''\n",
    "\n",
    "    q_assign_exposure_level = Query(query_str=q_assign_exposure_level_str,\n",
    "                                    parameters={\n",
    "                                        'objectType': _object_type,\n",
    "                                        'eventTypes': _event_types\n",
    "                                    })\n",
    "\n",
    "    db_connection.exec_query(q_assign_exposure_level)"
   ],
   "id": "729d25b598f54c31",
   "outputs": [],
   "execution_count": 28
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:57:11.910257500Z",
     "start_time": "2025-12-04T16:57:09.441715700Z"
    }
   },
   "cell_type": "code",
   "source": [
    "event_types = ['HighLevelEvent']\n",
    "assign_exposure_level(_db_connection=db_connection,\n",
    "                      _object_type='CI_SC',\n",
    "                      _event_types=event_types)"
   ],
   "id": "2cd9b11aa8315f10",
   "outputs": [],
   "execution_count": 29
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:57:12.032934400Z",
     "start_time": "2025-12-04T16:57:11.921134300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "query = '''\n",
    "MATCH (o:CI_SC)\n",
    "WHERE o.exposure_level is not null AND not o.ciType in ['no type', '#N/B']\n",
    "RETURN o.ciType as ciType, o.exposure_level as exposure_level, count(o) as count\n",
    "'''\n",
    "\n",
    "exposure_level_per_type = pd.DataFrame(db_connection.exec_query(query))"
   ],
   "id": "c79779ae9a577913",
   "outputs": [],
   "execution_count": 30
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:57:13.580680700Z",
     "start_time": "2025-12-04T16:57:13.520399600Z"
    }
   },
   "cell_type": "code",
   "source": [
    "# Group by ciType and exposure_level, summing the counts\n",
    "grouped = exposure_level_per_type.groupby(['ciType', 'exposure_level'], as_index=False).sum()\n",
    "\n",
    "# Calculate the total count for each ciType\n",
    "total_counts = grouped.groupby('ciType')['count'].transform('sum')\n",
    "\n",
    "# Calculate the relative proportion\n",
    "grouped['relative_proportion'] = round(grouped['count'] / total_counts, 2)\n",
    "\n",
    "# Pivot the table to get one row per ciType\n",
    "pivoted = grouped.pivot(\n",
    "    index='ciType',\n",
    "    columns='exposure_level',\n",
    "    values='relative_proportion'\n",
    ").reset_index()\n",
    "\n",
    "# Fill NaN values with 0 (for ciTypes missing certain exposure_levels)\n",
    "pivoted = pivoted.fillna(0)\n",
    "pivoted = pivoted.sort_values(by=['combined'], ascending=[False])\n",
    "\n",
    "# Display the result\n",
    "print(pivoted)"
   ],
   "id": "354e2d2dc2390688",
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "exposure_level                ciType  combined  exposed  internal\n",
      "1                        application      0.19     0.21      0.60\n",
      "10                           storage      0.16     0.07      0.77\n",
      "6                           hardware      0.09     0.20      0.71\n",
      "11                    subapplication      0.09     0.18      0.73\n",
      "9                           software      0.02     0.08      0.90\n",
      "7                  networkcomponents      0.02     0.10      0.88\n",
      "3                           computer      0.02     0.45      0.53\n",
      "4                           database      0.01     0.02      0.97\n",
      "8                  officeelectronics      0.01     0.89      0.11\n",
      "0                              Phone      0.00     0.02      0.98\n",
      "2               applicationcomponent      0.00     0.00      0.99\n",
      "5                      displaydevice      0.00     0.93      0.07\n"
     ]
    }
   ],
   "execution_count": 31
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "## Iteration 4: Explore how CI-SCs of selected subset are managed together",
   "id": "ccbac2f3989c2b17"
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": "Determine number of affected CI_SCs per change",
   "id": "eb07a0e975575a55"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:57:17.296247200Z",
     "start_time": "2025-12-04T16:57:16.534828300Z"
    }
   },
   "cell_type": "code",
   "source": [
    "ci_scs_per_change_q = '''\n",
    "    MATCH (ci_sc:CI_SC) <- [:AFFECTED_CI_SC] - (c:Change)\n",
    "    WITH c, count(distinct ci_sc) as count\n",
    "\n",
    "    RETURN c.sysId, count\n",
    "'''\n",
    "\n",
    "ci_scs_per_change = pd.DataFrame(db_connection.exec_query(ci_scs_per_change_q))"
   ],
   "id": "44213ce6ba89864c",
   "outputs": [],
   "execution_count": 32
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:57:19.458205Z",
     "start_time": "2025-12-04T16:57:19.323831200Z"
    }
   },
   "cell_type": "code",
   "source": [
    "ci_scs_per_change_q = '''\n",
    "    MATCH (ci_sc:CI_SC) <- [:AFFECTED_CI_SC] - (c:Change)\n",
    "    WITH c, count(distinct ci_sc) as count\n",
    "\n",
    "    RETURN count(c) as num_changes, count order by count\n",
    "'''\n",
    "\n",
    "change_count = pd.DataFrame(db_connection.exec_query(ci_scs_per_change_q))\n",
    "\n",
    "# Assuming your table is in a DataFrame called df\n",
    "total_changes = change_count['num_changes'].sum()\n",
    "\n",
    "# Calculate the proportion for each group\n",
    "change_count['proportion'] = change_count['num_changes'] / total_changes\n",
    "\n",
    "# Optionally, convert to percentage\n",
    "change_count['percentage'] = change_count['proportion'] * 100\n",
    "\n",
    "change_count"
   ],
   "id": "cb200ceb12365f1b",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "    num_changes  count  proportion  percentage\n",
       "0         13980      1    0.780221   78.022101\n",
       "1          2071      2    0.115582   11.558210\n",
       "2           619      3    0.034546    3.454627\n",
       "3           563      4    0.031421    3.142092\n",
       "4           156      5    0.008706    0.870633\n",
       "5           173      6    0.009655    0.965510\n",
       "6            50      7    0.002790    0.279049\n",
       "7            93      8    0.005190    0.519031\n",
       "8            35      9    0.001953    0.195334\n",
       "9            36     10    0.002009    0.200915\n",
       "10           18     11    0.001005    0.100458\n",
       "11           21     12    0.001172    0.117201\n",
       "12           12     13    0.000670    0.066972\n",
       "13           15     14    0.000837    0.083715\n",
       "14            5     15    0.000279    0.027905\n",
       "15            5     16    0.000279    0.027905\n",
       "16            2     17    0.000112    0.011162\n",
       "17            8     18    0.000446    0.044648\n",
       "18            3     19    0.000167    0.016743\n",
       "19            6     20    0.000335    0.033486\n",
       "20            3     21    0.000167    0.016743\n",
       "21            1     22    0.000056    0.005581\n",
       "22            2     23    0.000112    0.011162\n",
       "23            3     24    0.000167    0.016743\n",
       "24            5     25    0.000279    0.027905\n",
       "25            3     26    0.000167    0.016743\n",
       "26            4     28    0.000223    0.022324\n",
       "27            2     29    0.000112    0.011162\n",
       "28            2     30    0.000112    0.011162\n",
       "29            1     32    0.000056    0.005581\n",
       "30            1     34    0.000056    0.005581\n",
       "31            1     35    0.000056    0.005581\n",
       "32            2     37    0.000112    0.011162\n",
       "33            2     39    0.000112    0.011162\n",
       "34            1     41    0.000056    0.005581\n",
       "35            1     42    0.000056    0.005581\n",
       "36            1     43    0.000056    0.005581\n",
       "37            1     46    0.000056    0.005581\n",
       "38            1     47    0.000056    0.005581\n",
       "39            1     50    0.000056    0.005581\n",
       "40            1     53    0.000056    0.005581\n",
       "41            1     55    0.000056    0.005581\n",
       "42            1     64    0.000056    0.005581\n",
       "43            1     67    0.000056    0.005581\n",
       "44            1     70    0.000056    0.005581\n",
       "45            1     73    0.000056    0.005581\n",
       "46            1    127    0.000056    0.005581\n",
       "47            1    145    0.000056    0.005581\n",
       "48            1   1007    0.000056    0.005581"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>num_changes</th>\n",
       "      <th>count</th>\n",
       "      <th>proportion</th>\n",
       "      <th>percentage</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>13980</td>\n",
       "      <td>1</td>\n",
       "      <td>0.780221</td>\n",
       "      <td>78.022101</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>2071</td>\n",
       "      <td>2</td>\n",
       "      <td>0.115582</td>\n",
       "      <td>11.558210</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>619</td>\n",
       "      <td>3</td>\n",
       "      <td>0.034546</td>\n",
       "      <td>3.454627</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>563</td>\n",
       "      <td>4</td>\n",
       "      <td>0.031421</td>\n",
       "      <td>3.142092</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>156</td>\n",
       "      <td>5</td>\n",
       "      <td>0.008706</td>\n",
       "      <td>0.870633</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>173</td>\n",
       "      <td>6</td>\n",
       "      <td>0.009655</td>\n",
       "      <td>0.965510</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>50</td>\n",
       "      <td>7</td>\n",
       "      <td>0.002790</td>\n",
       "      <td>0.279049</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>93</td>\n",
       "      <td>8</td>\n",
       "      <td>0.005190</td>\n",
       "      <td>0.519031</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>35</td>\n",
       "      <td>9</td>\n",
       "      <td>0.001953</td>\n",
       "      <td>0.195334</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>36</td>\n",
       "      <td>10</td>\n",
       "      <td>0.002009</td>\n",
       "      <td>0.200915</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>18</td>\n",
       "      <td>11</td>\n",
       "      <td>0.001005</td>\n",
       "      <td>0.100458</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>21</td>\n",
       "      <td>12</td>\n",
       "      <td>0.001172</td>\n",
       "      <td>0.117201</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>12</td>\n",
       "      <td>13</td>\n",
       "      <td>0.000670</td>\n",
       "      <td>0.066972</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>15</td>\n",
       "      <td>14</td>\n",
       "      <td>0.000837</td>\n",
       "      <td>0.083715</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>5</td>\n",
       "      <td>15</td>\n",
       "      <td>0.000279</td>\n",
       "      <td>0.027905</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>5</td>\n",
       "      <td>16</td>\n",
       "      <td>0.000279</td>\n",
       "      <td>0.027905</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>2</td>\n",
       "      <td>17</td>\n",
       "      <td>0.000112</td>\n",
       "      <td>0.011162</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>8</td>\n",
       "      <td>18</td>\n",
       "      <td>0.000446</td>\n",
       "      <td>0.044648</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>3</td>\n",
       "      <td>19</td>\n",
       "      <td>0.000167</td>\n",
       "      <td>0.016743</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>6</td>\n",
       "      <td>20</td>\n",
       "      <td>0.000335</td>\n",
       "      <td>0.033486</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>3</td>\n",
       "      <td>21</td>\n",
       "      <td>0.000167</td>\n",
       "      <td>0.016743</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>1</td>\n",
       "      <td>22</td>\n",
       "      <td>0.000056</td>\n",
       "      <td>0.005581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>2</td>\n",
       "      <td>23</td>\n",
       "      <td>0.000112</td>\n",
       "      <td>0.011162</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>3</td>\n",
       "      <td>24</td>\n",
       "      <td>0.000167</td>\n",
       "      <td>0.016743</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>5</td>\n",
       "      <td>25</td>\n",
       "      <td>0.000279</td>\n",
       "      <td>0.027905</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>3</td>\n",
       "      <td>26</td>\n",
       "      <td>0.000167</td>\n",
       "      <td>0.016743</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>4</td>\n",
       "      <td>28</td>\n",
       "      <td>0.000223</td>\n",
       "      <td>0.022324</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>2</td>\n",
       "      <td>29</td>\n",
       "      <td>0.000112</td>\n",
       "      <td>0.011162</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>2</td>\n",
       "      <td>30</td>\n",
       "      <td>0.000112</td>\n",
       "      <td>0.011162</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>1</td>\n",
       "      <td>32</td>\n",
       "      <td>0.000056</td>\n",
       "      <td>0.005581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>1</td>\n",
       "      <td>34</td>\n",
       "      <td>0.000056</td>\n",
       "      <td>0.005581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>1</td>\n",
       "      <td>35</td>\n",
       "      <td>0.000056</td>\n",
       "      <td>0.005581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>2</td>\n",
       "      <td>37</td>\n",
       "      <td>0.000112</td>\n",
       "      <td>0.011162</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>2</td>\n",
       "      <td>39</td>\n",
       "      <td>0.000112</td>\n",
       "      <td>0.011162</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>1</td>\n",
       "      <td>41</td>\n",
       "      <td>0.000056</td>\n",
       "      <td>0.005581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>1</td>\n",
       "      <td>42</td>\n",
       "      <td>0.000056</td>\n",
       "      <td>0.005581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>1</td>\n",
       "      <td>43</td>\n",
       "      <td>0.000056</td>\n",
       "      <td>0.005581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>1</td>\n",
       "      <td>46</td>\n",
       "      <td>0.000056</td>\n",
       "      <td>0.005581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>1</td>\n",
       "      <td>47</td>\n",
       "      <td>0.000056</td>\n",
       "      <td>0.005581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>1</td>\n",
       "      <td>50</td>\n",
       "      <td>0.000056</td>\n",
       "      <td>0.005581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>1</td>\n",
       "      <td>53</td>\n",
       "      <td>0.000056</td>\n",
       "      <td>0.005581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>1</td>\n",
       "      <td>55</td>\n",
       "      <td>0.000056</td>\n",
       "      <td>0.005581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>1</td>\n",
       "      <td>64</td>\n",
       "      <td>0.000056</td>\n",
       "      <td>0.005581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>1</td>\n",
       "      <td>67</td>\n",
       "      <td>0.000056</td>\n",
       "      <td>0.005581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>1</td>\n",
       "      <td>70</td>\n",
       "      <td>0.000056</td>\n",
       "      <td>0.005581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>1</td>\n",
       "      <td>73</td>\n",
       "      <td>0.000056</td>\n",
       "      <td>0.005581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>1</td>\n",
       "      <td>127</td>\n",
       "      <td>0.000056</td>\n",
       "      <td>0.005581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>1</td>\n",
       "      <td>145</td>\n",
       "      <td>0.000056</td>\n",
       "      <td>0.005581</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>1</td>\n",
       "      <td>1007</td>\n",
       "      <td>0.000056</td>\n",
       "      <td>0.005581</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 34
  },
  {
   "metadata": {},
   "cell_type": "markdown",
   "source": [
    "## Iteration 5: Study how CI-SC pairs are managed jointly or seperately.\n",
    "Todo: add comments"
   ],
   "id": "65fd8f656fd7c508"
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:57:29.254495200Z",
     "start_time": "2025-12-04T16:57:29.239363100Z"
    }
   },
   "cell_type": "code",
   "source": [
    "def get_ci_scs_in_sync(db_connection):\n",
    "    query = '''\n",
    "            :auto\n",
    "\n",
    "\n",
    "        MATCH (e:HighLevelEvent) - [:CORR] -> (o1) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType:'CI_SC'})\n",
    "MATCH (e) - [:CORR] -> (o2) - [:IS_OF_TYPE] -> (ot:ObjectType {objectType:'CI_SC'})\n",
    "WHERE o1 < o2\n",
    "WITH e, o1, o2\n",
    "CALL (e, o1, o2){\n",
    "  MATCH (f:HighLevelEvent)  - [:CORR] -> (o1)\n",
    "  MATCH (f) - [:CORR] -> (o2)\n",
    "  WHERE f.startTime >= e.startTime AND e <> f\n",
    "  RETURN f ORDER BY f.startTime limit 1\n",
    "} IN TRANSACTIONS\n",
    "CALL (o1, e, f){\n",
    "  MATCH p = SHORTEST 1 (e) - [:DF* {id: o1.sysId}] -> (f)\n",
    "  WITH p, nodes(p)[1..-1] as events\n",
    "  CALL (events) {\n",
    "    UNWIND events as event\n",
    "    WITH event ORDER BY event.activity\n",
    "    RETURN collect(distinct event.activity) as set_variant\n",
    "    }\n",
    "  RETURN nodes(p) as p_o1, set_variant as set_variant_o1\n",
    "} IN TRANSACTIONS\n",
    "CALL (o2, e, f){\n",
    "    MATCH p = SHORTEST 1 (e) - [:DF* {id: o2.sysId}] -> (f)\n",
    "  WITH p, nodes(p)[1..-1] as events\n",
    "  CALL (events) {\n",
    "    UNWIND events as event\n",
    "    WITH event ORDER BY event.activity\n",
    "    RETURN collect(distinct event.activity) as set_variant\n",
    "    }\n",
    "\n",
    "  RETURN nodes(p) as p_o2,  set_variant as  set_variant_o2\n",
    "\n",
    "} IN TRANSACTIONS\n",
    "    MATCH (o1) - [:RELATED] -> (ci1:ConfigurationItem)\n",
    "    MATCH (o2) - [:RELATED] -> (ci2:ConfigurationItem)\n",
    "    WITH o1, ci1, o2, ci2, p_o1, p_o2, set_variant_o1, set_variant_o2\n",
    "\n",
    "    CALL (set_variant_o1, set_variant_o2) {\n",
    "    WITH set_variant_o1, set_variant_o2, CASE\n",
    "        WHEN size(set_variant_o1) <= size(set_variant_o2) THEN set_variant_o1\n",
    "        ELSE set_variant_o2 END AS first_interruptions\n",
    "    WITH set_variant_o1, set_variant_o2, first_interruptions, CASE\n",
    "        WHEN first_interruptions = set_variant_o1 THEN set_variant_o2\n",
    "        ELSE set_variant_o1 END AS second_interruptions\n",
    "    WITH set_variant_o1, set_variant_o2, CASE\n",
    "        WHEN size(first_interruptions) = 0 THEN \" None\"\n",
    "        ELSE ltrim(reduce(init=\"\", item in first_interruptions | init + \"-\" + item), '-')  END AS interruptions_o1,\n",
    "    CASE\n",
    "        WHEN size(second_interruptions) = 0 THEN \" None\"\n",
    "        ELSE ltrim(reduce(init=\"\", item in second_interruptions | init + \"-\" + item), '-') END AS interruptions_o2\n",
    "    RETURN interruptions_o1, interruptions_o2}\n",
    "    RETURN o1.ciType as c1Type, o1.ciType as c2Type, interruptions_o1, interruptions_o2, count(o1) as occurrences\n",
    "\n",
    "    '''\n",
    "\n",
    "    result = pd.DataFrame(db_connection.exec_query(query=query))\n",
    "    table = pd.pivot_table(result, index=['interruptions_o1', 'interruptions_o2', 'c1Type', 'c2Type'], aggfunc=\"sum\")\n",
    "    table['%'] = (\n",
    "        round(\n",
    "            table.groupby(['c1Type', 'c2Type', 'interruptions_o1', 'interruptions_o2']).occurrences.transform(\"sum\") /\n",
    "            table.groupby(['c1Type', 'c2Type']).occurrences.transform(\"sum\") * 100,\n",
    "            2\n",
    "        )\n",
    "    )\n",
    "    return table\n"
   ],
   "id": "fb00da4e9e4847a1",
   "outputs": [],
   "execution_count": 35
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:57:34.225702200Z",
     "start_time": "2025-12-04T16:57:30.158227400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "result = get_ci_scs_in_sync(db_connection)\n",
    "result = result.reset_index()\n"
   ],
   "id": "c872377d179d88a",
   "outputs": [],
   "execution_count": 36
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:58:02.160025600Z",
     "start_time": "2025-12-04T16:58:02.122714400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "result = result[\n",
    "    (result['interruptions_o1'].str.contains('Incident') | result['interruptions_o1'].str.contains('Interaction')) & (\n",
    "            result['interruptions_o2'].str.contains('Incident') | result['interruptions_o2'].str.contains(\n",
    "        'Interaction'))]\n",
    "table = pd.pivot_table(result, index=['interruptions_o1', 'interruptions_o2', 'c1Type', 'c2Type'], aggfunc=\"sum\")\n",
    "table.occurrences"
   ],
   "id": "ad9fd2100c8c1da9",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "interruptions_o1             interruptions_o2             c1Type       c2Type     \n",
       "Change-Incident              Change-Incident-Interaction  application  application     1\n",
       "                                                          storage      storage         1\n",
       "Change-Incident-Interaction  Change-Incident-Interaction  application  application    19\n",
       "                                                          computer     computer        3\n",
       "                                                          hardware     hardware        1\n",
       "Change-Interaction           Change-Incident              computer     computer        1\n",
       "                             Change-Incident-Interaction  application  application    12\n",
       "                                                          computer     computer       11\n",
       "                             Change-Interaction           computer     computer        1\n",
       "Incident                     Change-Incident-Interaction  application  application     1\n",
       "                             Change-Interaction           application  application     1\n",
       "Incident-Interaction         Change-Incident-Interaction  application  application     5\n",
       "                                                          computer     computer        3\n",
       "                             Change-Interaction           application  application     1\n",
       "                                                          computer     computer        3\n",
       "                             Incident-Interaction         application  application    12\n",
       "                                                          computer     computer       14\n",
       "Interaction                  Change-Incident              application  application     1\n",
       "                             Change-Incident-Interaction  application  application     7\n",
       "                                                          computer     computer        2\n",
       "                             Change-Interaction           application  application     2\n",
       "                                                          computer     computer        3\n",
       "                             Incident-Interaction         application  application     7\n",
       "                                                          computer     computer       10\n",
       "                                                          storage      storage         1\n",
       "                             Interaction                  application  application     1\n",
       "                                                          computer     computer        2\n",
       "                                                          storage      storage         1\n",
       "Name: occurrences, dtype: int64"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 39
  },
  {
   "metadata": {
    "ExecuteTime": {
     "end_time": "2025-12-04T16:57:39.293171600Z",
     "start_time": "2025-12-04T16:57:39.243152400Z"
    }
   },
   "cell_type": "code",
   "source": [
    "new_result = result.reset_index()\n",
    "new_result = new_result.drop(columns=['c1Type', 'c2Type', '%'])\n",
    "table = pd.pivot_table(new_result, index=['interruptions_o1', 'interruptions_o2'], aggfunc=\"sum\")\n",
    "table['%'] = (\n",
    "    round(\n",
    "        table.groupby(['interruptions_o1', 'interruptions_o2']).occurrences.transform(\"sum\") /\n",
    "        sum(table.occurrences) * 100,\n",
    "        2\n",
    "    )\n",
    ")\n",
    "table\n"
   ],
   "id": "dee1fe0f2c0916f9",
   "outputs": [
    {
     "data": {
      "text/plain": [
       "                                                         index  occurrences      %\n",
       "interruptions_o1            interruptions_o2                                      \n",
       "Change-Incident             Change-Incident-Interaction    159            2   1.57\n",
       "Change-Incident-Interaction Change-Incident-Interaction    246           23  18.11\n",
       "Change-Interaction          Change-Incident                 84            1   0.79\n",
       "                            Change-Incident-Interaction    171           23  18.11\n",
       "                            Change-Interaction              87            1   0.79\n",
       "Incident                    Change-Incident-Interaction     89            1   0.79\n",
       "                            Change-Interaction              90            1   0.79\n",
       "Incident-Interaction        Change-Incident-Interaction    183            8   6.30\n",
       "                            Change-Interaction             187            4   3.15\n",
       "                            Incident-Interaction           191           26  20.47\n",
       "Interaction                 Change-Incident                101            1   0.79\n",
       "                            Change-Incident-Interaction    205            9   7.09\n",
       "                            Change-Interaction             209            5   3.94\n",
       "                            Incident-Interaction           321           18  14.17\n",
       "                            Interaction                    330            4   3.15"
      ],
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th>index</th>\n",
       "      <th>occurrences</th>\n",
       "      <th>%</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>interruptions_o1</th>\n",
       "      <th>interruptions_o2</th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>Change-Incident</th>\n",
       "      <th>Change-Incident-Interaction</th>\n",
       "      <td>159</td>\n",
       "      <td>2</td>\n",
       "      <td>1.57</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Change-Incident-Interaction</th>\n",
       "      <th>Change-Incident-Interaction</th>\n",
       "      <td>246</td>\n",
       "      <td>23</td>\n",
       "      <td>18.11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"3\" valign=\"top\">Change-Interaction</th>\n",
       "      <th>Change-Incident</th>\n",
       "      <td>84</td>\n",
       "      <td>1</td>\n",
       "      <td>0.79</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Change-Incident-Interaction</th>\n",
       "      <td>171</td>\n",
       "      <td>23</td>\n",
       "      <td>18.11</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Change-Interaction</th>\n",
       "      <td>87</td>\n",
       "      <td>1</td>\n",
       "      <td>0.79</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"2\" valign=\"top\">Incident</th>\n",
       "      <th>Change-Incident-Interaction</th>\n",
       "      <td>89</td>\n",
       "      <td>1</td>\n",
       "      <td>0.79</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Change-Interaction</th>\n",
       "      <td>90</td>\n",
       "      <td>1</td>\n",
       "      <td>0.79</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"3\" valign=\"top\">Incident-Interaction</th>\n",
       "      <th>Change-Incident-Interaction</th>\n",
       "      <td>183</td>\n",
       "      <td>8</td>\n",
       "      <td>6.30</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Change-Interaction</th>\n",
       "      <td>187</td>\n",
       "      <td>4</td>\n",
       "      <td>3.15</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Incident-Interaction</th>\n",
       "      <td>191</td>\n",
       "      <td>26</td>\n",
       "      <td>20.47</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th rowspan=\"5\" valign=\"top\">Interaction</th>\n",
       "      <th>Change-Incident</th>\n",
       "      <td>101</td>\n",
       "      <td>1</td>\n",
       "      <td>0.79</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Change-Incident-Interaction</th>\n",
       "      <td>205</td>\n",
       "      <td>9</td>\n",
       "      <td>7.09</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Change-Interaction</th>\n",
       "      <td>209</td>\n",
       "      <td>5</td>\n",
       "      <td>3.94</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Incident-Interaction</th>\n",
       "      <td>321</td>\n",
       "      <td>18</td>\n",
       "      <td>14.17</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Interaction</th>\n",
       "      <td>330</td>\n",
       "      <td>4</td>\n",
       "      <td>3.15</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ]
     },
     "execution_count": 38,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "execution_count": 38
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "promg",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
