{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "537085a2",
   "metadata": {},
   "outputs": [],
   "source": [
    "from pathlib import Path\n",
    "from promg.modules.db_management import DBManagement\n",
    "from promg import Configuration, DatabaseConnection, Performance, SemanticHeader, DatasetDescriptions, OcedPg, Query\n",
    "\n",
    "import yaml"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "60b6e72b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "These are the credentials that I expect to be set for the database.\n",
      "db_name: neo4j\n",
      "uri: bolt://localhost:7687\n",
      "password: bpic2014\n",
      "----------------------\n",
      "If you have other credentials, please change them at: bpic14\\config.yaml\n"
     ]
    }
   ],
   "source": [
    "case_study = 'bpic14'\n",
    "\n",
    "conf_path = Path(case_study, 'config.yaml')\n",
    "config = yaml.safe_load(open(conf_path))\n",
    "\n",
    "print(f\"These are the credentials that I expect to be set for the database.\")\n",
    "print(f\"db_name: {config['db_name']}\")\n",
    "print(f\"uri: {config['uri']}\")\n",
    "print(f\"password: {config['password']}\")\n",
    "print(\"----------------------\")\n",
    "print(f\"If you have other credentials, please change them at: {conf_path}\")\n",
    "\n",
    "config = Configuration.init_conf_with_config_file(conf_path)\n",
    "db_connection = DatabaseConnection.set_up_connection(config=config)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "ca768b4f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# clear previously created nodes and relations\n",
    "# start/end relations\n",
    "qClearStart = f'''MATCH (n)<-[r:START]-(e:Event) DELETE r'''\n",
    "db_connection.exec_query(qClearStart)\n",
    "qClearEnd = f'''MATCH (n)<-[r:END]-(e:Event) DELETE r'''\n",
    "db_connection.exec_query(qClearEnd)\n",
    "# high-level events\n",
    "qClearStartHLE = f'''MATCH (n)<-[r:START]-(e:HighLevelEvent) DELETE r'''\n",
    "db_connection.exec_query(qClearStartHLE)\n",
    "qClearEndHLE = f'''MATCH (n)<-[r:END]-(e:HighLevelEvent) DELETE r'''\n",
    "db_connection.exec_query(qClearEndHLE)\n",
    "qClearHighLevelEvent = f'''MATCH (h:HighLevelEvent) DETACH DELETE h'''\n",
    "db_connection.exec_query(qClearHighLevelEvent)\n",
    "qClearHL_DF = f'''MATCH (:Event)-[r:HL_DF]-(e:Event) DELETE r'''\n",
    "db_connection.exec_query(qClearHL_DF)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "3c288895",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<bound method Result.single of <neo4j._sync.work.result.Result object at 0x00000221C9219910>>\n"
     ]
    }
   ],
   "source": [
    "# fix DF relations for incidents\n",
    "qDeleteDFIncidents = f'''\n",
    "    MATCH (e1:Event)-[df:DF {{objectType:\"Incident\"}}]->(e2:Event)\n",
    "    DELETE df\n",
    "'''\n",
    "db_connection.exec_query(qDeleteDFIncidents)\n",
    "\n",
    "with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "    qBuildDFIncidents = f'''\n",
    "        MATCH (e:Event)-[:CORR]->(o:Incident)\n",
    "        WHERE e.timestamp IS NOT NULL\n",
    "        WITH o, e ORDER BY e.timestamp, ID(e)\n",
    "        WITH o, collect(e) AS events\n",
    "        UNWIND range(0, size(events)-2) AS idx\n",
    "        WITH events[idx] AS fromEv, events[idx+1] AS toEv, o.sysId AS objSysId\n",
    "        MERGE (fromEv)-[rel:DF {{objectType:\"Incident\", id:objSysId}}]->(toEv)\n",
    "    '''\n",
    "    result = session.run(qBuildDFIncidents)\n",
    "    result.consume()\n",
    "    print(str(result.single))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "3ab1924a",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Inferring start and end events for object type: Change\n",
      "[]\n",
      "[]\n",
      "Inferring start and end events for object type: Incident\n",
      "[]\n",
      "[]\n",
      "Inferring start and end events for object type: Interaction\n",
      "[]\n",
      "[]\n"
     ]
    }
   ],
   "source": [
    "# infer start and end events for each object type\n",
    "objectTypes = [\"Change\", \"Incident\", \"Interaction\"]\n",
    "for objectType in objectTypes:\n",
    "    print(f\"Inferring start and end events for object type: {objectType}\")\n",
    "\n",
    "    qStartEvent = f'''\n",
    "    // Infer start event of an object\n",
    "    MATCH (n:{objectType})\n",
    "    MATCH (n)<-[c:CORR]-(e:Event) WHERE NOT ()-[:DF {{id:n.sysId}}]->(e)\n",
    "    MERGE (n)<-[:START]-(e)\n",
    "    '''\n",
    "    result = db_connection.exec_query(qStartEvent)\n",
    "    print(result)\n",
    "\n",
    "    qEndEvent = f'''\n",
    "    // Infer start event of an object\n",
    "    MATCH (n:{objectType})\n",
    "    MATCH (n)<-[c:CORR]-(e:Event) WHERE NOT (e)-[:DF {{id:n.sysId}}]->()\n",
    "    MERGE (n)<-[:END]-(e)\n",
    "    '''\n",
    "    db_connection.exec_query(qEndEvent)\n",
    "    print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "57982ba2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<bound method Result.single of <neo4j._sync.work.result.Result object at 0x00000221C97381D0>>\n"
     ]
    }
   ],
   "source": [
    "# materialize time between events as duration on DF edge\n",
    "with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "    qMaterializeDurationonDF = f'''\n",
    "        MATCH (e1:Event)-[df:DF]->(e2:Event) WHERE df.duration IS NOT NULL\n",
    "        CALL {{\n",
    "            WITH e1,e2,df\n",
    "            SET df.duration = duration.inSeconds(e1.timestamp, e2.timestamp).seconds    \n",
    "        }} IN TRANSACTIONS OF 1000 ROWS\n",
    "        RETURN count(*) AS total\n",
    "    '''\n",
    "    result = session.run(qMaterializeDurationonDF)\n",
    "    result.consume()\n",
    "    print(str(result.single))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "98e4243c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# build index for high-level events\n",
    "qCreateIndexHLE_sys = f'''\n",
    "    CREATE INDEX highLevelEventSysIdIndex IF NOT EXISTS FOR (h:HighLevelEvent) ON (h.sysId);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_sys) \n",
    "qCreateIndexHLE_start = f'''\n",
    "    CREATE INDEX highLevelEventStartTimeIndex IF NOT EXISTS FOR (h:HighLevelEvent) ON (h.startTime);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_start) \n",
    "qCreateIndexHLE_end = f'''\n",
    "    CREATE INDEX highLevelEventEndTimeIndex IF NOT EXISTS FOR (h:HighLevelEvent) ON (h.endTime);\n",
    "'''\n",
    "db_connection.exec_query(qCreateIndexHLE_end) \n",
    "\n",
    "# build high-level events\n",
    "qBuildHighLevelEvent = f'''\n",
    "    MATCH (eStart:Event)-[st:START]->(n)<-[en:END]-(eEnd:Event) \n",
    "    MERGE (h:HighLevelEvent {{sysId: eStart.sysId + \"_\" + eEnd.sysId}})\n",
    "    ON CREATE SET h.startTime=eStart.timestamp, h.endTime=eEnd.timestamp, h.activity=labels(n)[0]\n",
    "    MERGE (h)-[:START]->(eStart)\n",
    "    MERGE (h)-[:END]->(eEnd)\n",
    "'''\n",
    "db_connection.exec_query(qBuildHighLevelEvent)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "fd4364e7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# lift CORR to high-level events\n",
    "qLiftCorrToHL = f'''\n",
    "    MATCH (h:HighLevelEvent)-[:START]->(eStart:Event)-[:CORR]->(n)\n",
    "    MERGE (h)-[:CORR]->(n)\n",
    "'''\n",
    "db_connection.exec_query(qLiftCorrToHL)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "d9d5e7e1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<bound method Result.single of <neo4j._sync.work.result.Result object at 0x00000221C8C224D0>>\n"
     ]
    }
   ],
   "source": [
    "# build DF relations between high-level events\n",
    "# step 1: build HL-DF relations between events\n",
    "with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "    qBuildDfRelationsHLE = f'''\n",
    "        // get only START/END events of each HL event correlated to CI_SC\n",
    "        MATCH (o:CI_SC)<-[:CORR]-(h:HighLevelEvent)-->(e:Event)\n",
    "        // order by time\n",
    "        WHERE e.timestamp IS NOT NULL\n",
    "        WITH o, e ORDER BY e.timestamp, ID(e)\n",
    "        WITH o, collect(e) AS events\n",
    "        UNWIND range(0, size(events)-2) AS idx\n",
    "        WITH events[idx] AS fromEv, events[idx+1] AS toEv, o\n",
    "        CALL {{\n",
    "            // for each pair of succeeding START/END events\n",
    "            WITH fromEv,toEv,o\n",
    "            //MERGE (fromEv)-[rel:HL_DF {{objectType:\"CI_SC\", id:o.sysId}}]->(toEv)\n",
    "            // get their HL events correlated to the same object\n",
    "            MATCH (fromEv)<--(h1:HighLevelEvent)-[:CORR]->(o)<-[:CORR]-(h2:HighLevelEvent)-->(toEv) WHERE h1 <> h2\n",
    "            // and add their DF relation\n",
    "            MERGE (h1)-[rel:DF {{objectType:\"CI_SC\", id:o.sysId}}]->(h2)\n",
    "        }} IN TRANSACTIONS OF 10000 ROWS\n",
    "        RETURN count(*) AS total\n",
    "    '''\n",
    "    result = session.run(qBuildDfRelationsHLE)\n",
    "    result.consume()\n",
    "    print(str(result.single))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2ccec5a9",
   "metadata": {},
   "outputs": [
    {
     "ename": "KeyboardInterrupt",
     "evalue": "",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mKeyboardInterrupt\u001b[0m                         Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[10], line 12\u001b[0m\n\u001b[0;32m      3\u001b[0m qLiftHlDfRelations \u001b[38;5;241m=\u001b[39m \u001b[38;5;124mf\u001b[39m\u001b[38;5;124m'''\u001b[39m\n\u001b[0;32m      4\u001b[0m \u001b[38;5;124m    MATCH (h1:HighLevelEvent)-[:END]->(e1:Event)-[df:HL_DF]->(e2:Event)<-[:START]-(h2:HighLevelEvent)\u001b[39m\n\u001b[0;32m      5\u001b[0m \u001b[38;5;124m    CALL \u001b[39m\u001b[38;5;130;01m{{\u001b[39;00m\n\u001b[1;32m   (...)\u001b[0m\n\u001b[0;32m      9\u001b[0m \u001b[38;5;124m    RETURN count(*) AS total\u001b[39m\n\u001b[0;32m     10\u001b[0m \u001b[38;5;124m\u001b[39m\u001b[38;5;124m'''\u001b[39m\n\u001b[0;32m     11\u001b[0m result \u001b[38;5;241m=\u001b[39m session\u001b[38;5;241m.\u001b[39mrun(qLiftHlDfRelations)\n\u001b[1;32m---> 12\u001b[0m \u001b[43mresult\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mconsume\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m     13\u001b[0m \u001b[38;5;28mprint\u001b[39m(\u001b[38;5;28mstr\u001b[39m(result\u001b[38;5;241m.\u001b[39msingle))\n",
      "File \u001b[1;32mc:\\Users\\dfahland\\AppData\\Local\\Programs\\Python\\Python311\\Lib\\site-packages\\neo4j\\_sync\\work\\result.py:434\u001b[0m, in \u001b[0;36mResult.consume\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    431\u001b[0m \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_consumed:\n\u001b[0;32m    432\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_obtain_summary()\n\u001b[1;32m--> 434\u001b[0m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_exhaust\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    435\u001b[0m summary \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_obtain_summary()\n\u001b[0;32m    436\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_consumed \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;01mTrue\u001b[39;00m\n",
      "File \u001b[1;32mc:\\Users\\dfahland\\AppData\\Local\\Programs\\Python\\Python311\\Lib\\site-packages\\neo4j\\_sync\\work\\result.py:365\u001b[0m, in \u001b[0;36mResult._exhaust\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    363\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_discarding \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;01mTrue\u001b[39;00m\n\u001b[0;32m    364\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_record_buffer\u001b[38;5;241m.\u001b[39mclear()\n\u001b[1;32m--> 365\u001b[0m \u001b[38;5;28;01mfor\u001b[39;00m _ \u001b[38;5;129;01min\u001b[39;00m \u001b[38;5;28mself\u001b[39m:\n\u001b[0;32m    366\u001b[0m     \u001b[38;5;28;01mpass\u001b[39;00m\n",
      "File \u001b[1;32mc:\\Users\\dfahland\\AppData\\Local\\Programs\\Python\\Python311\\Lib\\site-packages\\neo4j\\_sync\\work\\result.py:270\u001b[0m, in \u001b[0;36mResult.__iter__\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    268\u001b[0m     \u001b[38;5;28;01myield\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_record_buffer\u001b[38;5;241m.\u001b[39mpopleft()\n\u001b[0;32m    269\u001b[0m \u001b[38;5;28;01melif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_streaming:\n\u001b[1;32m--> 270\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_connection\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mfetch_message\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    271\u001b[0m \u001b[38;5;28;01melif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_discarding:\n\u001b[0;32m    272\u001b[0m     \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_discard()\n",
      "File \u001b[1;32mc:\\Users\\dfahland\\AppData\\Local\\Programs\\Python\\Python311\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:178\u001b[0m, in \u001b[0;36mConnectionErrorHandler.__getattr__.<locals>.outer.<locals>.inner\u001b[1;34m(*args, **kwargs)\u001b[0m\n\u001b[0;32m    176\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21minner\u001b[39m(\u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs):\n\u001b[0;32m    177\u001b[0m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[1;32m--> 178\u001b[0m         \u001b[43mfunc\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    179\u001b[0m     \u001b[38;5;28;01mexcept\u001b[39;00m (Neo4jError, ServiceUnavailable, SessionExpired) \u001b[38;5;28;01mas\u001b[39;00m exc:\n\u001b[0;32m    180\u001b[0m         \u001b[38;5;28;01massert\u001b[39;00m \u001b[38;5;129;01mnot\u001b[39;00m asyncio\u001b[38;5;241m.\u001b[39miscoroutinefunction(\u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m__on_error)\n",
      "File \u001b[1;32mc:\\Users\\dfahland\\AppData\\Local\\Programs\\Python\\Python311\\Lib\\site-packages\\neo4j\\_sync\\io\\_bolt.py:846\u001b[0m, in \u001b[0;36mBolt.fetch_message\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    843\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;241m0\u001b[39m, \u001b[38;5;241m0\u001b[39m\n\u001b[0;32m    845\u001b[0m \u001b[38;5;66;03m# Receive exactly one message\u001b[39;00m\n\u001b[1;32m--> 846\u001b[0m tag, fields \u001b[38;5;241m=\u001b[39m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43minbox\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mpop\u001b[49m\u001b[43m(\u001b[49m\n\u001b[0;32m    847\u001b[0m \u001b[43m    \u001b[49m\u001b[43mhydration_hooks\u001b[49m\u001b[38;5;241;43m=\u001b[39;49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mresponses\u001b[49m\u001b[43m[\u001b[49m\u001b[38;5;241;43m0\u001b[39;49m\u001b[43m]\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mhydration_hooks\u001b[49m\n\u001b[0;32m    848\u001b[0m \u001b[43m\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    849\u001b[0m res \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_process_message(tag, fields)\n\u001b[0;32m    850\u001b[0m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39midle_since \u001b[38;5;241m=\u001b[39m monotonic()\n",
      "File \u001b[1;32mc:\\Users\\dfahland\\AppData\\Local\\Programs\\Python\\Python311\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:72\u001b[0m, in \u001b[0;36mInbox.pop\u001b[1;34m(self, hydration_hooks)\u001b[0m\n\u001b[0;32m     71\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mpop\u001b[39m(\u001b[38;5;28mself\u001b[39m, hydration_hooks):\n\u001b[1;32m---> 72\u001b[0m     \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_buffer_one_chunk\u001b[49m\u001b[43m(\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m     73\u001b[0m     \u001b[38;5;28;01mtry\u001b[39;00m:\n\u001b[0;32m     74\u001b[0m         size, tag \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_unpacker\u001b[38;5;241m.\u001b[39munpack_structure_header()\n",
      "File \u001b[1;32mc:\\Users\\dfahland\\AppData\\Local\\Programs\\Python\\Python311\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:51\u001b[0m, in \u001b[0;36mInbox._buffer_one_chunk\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m     48\u001b[0m \u001b[38;5;28;01mwhile\u001b[39;00m \u001b[38;5;28;01mTrue\u001b[39;00m:\n\u001b[0;32m     49\u001b[0m     \u001b[38;5;28;01mwhile\u001b[39;00m chunk_size \u001b[38;5;241m==\u001b[39m \u001b[38;5;241m0\u001b[39m:\n\u001b[0;32m     50\u001b[0m         \u001b[38;5;66;03m# Determine the chunk size and skip noop\u001b[39;00m\n\u001b[1;32m---> 51\u001b[0m         \u001b[43mreceive_into_buffer\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_socket\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_buffer\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m2\u001b[39;49m\u001b[43m)\u001b[49m\n\u001b[0;32m     52\u001b[0m         chunk_size \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_buffer\u001b[38;5;241m.\u001b[39mpop_u16()\n\u001b[0;32m     53\u001b[0m         \u001b[38;5;28;01mif\u001b[39;00m chunk_size \u001b[38;5;241m==\u001b[39m \u001b[38;5;241m0\u001b[39m:\n",
      "File \u001b[1;32mc:\\Users\\dfahland\\AppData\\Local\\Programs\\Python\\Python311\\Lib\\site-packages\\neo4j\\_sync\\io\\_common.py:326\u001b[0m, in \u001b[0;36mreceive_into_buffer\u001b[1;34m(sock, buffer, n_bytes)\u001b[0m\n\u001b[0;32m    324\u001b[0m \u001b[38;5;28;01mwith\u001b[39;00m \u001b[38;5;28mmemoryview\u001b[39m(buffer\u001b[38;5;241m.\u001b[39mdata) \u001b[38;5;28;01mas\u001b[39;00m view:\n\u001b[0;32m    325\u001b[0m     \u001b[38;5;28;01mwhile\u001b[39;00m buffer\u001b[38;5;241m.\u001b[39mused \u001b[38;5;241m<\u001b[39m end:\n\u001b[1;32m--> 326\u001b[0m         n \u001b[38;5;241m=\u001b[39m \u001b[43msock\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrecv_into\u001b[49m\u001b[43m(\u001b[49m\u001b[43mview\u001b[49m\u001b[43m[\u001b[49m\u001b[43mbuffer\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mused\u001b[49m\u001b[43m:\u001b[49m\u001b[43mend\u001b[49m\u001b[43m]\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mend\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m-\u001b[39;49m\u001b[43m \u001b[49m\u001b[43mbuffer\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mused\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    327\u001b[0m         \u001b[38;5;28;01mif\u001b[39;00m n \u001b[38;5;241m==\u001b[39m \u001b[38;5;241m0\u001b[39m:\n\u001b[0;32m    328\u001b[0m             \u001b[38;5;28;01mraise\u001b[39;00m \u001b[38;5;167;01mOSError\u001b[39;00m(\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mNo data\u001b[39m\u001b[38;5;124m\"\u001b[39m)\n",
      "File \u001b[1;32mc:\\Users\\dfahland\\AppData\\Local\\Programs\\Python\\Python311\\Lib\\site-packages\\neo4j\\_async_compat\\network\\_bolt_socket.py:493\u001b[0m, in \u001b[0;36mBoltSocket.recv_into\u001b[1;34m(self, buffer, nbytes)\u001b[0m\n\u001b[0;32m    492\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mrecv_into\u001b[39m(\u001b[38;5;28mself\u001b[39m, buffer, nbytes):\n\u001b[1;32m--> 493\u001b[0m     \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_wait_for_io\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;28;43mself\u001b[39;49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43m_socket\u001b[49m\u001b[38;5;241;43m.\u001b[39;49m\u001b[43mrecv_into\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mbuffer\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[43mnbytes\u001b[49m\u001b[43m)\u001b[49m\n",
      "File \u001b[1;32mc:\\Users\\dfahland\\AppData\\Local\\Programs\\Python\\Python311\\Lib\\site-packages\\neo4j\\_async_compat\\network\\_bolt_socket.py:468\u001b[0m, in \u001b[0;36mBoltSocket._wait_for_io\u001b[1;34m(self, func, *args, **kwargs)\u001b[0m\n\u001b[0;32m    466\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21m_wait_for_io\u001b[39m(\u001b[38;5;28mself\u001b[39m, func, \u001b[38;5;241m*\u001b[39margs, \u001b[38;5;241m*\u001b[39m\u001b[38;5;241m*\u001b[39mkwargs):\n\u001b[0;32m    467\u001b[0m     \u001b[38;5;28;01mif\u001b[39;00m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_deadline \u001b[38;5;129;01mis\u001b[39;00m \u001b[38;5;28;01mNone\u001b[39;00m:\n\u001b[1;32m--> 468\u001b[0m         \u001b[38;5;28;01mreturn\u001b[39;00m \u001b[43mfunc\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43margs\u001b[49m\u001b[43m,\u001b[49m\u001b[43m \u001b[49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[38;5;241;43m*\u001b[39;49m\u001b[43mkwargs\u001b[49m\u001b[43m)\u001b[49m\n\u001b[0;32m    469\u001b[0m     timeout \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_socket\u001b[38;5;241m.\u001b[39mgettimeout()\n\u001b[0;32m    470\u001b[0m     deadline_timeout \u001b[38;5;241m=\u001b[39m \u001b[38;5;28mself\u001b[39m\u001b[38;5;241m.\u001b[39m_deadline\u001b[38;5;241m.\u001b[39mto_timeout()\n",
      "\u001b[1;31mKeyboardInterrupt\u001b[0m: "
     ]
    }
   ],
   "source": [
    "# build DF relations between high-level events\n",
    "with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "    qBuildDfRelationsHLE = f'''\n",
    "        // get only START/END events of each HL event correlated to CI_SC\n",
    "        MATCH (o:CI_SC)<-[:CORR]-(h:HighLevelEvent)-->(e:Event)\n",
    "        // order by time\n",
    "        WHERE e.timestamp IS NOT NULL\n",
    "        WITH o, e ORDER BY e.timestamp, ID(e)\n",
    "        WITH o, collect(e) AS events\n",
    "        UNWIND range(0, size(events)-2) AS idx\n",
    "        WITH events[idx] AS fromEv, events[idx+1] AS toEv, o\n",
    "        CALL {{\n",
    "            // for each pair of succeeding START/END events\n",
    "            WITH fromEv,toEv,o\n",
    "            // get their HL events correlated to the same object\n",
    "            MATCH (fromEv)<--(h1:HighLevelEvent)-[:CORR]->(o)<-[:CORR]-(h2:HighLevelEvent)-->(toEv) WHERE h1 <> h2\n",
    "            // and add their DF relation\n",
    "            MERGE (h1)-[rel:DF {{objectType:\"CI_SC\", id:o.sysId}}]->(h2)\n",
    "        }} IN TRANSACTIONS OF 10000 ROWS\n",
    "        RETURN count(*) AS total\n",
    "    '''\n",
    "    result = session.run(qBuildDfRelationsHLE)\n",
    "    result.consume()\n",
    "    print(str(result.single))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e1a441da",
   "metadata": {},
   "outputs": [],
   "source": [
    "# lift DF relations from events to high-level events\n",
    "qLiftDfRelations = f'''\n",
    "    call apoc.periodic.iterate(\n",
    "    'MATCH (h1:HighLevelEvent)-[:END]->(e1:Event)-[df:DF]->(e2:Event)<-[:START]-(h2:HighLevelEvent)\n",
    "     RETURN h1,df,h2',\n",
    "    'MERGE (h1)-[df2:DF]->(h2) ON CREATE SET df2 = properties(df)',\n",
    "    {{batchSize:1000, parallel:false}})\n",
    "    YIELD total\n",
    "    RETURN total\n",
    "'''\n",
    "result = db_connection.exec_query(qLiftDfRelations)\n",
    "print(result)\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3ab433df",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<neo4j._sync.work.result.Result object at 0x000002754A4B4DD0>\n"
     ]
    }
   ],
   "source": [
    "# lift DF relations from events to high-level events\n",
    "with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "    qLiftDfRelations = f'''\n",
    "        MATCH (h1:HighLevelEvent)-[:END]->(e1:Event)-[df:DF]->(e2:Event)<-[:START]-(h2:HighLevelEvent)\n",
    "        CALL {{\n",
    "            WITH h1,df,h2\n",
    "            MERGE (h1)-[df2:DF]->(h2) ON CREATE SET df2 = properties(df)\n",
    "        }} IN TRANSACTIONS OF 1000 ROWS\n",
    "        RETURN count(*) AS total\n",
    "    '''\n",
    "    result = session.run(qLiftDfRelations)\n",
    "    result.consume()\n",
    "    print(result.single)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c7283805",
   "metadata": {},
   "outputs": [],
   "source": [
    "# find overlapping high-level events and create DURING relations\n",
    "with db_connection.driver.get_session(database=db_connection.db_name) as session:\n",
    "    qFindContainedHLEvents = f'''\n",
    "        MATCH (h1:HighLevelEvent)-[c1:CORR]->(n:CI_SC)<-[c2:CORR]-(h2:HighLevelEvent) WHERE h1 <> h2\n",
    "        WHERE h1.startTime < h2.startTime AND h2.endTime < h1.endTime\n",
    "        CALL {{\n",
    "            WITH h1,h2\n",
    "            MERGE (h2)-[:DURING]->(h1)\n",
    "        }} IN TRANSACTIONS OF 1000 ROWS\n",
    "        RETURN count(*) AS total\n",
    "    '''\n",
    "    result = session.run(qFindContainedHLEvents)\n",
    "    result.consume()\n",
    "    print(result.single)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.1"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
